Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxSrc_reg.h
/** \brief  A0, ASCLIN Error Service Request */
#define SRC_ASCLIN_ASCLIN6_ERR /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF00380A0u)

/** Alias (User Manual Name) for SRC_ASCLIN_ASCLIN6_ERR.
* To use register names with standard convension, please use SRC_ASCLIN_ASCLIN6_ERR.
*/
#define	SRC_ASCLIN6ERR	(SRC_ASCLIN_ASCLIN6_ERR)

/** \brief  9C, ASCLIN Receive Service Request */
#define SRC_ASCLIN_ASCLIN6_RX /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF003809Cu)

/** Alias (User Manual Name) for SRC_ASCLIN_ASCLIN6_RX.
* To use register names with standard convension, please use SRC_ASCLIN_ASCLIN6_RX.
*/
#define	SRC_ASCLIN6RX	(SRC_ASCLIN_ASCLIN6_RX)

/** \brief  98, ASCLIN Transmit Service Request */
#define SRC_ASCLIN_ASCLIN6_TX /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038098u)

/** Alias (User Manual Name) for SRC_ASCLIN_ASCLIN6_TX.
* To use register names with standard convension, please use SRC_ASCLIN_ASCLIN6_TX.
*/
#define	SRC_ASCLIN6TX	(SRC_ASCLIN_ASCLIN6_TX)

/** \brief  AC, ASCLIN Error Service Request */
#define SRC_ASCLIN_ASCLIN7_ERR /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF00380ACu)

/** Alias (User Manual Name) for SRC_ASCLIN_ASCLIN7_ERR.
* To use register names with standard convension, please use SRC_ASCLIN_ASCLIN7_ERR.
*/
#define	SRC_ASCLIN7ERR	(SRC_ASCLIN_ASCLIN7_ERR)

/** \brief  A8, ASCLIN Receive Service Request */
#define SRC_ASCLIN_ASCLIN7_RX /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF00380A8u)

/** Alias (User Manual Name) for SRC_ASCLIN_ASCLIN7_RX.
* To use register names with standard convension, please use SRC_ASCLIN_ASCLIN7_RX.
*/
#define	SRC_ASCLIN7RX	(SRC_ASCLIN_ASCLIN7_RX)

/** \brief  A4, ASCLIN Transmit Service Request */
#define SRC_ASCLIN_ASCLIN7_TX /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF00380A4u)

/** Alias (User Manual Name) for SRC_ASCLIN_ASCLIN7_TX.
* To use register names with standard convension, please use SRC_ASCLIN_ASCLIN7_TX.
*/
#define	SRC_ASCLIN7TX	(SRC_ASCLIN_ASCLIN7_TX)

/** \brief  24, Bus Control Unit BBB Service Request */
#define SRC_BCU_BCU_BBB /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038024u)

/** Alias (User Manual Name) for SRC_BCU_BCU_BBB.
* To use register names with standard convension, please use SRC_BCU_BCU_BBB.
*/
#define	SRC_BCUBBB	(SRC_BCU_BCU_BBB)

/** \brief  20, Bus Control Unit SPB Service Request */
#define SRC_BCU_BCU_SPB /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038020u)

/** Alias (User Manual Name) for SRC_BCU_BCU_SPB.
* To use register names with standard convension, please use SRC_BCU_BCU_SPB.
*/
#define	SRC_BCUSPB	(SRC_BCU_BCU_SPB)

/** \brief  580, CAN Service Request 0 */
#define SRC_CAN_CAN0_INT0 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038580u)

/** Alias (User Manual Name) for SRC_CAN_CAN0_INT0.
* To use register names with standard convension, please use SRC_CAN_CAN0_INT0.
*/
#define	SRC_CAN0INT0	(SRC_CAN_CAN0_INT0)

/** \brief  584, CAN Service Request 0 */
#define SRC_CAN_CAN0_INT1 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038584u)

/** Alias (User Manual Name) for SRC_CAN_CAN0_INT1.
* To use register names with standard convension, please use SRC_CAN_CAN0_INT1.
*/
#define	SRC_CAN0INT1	(SRC_CAN_CAN0_INT1)

/** \brief  5A8, CAN Service Request 0 */
#define SRC_CAN_CAN0_INT10 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF00385A8u)

/** Alias (User Manual Name) for SRC_CAN_CAN0_INT10.
* To use register names with standard convension, please use SRC_CAN_CAN0_INT10.
*/
#define	SRC_CAN0INT10	(SRC_CAN_CAN0_INT10)

/** \brief  5AC, CAN Service Request 0 */
#define SRC_CAN_CAN0_INT11 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF00385ACu)

/** Alias (User Manual Name) for SRC_CAN_CAN0_INT11.
* To use register names with standard convension, please use SRC_CAN_CAN0_INT11.
*/
#define	SRC_CAN0INT11	(SRC_CAN_CAN0_INT11)

/** \brief  5B0, CAN Service Request 0 */
#define SRC_CAN_CAN0_INT12 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF00385B0u)

/** Alias (User Manual Name) for SRC_CAN_CAN0_INT12.
* To use register names with standard convension, please use SRC_CAN_CAN0_INT12.
*/
#define	SRC_CAN0INT12	(SRC_CAN_CAN0_INT12)

/** \brief  5B4, CAN Service Request 0 */
#define SRC_CAN_CAN0_INT13 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF00385B4u)

/** Alias (User Manual Name) for SRC_CAN_CAN0_INT13.
* To use register names with standard convension, please use SRC_CAN_CAN0_INT13.
*/
#define	SRC_CAN0INT13	(SRC_CAN_CAN0_INT13)

/** \brief  5B8, CAN Service Request 0 */
#define SRC_CAN_CAN0_INT14 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF00385B8u)

/** Alias (User Manual Name) for SRC_CAN_CAN0_INT14.
* To use register names with standard convension, please use SRC_CAN_CAN0_INT14.
*/
#define	SRC_CAN0INT14	(SRC_CAN_CAN0_INT14)

/** \brief  5BC, CAN Service Request 0 */
#define SRC_CAN_CAN0_INT15 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF00385BCu)

/** Alias (User Manual Name) for SRC_CAN_CAN0_INT15.
* To use register names with standard convension, please use SRC_CAN_CAN0_INT15.
*/
#define	SRC_CAN0INT15	(SRC_CAN_CAN0_INT15)

/** \brief  588, CAN Service Request 0 */
#define SRC_CAN_CAN0_INT2 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038588u)

/** Alias (User Manual Name) for SRC_CAN_CAN0_INT2.
* To use register names with standard convension, please use SRC_CAN_CAN0_INT2.
*/
#define	SRC_CAN0INT2	(SRC_CAN_CAN0_INT2)

/** \brief  58C, CAN Service Request 0 */
#define SRC_CAN_CAN0_INT3 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF003858Cu)

/** Alias (User Manual Name) for SRC_CAN_CAN0_INT3.
* To use register names with standard convension, please use SRC_CAN_CAN0_INT3.
*/
#define	SRC_CAN0INT3	(SRC_CAN_CAN0_INT3)

/** \brief  590, CAN Service Request 0 */
#define SRC_CAN_CAN0_INT4 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038590u)

/** Alias (User Manual Name) for SRC_CAN_CAN0_INT4.
* To use register names with standard convension, please use SRC_CAN_CAN0_INT4.
*/
#define	SRC_CAN0INT4	(SRC_CAN_CAN0_INT4)

/** \brief  594, CAN Service Request 0 */
#define SRC_CAN_CAN0_INT5 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038594u)

