Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxSrc_reg.h
/** Alias (User Manual Name) for SRC_CAN_CAN0_INT5.
* To use register names with standard convension, please use SRC_CAN_CAN0_INT5.
*/
#define	SRC_CAN0INT5	(SRC_CAN_CAN0_INT5)

/** \brief  598, CAN Service Request 0 */
#define SRC_CAN_CAN0_INT6 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038598u)

/** Alias (User Manual Name) for SRC_CAN_CAN0_INT6.
* To use register names with standard convension, please use SRC_CAN_CAN0_INT6.
*/
#define	SRC_CAN0INT6	(SRC_CAN_CAN0_INT6)

/** \brief  59C, CAN Service Request 0 */
#define SRC_CAN_CAN0_INT7 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF003859Cu)

/** Alias (User Manual Name) for SRC_CAN_CAN0_INT7.
* To use register names with standard convension, please use SRC_CAN_CAN0_INT7.
*/
#define	SRC_CAN0INT7	(SRC_CAN_CAN0_INT7)

/** \brief  5A0, CAN Service Request 0 */
#define SRC_CAN_CAN0_INT8 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF00385A0u)

/** Alias (User Manual Name) for SRC_CAN_CAN0_INT8.
* To use register names with standard convension, please use SRC_CAN_CAN0_INT8.
*/
#define	SRC_CAN0INT8	(SRC_CAN_CAN0_INT8)

/** \brief  5A4, CAN Service Request 0 */
#define SRC_CAN_CAN0_INT9 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF00385A4u)

/** Alias (User Manual Name) for SRC_CAN_CAN0_INT9.
* To use register names with standard convension, please use SRC_CAN_CAN0_INT9.
*/
#define	SRC_CAN0INT9	(SRC_CAN_CAN0_INT9)

/** \brief  5C0, CAN Service Request 0 */
#define SRC_CAN_CAN1_INT0 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF00385C0u)

/** Alias (User Manual Name) for SRC_CAN_CAN1_INT0.
* To use register names with standard convension, please use SRC_CAN_CAN1_INT0.
*/
#define	SRC_CAN1INT0	(SRC_CAN_CAN1_INT0)

/** \brief  5C4, CAN Service Request 0 */
#define SRC_CAN_CAN1_INT1 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF00385C4u)

/** Alias (User Manual Name) for SRC_CAN_CAN1_INT1.
* To use register names with standard convension, please use SRC_CAN_CAN1_INT1.
*/
#define	SRC_CAN1INT1	(SRC_CAN_CAN1_INT1)

/** \brief  5E8, CAN Service Request 0 */
#define SRC_CAN_CAN1_INT10 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF00385E8u)

/** Alias (User Manual Name) for SRC_CAN_CAN1_INT10.
* To use register names with standard convension, please use SRC_CAN_CAN1_INT10.
*/
#define	SRC_CAN1INT10	(SRC_CAN_CAN1_INT10)

/** \brief  5EC, CAN Service Request 0 */
#define SRC_CAN_CAN1_INT11 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF00385ECu)

/** Alias (User Manual Name) for SRC_CAN_CAN1_INT11.
* To use register names with standard convension, please use SRC_CAN_CAN1_INT11.
*/
#define	SRC_CAN1INT11	(SRC_CAN_CAN1_INT11)

/** \brief  5F0, CAN Service Request 0 */
#define SRC_CAN_CAN1_INT12 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF00385F0u)

/** Alias (User Manual Name) for SRC_CAN_CAN1_INT12.
* To use register names with standard convension, please use SRC_CAN_CAN1_INT12.
*/
#define	SRC_CAN1INT12	(SRC_CAN_CAN1_INT12)

/** \brief  5F4, CAN Service Request 0 */
#define SRC_CAN_CAN1_INT13 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF00385F4u)

/** Alias (User Manual Name) for SRC_CAN_CAN1_INT13.
* To use register names with standard convension, please use SRC_CAN_CAN1_INT13.
*/
#define	SRC_CAN1INT13	(SRC_CAN_CAN1_INT13)

/** \brief  5F8, CAN Service Request 0 */
#define SRC_CAN_CAN1_INT14 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF00385F8u)

/** Alias (User Manual Name) for SRC_CAN_CAN1_INT14.
* To use register names with standard convension, please use SRC_CAN_CAN1_INT14.
*/
#define	SRC_CAN1INT14	(SRC_CAN_CAN1_INT14)

/** \brief  5FC, CAN Service Request 0 */
#define SRC_CAN_CAN1_INT15 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF00385FCu)

/** Alias (User Manual Name) for SRC_CAN_CAN1_INT15.
* To use register names with standard convension, please use SRC_CAN_CAN1_INT15.
*/
#define	SRC_CAN1INT15	(SRC_CAN_CAN1_INT15)

/** \brief  5C8, CAN Service Request 0 */
#define SRC_CAN_CAN1_INT2 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF00385C8u)

/** Alias (User Manual Name) for SRC_CAN_CAN1_INT2.
* To use register names with standard convension, please use SRC_CAN_CAN1_INT2.
*/
#define	SRC_CAN1INT2	(SRC_CAN_CAN1_INT2)

/** \brief  5CC, CAN Service Request 0 */
#define SRC_CAN_CAN1_INT3 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF00385CCu)

/** Alias (User Manual Name) for SRC_CAN_CAN1_INT3.
* To use register names with standard convension, please use SRC_CAN_CAN1_INT3.
*/
#define	SRC_CAN1INT3	(SRC_CAN_CAN1_INT3)

/** \brief  5D0, CAN Service Request 0 */
#define SRC_CAN_CAN1_INT4 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF00385D0u)

/** Alias (User Manual Name) for SRC_CAN_CAN1_INT4.
* To use register names with standard convension, please use SRC_CAN_CAN1_INT4.
*/
#define	SRC_CAN1INT4	(SRC_CAN_CAN1_INT4)

/** \brief  5D4, CAN Service Request 0 */
#define SRC_CAN_CAN1_INT5 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF00385D4u)

/** Alias (User Manual Name) for SRC_CAN_CAN1_INT5.
* To use register names with standard convension, please use SRC_CAN_CAN1_INT5.
*/
#define	SRC_CAN1INT5	(SRC_CAN_CAN1_INT5)

/** \brief  5D8, CAN Service Request 0 */
#define SRC_CAN_CAN1_INT6 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF00385D8u)

/** Alias (User Manual Name) for SRC_CAN_CAN1_INT6.
* To use register names with standard convension, please use SRC_CAN_CAN1_INT6.
*/
#define	SRC_CAN1INT6	(SRC_CAN_CAN1_INT6)

/** \brief  5DC, CAN Service Request 0 */
#define SRC_CAN_CAN1_INT7 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF00385DCu)

/** Alias (User Manual Name) for SRC_CAN_CAN1_INT7.
* To use register names with standard convension, please use SRC_CAN_CAN1_INT7.
*/
#define	SRC_CAN1INT7	(SRC_CAN_CAN1_INT7)

/** \brief  5E0, CAN Service Request 0 */
#define SRC_CAN_CAN1_INT8 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF00385E0u)

/** Alias (User Manual Name) for SRC_CAN_CAN1_INT8.
* To use register names with standard convension, please use SRC_CAN_CAN1_INT8.
*/
#define	SRC_CAN1INT8	(SRC_CAN_CAN1_INT8)

/** \brief  5E4, CAN Service Request 0 */
#define SRC_CAN_CAN1_INT9 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF00385E4u)

