Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxSrc_reg.h
/** Alias (User Manual Name) for SRC_CAN_CAN1_INT9.
* To use register names with standard convension, please use SRC_CAN_CAN1_INT9.
*/
#define	SRC_CAN1INT9	(SRC_CAN_CAN1_INT9)

/** \brief  600, CAN Service Request 0 */
#define SRC_CAN_CAN2_INT0 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038600u)

/** Alias (User Manual Name) for SRC_CAN_CAN2_INT0.
* To use register names with standard convension, please use SRC_CAN_CAN2_INT0.
*/
#define	SRC_CAN2INT0	(SRC_CAN_CAN2_INT0)

/** \brief  604, CAN Service Request 0 */
#define SRC_CAN_CAN2_INT1 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038604u)

/** Alias (User Manual Name) for SRC_CAN_CAN2_INT1.
* To use register names with standard convension, please use SRC_CAN_CAN2_INT1.
*/
#define	SRC_CAN2INT1	(SRC_CAN_CAN2_INT1)

/** \brief  628, CAN Service Request 0 */
#define SRC_CAN_CAN2_INT10 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038628u)

/** Alias (User Manual Name) for SRC_CAN_CAN2_INT10.
* To use register names with standard convension, please use SRC_CAN_CAN2_INT10.
*/
#define	SRC_CAN2INT10	(SRC_CAN_CAN2_INT10)

/** \brief  62C, CAN Service Request 0 */
#define SRC_CAN_CAN2_INT11 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF003862Cu)

/** Alias (User Manual Name) for SRC_CAN_CAN2_INT11.
* To use register names with standard convension, please use SRC_CAN_CAN2_INT11.
*/
#define	SRC_CAN2INT11	(SRC_CAN_CAN2_INT11)

/** \brief  630, CAN Service Request 0 */
#define SRC_CAN_CAN2_INT12 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038630u)

/** Alias (User Manual Name) for SRC_CAN_CAN2_INT12.
* To use register names with standard convension, please use SRC_CAN_CAN2_INT12.
*/
#define	SRC_CAN2INT12	(SRC_CAN_CAN2_INT12)

/** \brief  634, CAN Service Request 0 */
#define SRC_CAN_CAN2_INT13 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038634u)

/** Alias (User Manual Name) for SRC_CAN_CAN2_INT13.
* To use register names with standard convension, please use SRC_CAN_CAN2_INT13.
*/
#define	SRC_CAN2INT13	(SRC_CAN_CAN2_INT13)

/** \brief  638, CAN Service Request 0 */
#define SRC_CAN_CAN2_INT14 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038638u)

/** Alias (User Manual Name) for SRC_CAN_CAN2_INT14.
* To use register names with standard convension, please use SRC_CAN_CAN2_INT14.
*/
#define	SRC_CAN2INT14	(SRC_CAN_CAN2_INT14)

/** \brief  63C, CAN Service Request 0 */
#define SRC_CAN_CAN2_INT15 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF003863Cu)

/** Alias (User Manual Name) for SRC_CAN_CAN2_INT15.
* To use register names with standard convension, please use SRC_CAN_CAN2_INT15.
*/
#define	SRC_CAN2INT15	(SRC_CAN_CAN2_INT15)

/** \brief  608, CAN Service Request 0 */
#define SRC_CAN_CAN2_INT2 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038608u)

/** Alias (User Manual Name) for SRC_CAN_CAN2_INT2.
* To use register names with standard convension, please use SRC_CAN_CAN2_INT2.
*/
#define	SRC_CAN2INT2	(SRC_CAN_CAN2_INT2)

/** \brief  60C, CAN Service Request 0 */
#define SRC_CAN_CAN2_INT3 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF003860Cu)

/** Alias (User Manual Name) for SRC_CAN_CAN2_INT3.
* To use register names with standard convension, please use SRC_CAN_CAN2_INT3.
*/
#define	SRC_CAN2INT3	(SRC_CAN_CAN2_INT3)

/** \brief  610, CAN Service Request 0 */
#define SRC_CAN_CAN2_INT4 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038610u)

/** Alias (User Manual Name) for SRC_CAN_CAN2_INT4.
* To use register names with standard convension, please use SRC_CAN_CAN2_INT4.
*/
#define	SRC_CAN2INT4	(SRC_CAN_CAN2_INT4)

/** \brief  614, CAN Service Request 0 */
#define SRC_CAN_CAN2_INT5 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038614u)

/** Alias (User Manual Name) for SRC_CAN_CAN2_INT5.
* To use register names with standard convension, please use SRC_CAN_CAN2_INT5.
*/
#define	SRC_CAN2INT5	(SRC_CAN_CAN2_INT5)

/** \brief  618, CAN Service Request 0 */
#define SRC_CAN_CAN2_INT6 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038618u)

/** Alias (User Manual Name) for SRC_CAN_CAN2_INT6.
* To use register names with standard convension, please use SRC_CAN_CAN2_INT6.
*/
#define	SRC_CAN2INT6	(SRC_CAN_CAN2_INT6)

/** \brief  61C, CAN Service Request 0 */
#define SRC_CAN_CAN2_INT7 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF003861Cu)

/** Alias (User Manual Name) for SRC_CAN_CAN2_INT7.
* To use register names with standard convension, please use SRC_CAN_CAN2_INT7.
*/
#define	SRC_CAN2INT7	(SRC_CAN_CAN2_INT7)

/** \brief  620, CAN Service Request 0 */
#define SRC_CAN_CAN2_INT8 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038620u)

/** Alias (User Manual Name) for SRC_CAN_CAN2_INT8.
* To use register names with standard convension, please use SRC_CAN_CAN2_INT8.
*/
#define	SRC_CAN2INT8	(SRC_CAN_CAN2_INT8)

/** \brief  624, CAN Service Request 0 */
#define SRC_CAN_CAN2_INT9 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038624u)

/** Alias (User Manual Name) for SRC_CAN_CAN2_INT9.
* To use register names with standard convension, please use SRC_CAN_CAN2_INT9.
*/
#define	SRC_CAN2INT9	(SRC_CAN_CAN2_INT9)

/** \brief  2A0, CCU6 Service Request 0 */
#define SRC_CCU6_CCU60_SR0 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF00382A0u)

/** Alias (User Manual Name) for SRC_CCU6_CCU60_SR0.
* To use register names with standard convension, please use SRC_CCU6_CCU60_SR0.
*/
#define	SRC_CCU60SR0	(SRC_CCU6_CCU60_SR0)

/** \brief  2A4, CCU6 Service Request 1 */
#define SRC_CCU6_CCU60_SR1 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF00382A4u)

/** Alias (User Manual Name) for SRC_CCU6_CCU60_SR1.
* To use register names with standard convension, please use SRC_CCU6_CCU60_SR1.
*/
#define	SRC_CCU60SR1	(SRC_CCU6_CCU60_SR1)

/** \brief  2A8, CCU6 Service Request 2 */
#define SRC_CCU6_CCU60_SR2 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF00382A8u)

/** Alias (User Manual Name) for SRC_CCU6_CCU60_SR2.
* To use register names with standard convension, please use SRC_CCU6_CCU60_SR2.
*/
#define	SRC_CCU60SR2	(SRC_CCU6_CCU60_SR2)

/** \brief  2AC, CCU6 Service Request 3 */
#define SRC_CCU6_CCU60_SR3 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF00382ACu)

/** Alias (User Manual Name) for SRC_CCU6_CCU60_SR3.
* To use register names with standard convension, please use SRC_CCU6_CCU60_SR3.
*/
#define	SRC_CCU60SR3	(SRC_CCU6_CCU60_SR3)

