Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxSrc_reg.h
/** \brief  904, DAM Ready 0 Service Request x */
#define SRC_DAM_DAM0_RI0 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038904u)

/** Alias (User Manual Name) for SRC_DAM_DAM0_RI0.
* To use register names with standard convension, please use SRC_DAM_DAM0_RI0.
*/
#define	SRC_DAM0RI0	(SRC_DAM_DAM0_RI0)

/** \brief  90C, DAM Ready 1 Service Request x */
#define SRC_DAM_DAM0_RI1 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF003890Cu)

/** Alias (User Manual Name) for SRC_DAM_DAM0_RI1.
* To use register names with standard convension, please use SRC_DAM_DAM0_RI1.
*/
#define	SRC_DAM0RI1	(SRC_DAM_DAM0_RI1)

/** \brief  928, DAM DMA Ready Service Request x */
#define SRC_DAM_DAM1_DR /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038928u)

/** Alias (User Manual Name) for SRC_DAM_DAM1_DR.
* To use register names with standard convension, please use SRC_DAM_DAM1_DR.
*/
#define	SRC_DAM1DR	(SRC_DAM_DAM1_DR)

/** \brief  92C, DAM DMA Error Service Request x */
#define SRC_DAM_DAM1_ERR /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF003892Cu)

/** Alias (User Manual Name) for SRC_DAM_DAM1_ERR.
* To use register names with standard convension, please use SRC_DAM_DAM1_ERR.
*/
#define	SRC_DAM1ERR	(SRC_DAM_DAM1_ERR)

/** \brief  918, DAM Limit 0 Service Request x */
#define SRC_DAM_DAM1_LI0 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038918u)

/** Alias (User Manual Name) for SRC_DAM_DAM1_LI0.
* To use register names with standard convension, please use SRC_DAM_DAM1_LI0.
*/
#define	SRC_DAM1LI0	(SRC_DAM_DAM1_LI0)

/** \brief  920, DAM Limit 1 Service Request x */
#define SRC_DAM_DAM1_LI1 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038920u)

/** Alias (User Manual Name) for SRC_DAM_DAM1_LI1.
* To use register names with standard convension, please use SRC_DAM_DAM1_LI1.
*/
#define	SRC_DAM1LI1	(SRC_DAM_DAM1_LI1)

/** \brief  91C, DAM Ready 0 Service Request x */
#define SRC_DAM_DAM1_RI0 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF003891Cu)

/** Alias (User Manual Name) for SRC_DAM_DAM1_RI0.
* To use register names with standard convension, please use SRC_DAM_DAM1_RI0.
*/
#define	SRC_DAM1RI0	(SRC_DAM_DAM1_RI0)

/** \brief  924, DAM Ready 1 Service Request x */
#define SRC_DAM_DAM1_RI1 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038924u)

/** Alias (User Manual Name) for SRC_DAM_DAM1_RI1.
* To use register names with standard convension, please use SRC_DAM_DAM1_RI1.
*/
#define	SRC_DAM1RI1	(SRC_DAM_DAM1_RI1)

/** \brief  350, DMA Channel Service Request */
#define SRC_DMA_DMA0_CH0 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038350u)

/** Alias (User Manual Name) for SRC_DMA_DMA0_CH0.
* To use register names with standard convension, please use SRC_DMA_DMA0_CH0.
*/
#define	SRC_DMACH0	(SRC_DMA_DMA0_CH0)

/** \brief  354, DMA Channel Service Request */
#define SRC_DMA_DMA0_CH1 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038354u)

/** Alias (User Manual Name) for SRC_DMA_DMA0_CH1.
* To use register names with standard convension, please use SRC_DMA_DMA0_CH1.
*/
#define	SRC_DMACH1	(SRC_DMA_DMA0_CH1)

/** \brief  378, DMA Channel Service Request */
#define SRC_DMA_DMA0_CH10 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038378u)

/** Alias (User Manual Name) for SRC_DMA_DMA0_CH10.
* To use register names with standard convension, please use SRC_DMA_DMA0_CH10.
*/
#define	SRC_DMACH10	(SRC_DMA_DMA0_CH10)

/** \brief  4E0, DMA Channel Service Request */
#define SRC_DMA_DMA0_CH100 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF00384E0u)

/** Alias (User Manual Name) for SRC_DMA_DMA0_CH100.
* To use register names with standard convension, please use SRC_DMA_DMA0_CH100.
*/
#define	SRC_DMACH100	(SRC_DMA_DMA0_CH100)

/** \brief  4E4, DMA Channel Service Request */
#define SRC_DMA_DMA0_CH101 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF00384E4u)

/** Alias (User Manual Name) for SRC_DMA_DMA0_CH101.
* To use register names with standard convension, please use SRC_DMA_DMA0_CH101.
*/
#define	SRC_DMACH101	(SRC_DMA_DMA0_CH101)

/** \brief  4E8, DMA Channel Service Request */
#define SRC_DMA_DMA0_CH102 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF00384E8u)

/** Alias (User Manual Name) for SRC_DMA_DMA0_CH102.
* To use register names with standard convension, please use SRC_DMA_DMA0_CH102.
*/
#define	SRC_DMACH102	(SRC_DMA_DMA0_CH102)

/** \brief  4EC, DMA Channel Service Request */
#define SRC_DMA_DMA0_CH103 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF00384ECu)

/** Alias (User Manual Name) for SRC_DMA_DMA0_CH103.
* To use register names with standard convension, please use SRC_DMA_DMA0_CH103.
*/
#define	SRC_DMACH103	(SRC_DMA_DMA0_CH103)

/** \brief  4F0, DMA Channel Service Request */
#define SRC_DMA_DMA0_CH104 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF00384F0u)

/** Alias (User Manual Name) for SRC_DMA_DMA0_CH104.
* To use register names with standard convension, please use SRC_DMA_DMA0_CH104.
*/
#define	SRC_DMACH104	(SRC_DMA_DMA0_CH104)

/** \brief  4F4, DMA Channel Service Request */
#define SRC_DMA_DMA0_CH105 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF00384F4u)

/** Alias (User Manual Name) for SRC_DMA_DMA0_CH105.
* To use register names with standard convension, please use SRC_DMA_DMA0_CH105.
*/
#define	SRC_DMACH105	(SRC_DMA_DMA0_CH105)

/** \brief  4F8, DMA Channel Service Request */
#define SRC_DMA_DMA0_CH106 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF00384F8u)

/** Alias (User Manual Name) for SRC_DMA_DMA0_CH106.
* To use register names with standard convension, please use SRC_DMA_DMA0_CH106.
*/
#define	SRC_DMACH106	(SRC_DMA_DMA0_CH106)

/** \brief  4FC, DMA Channel Service Request */
#define SRC_DMA_DMA0_CH107 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF00384FCu)

/** Alias (User Manual Name) for SRC_DMA_DMA0_CH107.
* To use register names with standard convension, please use SRC_DMA_DMA0_CH107.
*/
#define	SRC_DMACH107	(SRC_DMA_DMA0_CH107)

/** \brief  500, DMA Channel Service Request */
#define SRC_DMA_DMA0_CH108 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038500u)

/** Alias (User Manual Name) for SRC_DMA_DMA0_CH108.
* To use register names with standard convension, please use SRC_DMA_DMA0_CH108.
*/
#define	SRC_DMACH108	(SRC_DMA_DMA0_CH108)

/** \brief  504, DMA Channel Service Request */
#define SRC_DMA_DMA0_CH109 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038504u)

