Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxSrc_reg.h
/** Alias (User Manual Name) for SRC_DMA_DMA0_CH109.
* To use register names with standard convension, please use SRC_DMA_DMA0_CH109.
*/
#define	SRC_DMACH109	(SRC_DMA_DMA0_CH109)

/** \brief  37C, DMA Channel Service Request */
#define SRC_DMA_DMA0_CH11 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF003837Cu)

/** Alias (User Manual Name) for SRC_DMA_DMA0_CH11.
* To use register names with standard convension, please use SRC_DMA_DMA0_CH11.
*/
#define	SRC_DMACH11	(SRC_DMA_DMA0_CH11)

/** \brief  508, DMA Channel Service Request */
#define SRC_DMA_DMA0_CH110 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038508u)

/** Alias (User Manual Name) for SRC_DMA_DMA0_CH110.
* To use register names with standard convension, please use SRC_DMA_DMA0_CH110.
*/
#define	SRC_DMACH110	(SRC_DMA_DMA0_CH110)

/** \brief  50C, DMA Channel Service Request */
#define SRC_DMA_DMA0_CH111 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF003850Cu)

/** Alias (User Manual Name) for SRC_DMA_DMA0_CH111.
* To use register names with standard convension, please use SRC_DMA_DMA0_CH111.
*/
#define	SRC_DMACH111	(SRC_DMA_DMA0_CH111)

/** \brief  510, DMA Channel Service Request */
#define SRC_DMA_DMA0_CH112 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038510u)

/** Alias (User Manual Name) for SRC_DMA_DMA0_CH112.
* To use register names with standard convension, please use SRC_DMA_DMA0_CH112.
*/
#define	SRC_DMACH112	(SRC_DMA_DMA0_CH112)

/** \brief  514, DMA Channel Service Request */
#define SRC_DMA_DMA0_CH113 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038514u)

/** Alias (User Manual Name) for SRC_DMA_DMA0_CH113.
* To use register names with standard convension, please use SRC_DMA_DMA0_CH113.
*/
#define	SRC_DMACH113	(SRC_DMA_DMA0_CH113)

/** \brief  518, DMA Channel Service Request */
#define SRC_DMA_DMA0_CH114 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038518u)

/** Alias (User Manual Name) for SRC_DMA_DMA0_CH114.
* To use register names with standard convension, please use SRC_DMA_DMA0_CH114.
*/
#define	SRC_DMACH114	(SRC_DMA_DMA0_CH114)

/** \brief  51C, DMA Channel Service Request */
#define SRC_DMA_DMA0_CH115 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF003851Cu)

/** Alias (User Manual Name) for SRC_DMA_DMA0_CH115.
* To use register names with standard convension, please use SRC_DMA_DMA0_CH115.
*/
#define	SRC_DMACH115	(SRC_DMA_DMA0_CH115)

/** \brief  520, DMA Channel Service Request */
#define SRC_DMA_DMA0_CH116 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038520u)

/** Alias (User Manual Name) for SRC_DMA_DMA0_CH116.
* To use register names with standard convension, please use SRC_DMA_DMA0_CH116.
*/
#define	SRC_DMACH116	(SRC_DMA_DMA0_CH116)

/** \brief  524, DMA Channel Service Request */
#define SRC_DMA_DMA0_CH117 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038524u)

/** Alias (User Manual Name) for SRC_DMA_DMA0_CH117.
* To use register names with standard convension, please use SRC_DMA_DMA0_CH117.
*/
#define	SRC_DMACH117	(SRC_DMA_DMA0_CH117)

/** \brief  528, DMA Channel Service Request */
#define SRC_DMA_DMA0_CH118 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038528u)

/** Alias (User Manual Name) for SRC_DMA_DMA0_CH118.
* To use register names with standard convension, please use SRC_DMA_DMA0_CH118.
*/
#define	SRC_DMACH118	(SRC_DMA_DMA0_CH118)

/** \brief  52C, DMA Channel Service Request */
#define SRC_DMA_DMA0_CH119 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF003852Cu)

/** Alias (User Manual Name) for SRC_DMA_DMA0_CH119.
* To use register names with standard convension, please use SRC_DMA_DMA0_CH119.
*/
#define	SRC_DMACH119	(SRC_DMA_DMA0_CH119)

/** \brief  380, DMA Channel Service Request */
#define SRC_DMA_DMA0_CH12 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038380u)

/** Alias (User Manual Name) for SRC_DMA_DMA0_CH12.
* To use register names with standard convension, please use SRC_DMA_DMA0_CH12.
*/
#define	SRC_DMACH12	(SRC_DMA_DMA0_CH12)

/** \brief  530, DMA Channel Service Request */
#define SRC_DMA_DMA0_CH120 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038530u)

/** Alias (User Manual Name) for SRC_DMA_DMA0_CH120.
* To use register names with standard convension, please use SRC_DMA_DMA0_CH120.
*/
#define	SRC_DMACH120	(SRC_DMA_DMA0_CH120)

/** \brief  534, DMA Channel Service Request */
#define SRC_DMA_DMA0_CH121 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038534u)

/** Alias (User Manual Name) for SRC_DMA_DMA0_CH121.
* To use register names with standard convension, please use SRC_DMA_DMA0_CH121.
*/
#define	SRC_DMACH121	(SRC_DMA_DMA0_CH121)

/** \brief  538, DMA Channel Service Request */
#define SRC_DMA_DMA0_CH122 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038538u)

/** Alias (User Manual Name) for SRC_DMA_DMA0_CH122.
* To use register names with standard convension, please use SRC_DMA_DMA0_CH122.
*/
#define	SRC_DMACH122	(SRC_DMA_DMA0_CH122)

/** \brief  53C, DMA Channel Service Request */
#define SRC_DMA_DMA0_CH123 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF003853Cu)

/** Alias (User Manual Name) for SRC_DMA_DMA0_CH123.
* To use register names with standard convension, please use SRC_DMA_DMA0_CH123.
*/
#define	SRC_DMACH123	(SRC_DMA_DMA0_CH123)

/** \brief  540, DMA Channel Service Request */
#define SRC_DMA_DMA0_CH124 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038540u)

/** Alias (User Manual Name) for SRC_DMA_DMA0_CH124.
* To use register names with standard convension, please use SRC_DMA_DMA0_CH124.
*/
#define	SRC_DMACH124	(SRC_DMA_DMA0_CH124)

/** \brief  544, DMA Channel Service Request */
#define SRC_DMA_DMA0_CH125 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038544u)

/** Alias (User Manual Name) for SRC_DMA_DMA0_CH125.
* To use register names with standard convension, please use SRC_DMA_DMA0_CH125.
*/
#define	SRC_DMACH125	(SRC_DMA_DMA0_CH125)

/** \brief  548, DMA Channel Service Request */
#define SRC_DMA_DMA0_CH126 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038548u)

/** Alias (User Manual Name) for SRC_DMA_DMA0_CH126.
* To use register names with standard convension, please use SRC_DMA_DMA0_CH126.
*/
#define	SRC_DMACH126	(SRC_DMA_DMA0_CH126)

/** \brief  54C, DMA Channel Service Request */
#define SRC_DMA_DMA0_CH127 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF003854Cu)

