Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxSrc_reg.h
/** Alias (User Manual Name) for SRC_DMA_DMA0_CH69.
* To use register names with standard convension, please use SRC_DMA_DMA0_CH69.
*/
#define	SRC_DMACH69	(SRC_DMA_DMA0_CH69)

/** \brief  36C, DMA Channel Service Request */
#define SRC_DMA_DMA0_CH7 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF003836Cu)

/** Alias (User Manual Name) for SRC_DMA_DMA0_CH7.
* To use register names with standard convension, please use SRC_DMA_DMA0_CH7.
*/
#define	SRC_DMACH7	(SRC_DMA_DMA0_CH7)

/** \brief  468, DMA Channel Service Request */
#define SRC_DMA_DMA0_CH70 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038468u)

/** Alias (User Manual Name) for SRC_DMA_DMA0_CH70.
* To use register names with standard convension, please use SRC_DMA_DMA0_CH70.
*/
#define	SRC_DMACH70	(SRC_DMA_DMA0_CH70)

/** \brief  46C, DMA Channel Service Request */
#define SRC_DMA_DMA0_CH71 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF003846Cu)

/** Alias (User Manual Name) for SRC_DMA_DMA0_CH71.
* To use register names with standard convension, please use SRC_DMA_DMA0_CH71.
*/
#define	SRC_DMACH71	(SRC_DMA_DMA0_CH71)

/** \brief  470, DMA Channel Service Request */
#define SRC_DMA_DMA0_CH72 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038470u)

/** Alias (User Manual Name) for SRC_DMA_DMA0_CH72.
* To use register names with standard convension, please use SRC_DMA_DMA0_CH72.
*/
#define	SRC_DMACH72	(SRC_DMA_DMA0_CH72)

/** \brief  474, DMA Channel Service Request */
#define SRC_DMA_DMA0_CH73 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038474u)

/** Alias (User Manual Name) for SRC_DMA_DMA0_CH73.
* To use register names with standard convension, please use SRC_DMA_DMA0_CH73.
*/
#define	SRC_DMACH73	(SRC_DMA_DMA0_CH73)

/** \brief  478, DMA Channel Service Request */
#define SRC_DMA_DMA0_CH74 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038478u)

/** Alias (User Manual Name) for SRC_DMA_DMA0_CH74.
* To use register names with standard convension, please use SRC_DMA_DMA0_CH74.
*/
#define	SRC_DMACH74	(SRC_DMA_DMA0_CH74)

/** \brief  47C, DMA Channel Service Request */
#define SRC_DMA_DMA0_CH75 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF003847Cu)

/** Alias (User Manual Name) for SRC_DMA_DMA0_CH75.
* To use register names with standard convension, please use SRC_DMA_DMA0_CH75.
*/
#define	SRC_DMACH75	(SRC_DMA_DMA0_CH75)

/** \brief  480, DMA Channel Service Request */
#define SRC_DMA_DMA0_CH76 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038480u)

/** Alias (User Manual Name) for SRC_DMA_DMA0_CH76.
* To use register names with standard convension, please use SRC_DMA_DMA0_CH76.
*/
#define	SRC_DMACH76	(SRC_DMA_DMA0_CH76)

/** \brief  484, DMA Channel Service Request */
#define SRC_DMA_DMA0_CH77 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038484u)

/** Alias (User Manual Name) for SRC_DMA_DMA0_CH77.
* To use register names with standard convension, please use SRC_DMA_DMA0_CH77.
*/
#define	SRC_DMACH77	(SRC_DMA_DMA0_CH77)

/** \brief  488, DMA Channel Service Request */
#define SRC_DMA_DMA0_CH78 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038488u)

/** Alias (User Manual Name) for SRC_DMA_DMA0_CH78.
* To use register names with standard convension, please use SRC_DMA_DMA0_CH78.
*/
#define	SRC_DMACH78	(SRC_DMA_DMA0_CH78)

/** \brief  48C, DMA Channel Service Request */
#define SRC_DMA_DMA0_CH79 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF003848Cu)

/** Alias (User Manual Name) for SRC_DMA_DMA0_CH79.
* To use register names with standard convension, please use SRC_DMA_DMA0_CH79.
*/
#define	SRC_DMACH79	(SRC_DMA_DMA0_CH79)

/** \brief  370, DMA Channel Service Request */
#define SRC_DMA_DMA0_CH8 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038370u)

/** Alias (User Manual Name) for SRC_DMA_DMA0_CH8.
* To use register names with standard convension, please use SRC_DMA_DMA0_CH8.
*/
#define	SRC_DMACH8	(SRC_DMA_DMA0_CH8)

/** \brief  490, DMA Channel Service Request */
#define SRC_DMA_DMA0_CH80 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038490u)

/** Alias (User Manual Name) for SRC_DMA_DMA0_CH80.
* To use register names with standard convension, please use SRC_DMA_DMA0_CH80.
*/
#define	SRC_DMACH80	(SRC_DMA_DMA0_CH80)

/** \brief  494, DMA Channel Service Request */
#define SRC_DMA_DMA0_CH81 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038494u)

/** Alias (User Manual Name) for SRC_DMA_DMA0_CH81.
* To use register names with standard convension, please use SRC_DMA_DMA0_CH81.
*/
#define	SRC_DMACH81	(SRC_DMA_DMA0_CH81)

/** \brief  498, DMA Channel Service Request */
#define SRC_DMA_DMA0_CH82 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038498u)

/** Alias (User Manual Name) for SRC_DMA_DMA0_CH82.
* To use register names with standard convension, please use SRC_DMA_DMA0_CH82.
*/
#define	SRC_DMACH82	(SRC_DMA_DMA0_CH82)

/** \brief  49C, DMA Channel Service Request */
#define SRC_DMA_DMA0_CH83 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF003849Cu)

/** Alias (User Manual Name) for SRC_DMA_DMA0_CH83.
* To use register names with standard convension, please use SRC_DMA_DMA0_CH83.
*/
#define	SRC_DMACH83	(SRC_DMA_DMA0_CH83)

/** \brief  4A0, DMA Channel Service Request */
#define SRC_DMA_DMA0_CH84 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF00384A0u)

/** Alias (User Manual Name) for SRC_DMA_DMA0_CH84.
* To use register names with standard convension, please use SRC_DMA_DMA0_CH84.
*/
#define	SRC_DMACH84	(SRC_DMA_DMA0_CH84)

/** \brief  4A4, DMA Channel Service Request */
#define SRC_DMA_DMA0_CH85 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF00384A4u)

/** Alias (User Manual Name) for SRC_DMA_DMA0_CH85.
* To use register names with standard convension, please use SRC_DMA_DMA0_CH85.
*/
#define	SRC_DMACH85	(SRC_DMA_DMA0_CH85)

/** \brief  4A8, DMA Channel Service Request */
#define SRC_DMA_DMA0_CH86 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF00384A8u)

/** Alias (User Manual Name) for SRC_DMA_DMA0_CH86.
* To use register names with standard convension, please use SRC_DMA_DMA0_CH86.
*/
#define	SRC_DMACH86	(SRC_DMA_DMA0_CH86)

/** \brief  4AC, DMA Channel Service Request */
#define SRC_DMA_DMA0_CH87 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF00384ACu)

