Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxSrc_reg.h
/** Alias (User Manual Name) for SRC_DMA_DMA0_CH87.
* To use register names with standard convension, please use SRC_DMA_DMA0_CH87.
*/
#define	SRC_DMACH87	(SRC_DMA_DMA0_CH87)

/** \brief  4B0, DMA Channel Service Request */
#define SRC_DMA_DMA0_CH88 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF00384B0u)

/** Alias (User Manual Name) for SRC_DMA_DMA0_CH88.
* To use register names with standard convension, please use SRC_DMA_DMA0_CH88.
*/
#define	SRC_DMACH88	(SRC_DMA_DMA0_CH88)

/** \brief  4B4, DMA Channel Service Request */
#define SRC_DMA_DMA0_CH89 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF00384B4u)

/** Alias (User Manual Name) for SRC_DMA_DMA0_CH89.
* To use register names with standard convension, please use SRC_DMA_DMA0_CH89.
*/
#define	SRC_DMACH89	(SRC_DMA_DMA0_CH89)

/** \brief  374, DMA Channel Service Request */
#define SRC_DMA_DMA0_CH9 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038374u)

/** Alias (User Manual Name) for SRC_DMA_DMA0_CH9.
* To use register names with standard convension, please use SRC_DMA_DMA0_CH9.
*/
#define	SRC_DMACH9	(SRC_DMA_DMA0_CH9)

/** \brief  4B8, DMA Channel Service Request */
#define SRC_DMA_DMA0_CH90 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF00384B8u)

/** Alias (User Manual Name) for SRC_DMA_DMA0_CH90.
* To use register names with standard convension, please use SRC_DMA_DMA0_CH90.
*/
#define	SRC_DMACH90	(SRC_DMA_DMA0_CH90)

/** \brief  4BC, DMA Channel Service Request */
#define SRC_DMA_DMA0_CH91 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF00384BCu)

/** Alias (User Manual Name) for SRC_DMA_DMA0_CH91.
* To use register names with standard convension, please use SRC_DMA_DMA0_CH91.
*/
#define	SRC_DMACH91	(SRC_DMA_DMA0_CH91)

/** \brief  4C0, DMA Channel Service Request */
#define SRC_DMA_DMA0_CH92 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF00384C0u)

/** Alias (User Manual Name) for SRC_DMA_DMA0_CH92.
* To use register names with standard convension, please use SRC_DMA_DMA0_CH92.
*/
#define	SRC_DMACH92	(SRC_DMA_DMA0_CH92)

/** \brief  4C4, DMA Channel Service Request */
#define SRC_DMA_DMA0_CH93 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF00384C4u)

/** Alias (User Manual Name) for SRC_DMA_DMA0_CH93.
* To use register names with standard convension, please use SRC_DMA_DMA0_CH93.
*/
#define	SRC_DMACH93	(SRC_DMA_DMA0_CH93)

/** \brief  4C8, DMA Channel Service Request */
#define SRC_DMA_DMA0_CH94 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF00384C8u)

/** Alias (User Manual Name) for SRC_DMA_DMA0_CH94.
* To use register names with standard convension, please use SRC_DMA_DMA0_CH94.
*/
#define	SRC_DMACH94	(SRC_DMA_DMA0_CH94)

/** \brief  4CC, DMA Channel Service Request */
#define SRC_DMA_DMA0_CH95 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF00384CCu)

/** Alias (User Manual Name) for SRC_DMA_DMA0_CH95.
* To use register names with standard convension, please use SRC_DMA_DMA0_CH95.
*/
#define	SRC_DMACH95	(SRC_DMA_DMA0_CH95)

/** \brief  4D0, DMA Channel Service Request */
#define SRC_DMA_DMA0_CH96 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF00384D0u)

/** Alias (User Manual Name) for SRC_DMA_DMA0_CH96.
* To use register names with standard convension, please use SRC_DMA_DMA0_CH96.
*/
#define	SRC_DMACH96	(SRC_DMA_DMA0_CH96)

/** \brief  4D4, DMA Channel Service Request */
#define SRC_DMA_DMA0_CH97 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF00384D4u)

/** Alias (User Manual Name) for SRC_DMA_DMA0_CH97.
* To use register names with standard convension, please use SRC_DMA_DMA0_CH97.
*/
#define	SRC_DMACH97	(SRC_DMA_DMA0_CH97)

/** \brief  4D8, DMA Channel Service Request */
#define SRC_DMA_DMA0_CH98 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF00384D8u)

/** Alias (User Manual Name) for SRC_DMA_DMA0_CH98.
* To use register names with standard convension, please use SRC_DMA_DMA0_CH98.
*/
#define	SRC_DMACH98	(SRC_DMA_DMA0_CH98)

/** \brief  4DC, DMA Channel Service Request */
#define SRC_DMA_DMA0_CH99 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF00384DCu)

/** Alias (User Manual Name) for SRC_DMA_DMA0_CH99.
* To use register names with standard convension, please use SRC_DMA_DMA0_CH99.
*/
#define	SRC_DMACH99	(SRC_DMA_DMA0_CH99)

/** \brief  340, DMA Error Service Request */
#define SRC_DMA_DMA0_ERR /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038340u)

/** Alias (User Manual Name) for SRC_DMA_DMA0_ERR.
* To use register names with standard convension, please use SRC_DMA_DMA0_ERR.
*/
#define	SRC_DMAERR	(SRC_DMA_DMA0_ERR)

/** \brief  774, DSADC SRA Service Request */
#define SRC_DSADC_DSADC0_SRA /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038774u)

/** Alias (User Manual Name) for SRC_DSADC_DSADC0_SRA.
* To use register names with standard convension, please use SRC_DSADC_DSADC0_SRA.
*/
#define	SRC_DSADCSRA0	(SRC_DSADC_DSADC0_SRA)

/** \brief  770, DSADC SRM Service Request */
#define SRC_DSADC_DSADC0_SRM /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038770u)

/** Alias (User Manual Name) for SRC_DSADC_DSADC0_SRM.
* To use register names with standard convension, please use SRC_DSADC_DSADC0_SRM.
*/
#define	SRC_DSADCSRM0	(SRC_DSADC_DSADC0_SRM)

/** \brief  7C4, DSADC SRA Service Request */
#define SRC_DSADC_DSADC10_SRA /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF00387C4u)

/** Alias (User Manual Name) for SRC_DSADC_DSADC10_SRA.
* To use register names with standard convension, please use SRC_DSADC_DSADC10_SRA.
*/
#define	SRC_DSADCSRA10	(SRC_DSADC_DSADC10_SRA)

/** \brief  7C0, DSADC SRM Service Request */
#define SRC_DSADC_DSADC10_SRM /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF00387C0u)

/** Alias (User Manual Name) for SRC_DSADC_DSADC10_SRM.
* To use register names with standard convension, please use SRC_DSADC_DSADC10_SRM.
*/
#define	SRC_DSADCSRM10	(SRC_DSADC_DSADC10_SRM)

/** \brief  7CC, DSADC SRA Service Request */
#define SRC_DSADC_DSADC11_SRA /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF00387CCu)

/** Alias (User Manual Name) for SRC_DSADC_DSADC11_SRA.
* To use register names with standard convension, please use SRC_DSADC_DSADC11_SRA.
*/
#define	SRC_DSADCSRA11	(SRC_DSADC_DSADC11_SRA)

/** \brief  7C8, DSADC SRM Service Request */
#define SRC_DSADC_DSADC11_SRM /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF00387C8u)

/** Alias (User Manual Name) for SRC_DSADC_DSADC11_SRM.
* To use register names with standard convension, please use SRC_DSADC_DSADC11_SRM.
*/
#define	SRC_DSADCSRM11	(SRC_DSADC_DSADC11_SRM)

/** \brief  7D4, DSADC SRA Service Request */
#define SRC_DSADC_DSADC12_SRA /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF00387D4u)

