Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxSrc_reg.h
/** Alias (User Manual Name) for SRC_DSADC_DSADC12_SRA.
* To use register names with standard convension, please use SRC_DSADC_DSADC12_SRA.
*/
#define	SRC_DSADCSRA12	(SRC_DSADC_DSADC12_SRA)

/** \brief  7D0, DSADC SRM Service Request */
#define SRC_DSADC_DSADC12_SRM /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF00387D0u)

/** Alias (User Manual Name) for SRC_DSADC_DSADC12_SRM.
* To use register names with standard convension, please use SRC_DSADC_DSADC12_SRM.
*/
#define	SRC_DSADCSRM12	(SRC_DSADC_DSADC12_SRM)

/** \brief  7DC, DSADC SRA Service Request */
#define SRC_DSADC_DSADC13_SRA /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF00387DCu)

/** Alias (User Manual Name) for SRC_DSADC_DSADC13_SRA.
* To use register names with standard convension, please use SRC_DSADC_DSADC13_SRA.
*/
#define	SRC_DSADCSRA13	(SRC_DSADC_DSADC13_SRA)

/** \brief  7D8, DSADC SRM Service Request */
#define SRC_DSADC_DSADC13_SRM /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF00387D8u)

/** Alias (User Manual Name) for SRC_DSADC_DSADC13_SRM.
* To use register names with standard convension, please use SRC_DSADC_DSADC13_SRM.
*/
#define	SRC_DSADCSRM13	(SRC_DSADC_DSADC13_SRM)

/** \brief  77C, DSADC SRA Service Request */
#define SRC_DSADC_DSADC1_SRA /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF003877Cu)

/** Alias (User Manual Name) for SRC_DSADC_DSADC1_SRA.
* To use register names with standard convension, please use SRC_DSADC_DSADC1_SRA.
*/
#define	SRC_DSADCSRA1	(SRC_DSADC_DSADC1_SRA)

/** \brief  778, DSADC SRM Service Request */
#define SRC_DSADC_DSADC1_SRM /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038778u)

/** Alias (User Manual Name) for SRC_DSADC_DSADC1_SRM.
* To use register names with standard convension, please use SRC_DSADC_DSADC1_SRM.
*/
#define	SRC_DSADCSRM1	(SRC_DSADC_DSADC1_SRM)

/** \brief  784, DSADC SRA Service Request */
#define SRC_DSADC_DSADC2_SRA /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038784u)

/** Alias (User Manual Name) for SRC_DSADC_DSADC2_SRA.
* To use register names with standard convension, please use SRC_DSADC_DSADC2_SRA.
*/
#define	SRC_DSADCSRA2	(SRC_DSADC_DSADC2_SRA)

/** \brief  780, DSADC SRM Service Request */
#define SRC_DSADC_DSADC2_SRM /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038780u)

/** Alias (User Manual Name) for SRC_DSADC_DSADC2_SRM.
* To use register names with standard convension, please use SRC_DSADC_DSADC2_SRM.
*/
#define	SRC_DSADCSRM2	(SRC_DSADC_DSADC2_SRM)

/** \brief  78C, DSADC SRA Service Request */
#define SRC_DSADC_DSADC3_SRA /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF003878Cu)

/** Alias (User Manual Name) for SRC_DSADC_DSADC3_SRA.
* To use register names with standard convension, please use SRC_DSADC_DSADC3_SRA.
*/
#define	SRC_DSADCSRA3	(SRC_DSADC_DSADC3_SRA)

/** \brief  788, DSADC SRM Service Request */
#define SRC_DSADC_DSADC3_SRM /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038788u)

/** Alias (User Manual Name) for SRC_DSADC_DSADC3_SRM.
* To use register names with standard convension, please use SRC_DSADC_DSADC3_SRM.
*/
#define	SRC_DSADCSRM3	(SRC_DSADC_DSADC3_SRM)

/** \brief  794, DSADC SRA Service Request */
#define SRC_DSADC_DSADC4_SRA /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038794u)

/** Alias (User Manual Name) for SRC_DSADC_DSADC4_SRA.
* To use register names with standard convension, please use SRC_DSADC_DSADC4_SRA.
*/
#define	SRC_DSADCSRA4	(SRC_DSADC_DSADC4_SRA)

/** \brief  790, DSADC SRM Service Request */
#define SRC_DSADC_DSADC4_SRM /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038790u)

/** Alias (User Manual Name) for SRC_DSADC_DSADC4_SRM.
* To use register names with standard convension, please use SRC_DSADC_DSADC4_SRM.
*/
#define	SRC_DSADCSRM4	(SRC_DSADC_DSADC4_SRM)

/** \brief  79C, DSADC SRA Service Request */
#define SRC_DSADC_DSADC5_SRA /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF003879Cu)

/** Alias (User Manual Name) for SRC_DSADC_DSADC5_SRA.
* To use register names with standard convension, please use SRC_DSADC_DSADC5_SRA.
*/
#define	SRC_DSADCSRA5	(SRC_DSADC_DSADC5_SRA)

/** \brief  798, DSADC SRM Service Request */
#define SRC_DSADC_DSADC5_SRM /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038798u)

/** Alias (User Manual Name) for SRC_DSADC_DSADC5_SRM.
* To use register names with standard convension, please use SRC_DSADC_DSADC5_SRM.
*/
#define	SRC_DSADCSRM5	(SRC_DSADC_DSADC5_SRM)

/** \brief  7A4, DSADC SRA Service Request */
#define SRC_DSADC_DSADC6_SRA /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF00387A4u)

/** Alias (User Manual Name) for SRC_DSADC_DSADC6_SRA.
* To use register names with standard convension, please use SRC_DSADC_DSADC6_SRA.
*/
#define	SRC_DSADCSRA6	(SRC_DSADC_DSADC6_SRA)

/** \brief  7A0, DSADC SRM Service Request */
#define SRC_DSADC_DSADC6_SRM /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF00387A0u)

/** Alias (User Manual Name) for SRC_DSADC_DSADC6_SRM.
* To use register names with standard convension, please use SRC_DSADC_DSADC6_SRM.
*/
#define	SRC_DSADCSRM6	(SRC_DSADC_DSADC6_SRM)

/** \brief  7AC, DSADC SRA Service Request */
#define SRC_DSADC_DSADC7_SRA /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF00387ACu)

/** Alias (User Manual Name) for SRC_DSADC_DSADC7_SRA.
* To use register names with standard convension, please use SRC_DSADC_DSADC7_SRA.
*/
#define	SRC_DSADCSRA7	(SRC_DSADC_DSADC7_SRA)

/** \brief  7A8, DSADC SRM Service Request */
#define SRC_DSADC_DSADC7_SRM /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF00387A8u)

/** Alias (User Manual Name) for SRC_DSADC_DSADC7_SRM.
* To use register names with standard convension, please use SRC_DSADC_DSADC7_SRM.
*/
#define	SRC_DSADCSRM7	(SRC_DSADC_DSADC7_SRM)

/** \brief  7B4, DSADC SRA Service Request */
#define SRC_DSADC_DSADC8_SRA /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF00387B4u)

/** Alias (User Manual Name) for SRC_DSADC_DSADC8_SRA.
* To use register names with standard convension, please use SRC_DSADC_DSADC8_SRA.
*/
#define	SRC_DSADCSRA8	(SRC_DSADC_DSADC8_SRA)

/** \brief  7B0, DSADC SRM Service Request */
#define SRC_DSADC_DSADC8_SRM /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF00387B0u)

/** Alias (User Manual Name) for SRC_DSADC_DSADC8_SRM.
* To use register names with standard convension, please use SRC_DSADC_DSADC8_SRM.
*/
#define	SRC_DSADCSRM8	(SRC_DSADC_DSADC8_SRM)

