Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxSrc_reg.h
/** \brief  7BC, DSADC SRA Service Request */
#define SRC_DSADC_DSADC9_SRA /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF00387BCu)

/** Alias (User Manual Name) for SRC_DSADC_DSADC9_SRA.
* To use register names with standard convension, please use SRC_DSADC_DSADC9_SRA.
*/
#define	SRC_DSADCSRA9	(SRC_DSADC_DSADC9_SRA)

/** \brief  7B8, DSADC SRM Service Request */
#define SRC_DSADC_DSADC9_SRM /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF00387B8u)

/** Alias (User Manual Name) for SRC_DSADC_DSADC9_SRM.
* To use register names with standard convension, please use SRC_DSADC_DSADC9_SRM.
*/
#define	SRC_DSADCSRM9	(SRC_DSADC_DSADC9_SRM)

/** \brief  824, E-RAY  Input Buffer Busy Service Request */
#define SRC_ERAY_ERAY0_IBUSY /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038824u)

/** Alias (User Manual Name) for SRC_ERAY_ERAY0_IBUSY.
* To use register names with standard convension, please use SRC_ERAY_ERAY0_IBUSY.
*/
#define	SRC_ERAY0IBUSY	(SRC_ERAY_ERAY0_IBUSY)

/** \brief  800, E-RAY  Service Request */
#define SRC_ERAY_ERAY0_INT0 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038800u)

/** Alias (User Manual Name) for SRC_ERAY_ERAY0_INT0.
* To use register names with standard convension, please use SRC_ERAY_ERAY0_INT0.
*/
#define	SRC_ERAY0INT0	(SRC_ERAY_ERAY0_INT0)

/** \brief  804, E-RAY  Service Request */
#define SRC_ERAY_ERAY0_INT1 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038804u)

/** Alias (User Manual Name) for SRC_ERAY_ERAY0_INT1.
* To use register names with standard convension, please use SRC_ERAY_ERAY0_INT1.
*/
#define	SRC_ERAY0INT1	(SRC_ERAY_ERAY0_INT1)

/** \brief  818, E-RAY  Message Buffer Status Changed Service Request */
#define SRC_ERAY_ERAY0_MBSC0 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038818u)

/** Alias (User Manual Name) for SRC_ERAY_ERAY0_MBSC0.
* To use register names with standard convension, please use SRC_ERAY_ERAY0_MBSC0.
*/
#define	SRC_ERAY0MBSC0	(SRC_ERAY_ERAY0_MBSC0)

/** \brief  81C, E-RAY  Message Buffer Status Changed Service Request */
#define SRC_ERAY_ERAY0_MBSC1 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF003881Cu)

/** Alias (User Manual Name) for SRC_ERAY_ERAY0_MBSC1.
* To use register names with standard convension, please use SRC_ERAY_ERAY0_MBSC1.
*/
#define	SRC_ERAY0MBSC1	(SRC_ERAY_ERAY0_MBSC1)

/** \brief  810, E-RAY  New Data Service Request */
#define SRC_ERAY_ERAY0_NDAT0 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038810u)

/** Alias (User Manual Name) for SRC_ERAY_ERAY0_NDAT0.
* To use register names with standard convension, please use SRC_ERAY_ERAY0_NDAT0.
*/
#define	SRC_ERAY0NDAT0	(SRC_ERAY_ERAY0_NDAT0)

/** \brief  814, E-RAY  New Data Service Request */
#define SRC_ERAY_ERAY0_NDAT1 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038814u)

/** Alias (User Manual Name) for SRC_ERAY_ERAY0_NDAT1.
* To use register names with standard convension, please use SRC_ERAY_ERAY0_NDAT1.
*/
#define	SRC_ERAY0NDAT1	(SRC_ERAY_ERAY0_NDAT1)

/** \brief  820, E-RAY  Output Buffer Busy Service Request */
#define SRC_ERAY_ERAY0_OBUSY /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038820u)

/** Alias (User Manual Name) for SRC_ERAY_ERAY0_OBUSY.
* To use register names with standard convension, please use SRC_ERAY_ERAY0_OBUSY.
*/
#define	SRC_ERAY0OBUSY	(SRC_ERAY_ERAY0_OBUSY)

/** \brief  808, E-RAY  Timer Interrupt Service Request */
#define SRC_ERAY_ERAY0_TINT0 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038808u)

/** Alias (User Manual Name) for SRC_ERAY_ERAY0_TINT0.
* To use register names with standard convension, please use SRC_ERAY_ERAY0_TINT0.
*/
#define	SRC_ERAY0TINT0	(SRC_ERAY_ERAY0_TINT0)

/** \brief  80C, E-RAY  Timer Interrupt Service Request */
#define SRC_ERAY_ERAY0_TINT1 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF003880Cu)

/** Alias (User Manual Name) for SRC_ERAY_ERAY0_TINT1.
* To use register names with standard convension, please use SRC_ERAY_ERAY0_TINT1.
*/
#define	SRC_ERAY0TINT1	(SRC_ERAY_ERAY0_TINT1)

/** \brief  854, E-RAY  Input Buffer Busy Service Request */
#define SRC_ERAY_ERAY1_IBUSY /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038854u)

/** Alias (User Manual Name) for SRC_ERAY_ERAY1_IBUSY.
* To use register names with standard convension, please use SRC_ERAY_ERAY1_IBUSY.
*/
#define	SRC_ERAY1IBUSY	(SRC_ERAY_ERAY1_IBUSY)

/** \brief  830, E-RAY  Service Request */
#define SRC_ERAY_ERAY1_INT0 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038830u)

/** Alias (User Manual Name) for SRC_ERAY_ERAY1_INT0.
* To use register names with standard convension, please use SRC_ERAY_ERAY1_INT0.
*/
#define	SRC_ERAY1INT0	(SRC_ERAY_ERAY1_INT0)

/** \brief  834, E-RAY  Service Request */
#define SRC_ERAY_ERAY1_INT1 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038834u)

/** Alias (User Manual Name) for SRC_ERAY_ERAY1_INT1.
* To use register names with standard convension, please use SRC_ERAY_ERAY1_INT1.
*/
#define	SRC_ERAY1INT1	(SRC_ERAY_ERAY1_INT1)

/** \brief  848, E-RAY  Message Buffer Status Changed Service Request */
#define SRC_ERAY_ERAY1_MBSC0 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038848u)

/** Alias (User Manual Name) for SRC_ERAY_ERAY1_MBSC0.
* To use register names with standard convension, please use SRC_ERAY_ERAY1_MBSC0.
*/
#define	SRC_ERAY1MBSC0	(SRC_ERAY_ERAY1_MBSC0)

/** \brief  84C, E-RAY  Message Buffer Status Changed Service Request */
#define SRC_ERAY_ERAY1_MBSC1 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF003884Cu)

/** Alias (User Manual Name) for SRC_ERAY_ERAY1_MBSC1.
* To use register names with standard convension, please use SRC_ERAY_ERAY1_MBSC1.
*/
#define	SRC_ERAY1MBSC1	(SRC_ERAY_ERAY1_MBSC1)

/** \brief  840, E-RAY  New Data Service Request */
#define SRC_ERAY_ERAY1_NDAT0 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038840u)

/** Alias (User Manual Name) for SRC_ERAY_ERAY1_NDAT0.
* To use register names with standard convension, please use SRC_ERAY_ERAY1_NDAT0.
*/
#define	SRC_ERAY1NDAT0	(SRC_ERAY_ERAY1_NDAT0)

/** \brief  844, E-RAY  New Data Service Request */
#define SRC_ERAY_ERAY1_NDAT1 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038844u)

/** Alias (User Manual Name) for SRC_ERAY_ERAY1_NDAT1.
* To use register names with standard convension, please use SRC_ERAY_ERAY1_NDAT1.
*/
#define	SRC_ERAY1NDAT1	(SRC_ERAY_ERAY1_NDAT1)

/** \brief  850, E-RAY  Output Buffer Busy Service Request */
#define SRC_ERAY_ERAY1_OBUSY /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038850u)

/** Alias (User Manual Name) for SRC_ERAY_ERAY1_OBUSY.
* To use register names with standard convension, please use SRC_ERAY_ERAY1_OBUSY.
*/
#define	SRC_ERAY1OBUSY	(SRC_ERAY_ERAY1_OBUSY)

/** \brief  838, E-RAY  Timer Interrupt Service Request */
#define SRC_ERAY_ERAY1_TINT0 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038838u)

/** Alias (User Manual Name) for SRC_ERAY_ERAY1_TINT0.
* To use register names with standard convension, please use SRC_ERAY_ERAY1_TINT0.
*/
#define	SRC_ERAY1TINT0	(SRC_ERAY_ERAY1_TINT0)

/** \brief  83C, E-RAY  Timer Interrupt Service Request */
#define SRC_ERAY_ERAY1_TINT1 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF003883Cu)

/** Alias (User Manual Name) for SRC_ERAY_ERAY1_TINT1.
* To use register names with standard convension, please use SRC_ERAY_ERAY1_TINT1.
*/
#define	SRC_ERAY1TINT1	(SRC_ERAY_ERAY1_TINT1)

