Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxSrc_reg.h
/** Alias (User Manual Name) for SRC_GPSR_GPSR2_SR4.
* To use register names with standard convension, please use SRC_GPSR_GPSR2_SR4.
*/
#define	SRC_GPSR24	(SRC_GPSR_GPSR2_SR4)

/** \brief  9E4, GPSR Group 5 */
#define SRC_GPSR_GPSR2_SR5 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF00389E4u)

/** Alias (User Manual Name) for SRC_GPSR_GPSR2_SR5.
* To use register names with standard convension, please use SRC_GPSR_GPSR2_SR5.
*/
#define	SRC_GPSR25	(SRC_GPSR_GPSR2_SR5)

/** \brief  9E8, GPSR Group 6 */
#define SRC_GPSR_GPSR2_SR6 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF00389E8u)

/** Alias (User Manual Name) for SRC_GPSR_GPSR2_SR6.
* To use register names with standard convension, please use SRC_GPSR_GPSR2_SR6.
*/
#define	SRC_GPSR26	(SRC_GPSR_GPSR2_SR6)

/** \brief  9EC, GPSR Group 7 */
#define SRC_GPSR_GPSR2_SR7 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF00389ECu)

/** Alias (User Manual Name) for SRC_GPSR_GPSR2_SR7.
* To use register names with standard convension, please use SRC_GPSR_GPSR2_SR7.
*/
#define	SRC_GPSR27	(SRC_GPSR_GPSR2_SR7)

/** \brief  9F0, GPSR Group 0 */
#define SRC_GPSR_GPSR3_SR0 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF00389F0u)

/** Alias (User Manual Name) for SRC_GPSR_GPSR3_SR0.
* To use register names with standard convension, please use SRC_GPSR_GPSR3_SR0.
*/
#define	SRC_GPSR30	(SRC_GPSR_GPSR3_SR0)

/** \brief  9F4, GPSR Group 1 */
#define SRC_GPSR_GPSR3_SR1 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF00389F4u)

/** Alias (User Manual Name) for SRC_GPSR_GPSR3_SR1.
* To use register names with standard convension, please use SRC_GPSR_GPSR3_SR1.
*/
#define	SRC_GPSR31	(SRC_GPSR_GPSR3_SR1)

/** \brief  9F8, GPSR Group 2 */
#define SRC_GPSR_GPSR3_SR2 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF00389F8u)

/** Alias (User Manual Name) for SRC_GPSR_GPSR3_SR2.
* To use register names with standard convension, please use SRC_GPSR_GPSR3_SR2.
*/
#define	SRC_GPSR32	(SRC_GPSR_GPSR3_SR2)

/** \brief  9FC, GPSR Group 3 */
#define SRC_GPSR_GPSR3_SR3 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF00389FCu)

/** Alias (User Manual Name) for SRC_GPSR_GPSR3_SR3.
* To use register names with standard convension, please use SRC_GPSR_GPSR3_SR3.
*/
#define	SRC_GPSR33	(SRC_GPSR_GPSR3_SR3)

/** \brief  A00, GPSR Group 4 */
#define SRC_GPSR_GPSR3_SR4 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038A00u)

/** Alias (User Manual Name) for SRC_GPSR_GPSR3_SR4.
* To use register names with standard convension, please use SRC_GPSR_GPSR3_SR4.
*/
#define	SRC_GPSR34	(SRC_GPSR_GPSR3_SR4)

/** \brief  A04, GPSR Group 5 */
#define SRC_GPSR_GPSR3_SR5 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038A04u)

/** Alias (User Manual Name) for SRC_GPSR_GPSR3_SR5.
* To use register names with standard convension, please use SRC_GPSR_GPSR3_SR5.
*/
#define	SRC_GPSR35	(SRC_GPSR_GPSR3_SR5)

/** \brief  A08, GPSR Group 6 */
#define SRC_GPSR_GPSR3_SR6 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038A08u)

/** Alias (User Manual Name) for SRC_GPSR_GPSR3_SR6.
* To use register names with standard convension, please use SRC_GPSR_GPSR3_SR6.
*/
#define	SRC_GPSR36	(SRC_GPSR_GPSR3_SR6)

/** \brief  A0C, GPSR Group 7 */
#define SRC_GPSR_GPSR3_SR7 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038A0Cu)

/** Alias (User Manual Name) for SRC_GPSR_GPSR3_SR7.
* To use register names with standard convension, please use SRC_GPSR_GPSR3_SR7.
*/
#define	SRC_GPSR37	(SRC_GPSR_GPSR3_SR7)

/** \brief  A10, GPSR Group 0 */
#define SRC_GPSR_GPSR4_SR0 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038A10u)

/** Alias (User Manual Name) for SRC_GPSR_GPSR4_SR0.
* To use register names with standard convension, please use SRC_GPSR_GPSR4_SR0.
*/
#define	SRC_GPSR40	(SRC_GPSR_GPSR4_SR0)

/** \brief  A14, GPSR Group 1 */
#define SRC_GPSR_GPSR4_SR1 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038A14u)

/** Alias (User Manual Name) for SRC_GPSR_GPSR4_SR1.
* To use register names with standard convension, please use SRC_GPSR_GPSR4_SR1.
*/
#define	SRC_GPSR41	(SRC_GPSR_GPSR4_SR1)

/** \brief  A18, GPSR Group 2 */
#define SRC_GPSR_GPSR4_SR2 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038A18u)

/** Alias (User Manual Name) for SRC_GPSR_GPSR4_SR2.
* To use register names with standard convension, please use SRC_GPSR_GPSR4_SR2.
*/
#define	SRC_GPSR42	(SRC_GPSR_GPSR4_SR2)

/** \brief  A1C, GPSR Group 3 */
#define SRC_GPSR_GPSR4_SR3 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038A1Cu)

/** Alias (User Manual Name) for SRC_GPSR_GPSR4_SR3.
* To use register names with standard convension, please use SRC_GPSR_GPSR4_SR3.
*/
#define	SRC_GPSR43	(SRC_GPSR_GPSR4_SR3)

/** \brief  A20, GPSR Group 4 */
#define SRC_GPSR_GPSR4_SR4 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038A20u)

/** Alias (User Manual Name) for SRC_GPSR_GPSR4_SR4.
* To use register names with standard convension, please use SRC_GPSR_GPSR4_SR4.
*/
#define	SRC_GPSR44	(SRC_GPSR_GPSR4_SR4)

/** \brief  A24, GPSR Group 5 */
#define SRC_GPSR_GPSR4_SR5 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038A24u)

/** Alias (User Manual Name) for SRC_GPSR_GPSR4_SR5.
* To use register names with standard convension, please use SRC_GPSR_GPSR4_SR5.
*/
#define	SRC_GPSR45	(SRC_GPSR_GPSR4_SR5)

/** \brief  A28, GPSR Group 6 */
#define SRC_GPSR_GPSR4_SR6 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038A28u)

/** Alias (User Manual Name) for SRC_GPSR_GPSR4_SR6.
* To use register names with standard convension, please use SRC_GPSR_GPSR4_SR6.
*/
#define	SRC_GPSR46	(SRC_GPSR_GPSR4_SR6)

/** \brief  A2C, GPSR Group 7 */
#define SRC_GPSR_GPSR4_SR7 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038A2Cu)

/** Alias (User Manual Name) for SRC_GPSR_GPSR4_SR7.
* To use register names with standard convension, please use SRC_GPSR_GPSR4_SR7.
*/
#define	SRC_GPSR47	(SRC_GPSR_GPSR4_SR7)

/** \brief  A30, GPSR Group 0 */
#define SRC_GPSR_GPSR5_SR0 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038A30u)

/** Alias (User Manual Name) for SRC_GPSR_GPSR5_SR0.
* To use register names with standard convension, please use SRC_GPSR_GPSR5_SR0.
*/
#define	SRC_GPSR50	(SRC_GPSR_GPSR5_SR0)

/** \brief  A34, GPSR Group 1 */
#define SRC_GPSR_GPSR5_SR1 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038A34u)

/** Alias (User Manual Name) for SRC_GPSR_GPSR5_SR1.
* To use register names with standard convension, please use SRC_GPSR_GPSR5_SR1.
*/
#define	SRC_GPSR51	(SRC_GPSR_GPSR5_SR1)

/** \brief  A38, GPSR Group 2 */
#define SRC_GPSR_GPSR5_SR2 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038A38u)

/** Alias (User Manual Name) for SRC_GPSR_GPSR5_SR2.
* To use register names with standard convension, please use SRC_GPSR_GPSR5_SR2.
*/
#define	SRC_GPSR52	(SRC_GPSR_GPSR5_SR2)

/** \brief  A3C, GPSR Group 3 */
#define SRC_GPSR_GPSR5_SR3 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038A3Cu)

/** Alias (User Manual Name) for SRC_GPSR_GPSR5_SR3.
* To use register names with standard convension, please use SRC_GPSR_GPSR5_SR3.
*/
#define	SRC_GPSR53	(SRC_GPSR_GPSR5_SR3)

/** \brief  A40, GPSR Group 4 */
#define SRC_GPSR_GPSR5_SR4 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038A40u)

