Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxSrc_reg.h
/** Alias (User Manual Name) for SRC_GTM_GTM0_ATOM10_1.
* To use register names with standard convension, please use SRC_GTM_GTM0_ATOM10_1.
*/
#define	SRC_GTMATOM101	(SRC_GTM_GTM0_ATOM10_1)

/** \brief  F98, GTM ATOM 0 Shared Service Request */
#define SRC_GTM_GTM0_ATOM10_2 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038F98u)

/** Alias (User Manual Name) for SRC_GTM_GTM0_ATOM10_2.
* To use register names with standard convension, please use SRC_GTM_GTM0_ATOM10_2.
*/
#define	SRC_GTMATOM102	(SRC_GTM_GTM0_ATOM10_2)

/** \brief  F9C, GTM ATOM 0 Shared Service Request */
#define SRC_GTM_GTM0_ATOM10_3 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038F9Cu)

/** Alias (User Manual Name) for SRC_GTM_GTM0_ATOM10_3.
* To use register names with standard convension, please use SRC_GTM_GTM0_ATOM10_3.
*/
#define	SRC_GTMATOM103	(SRC_GTM_GTM0_ATOM10_3)

/** \brief  FA0, GTM ATOM 0 Shared Service Request */
#define SRC_GTM_GTM0_ATOM11_0 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038FA0u)

/** Alias (User Manual Name) for SRC_GTM_GTM0_ATOM11_0.
* To use register names with standard convension, please use SRC_GTM_GTM0_ATOM11_0.
*/
#define	SRC_GTMATOM110	(SRC_GTM_GTM0_ATOM11_0)

/** \brief  FA4, GTM ATOM 0 Shared Service Request */
#define SRC_GTM_GTM0_ATOM11_1 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038FA4u)

/** Alias (User Manual Name) for SRC_GTM_GTM0_ATOM11_1.
* To use register names with standard convension, please use SRC_GTM_GTM0_ATOM11_1.
*/
#define	SRC_GTMATOM111	(SRC_GTM_GTM0_ATOM11_1)

/** \brief  FA8, GTM ATOM 0 Shared Service Request */
#define SRC_GTM_GTM0_ATOM11_2 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038FA8u)

/** Alias (User Manual Name) for SRC_GTM_GTM0_ATOM11_2.
* To use register names with standard convension, please use SRC_GTM_GTM0_ATOM11_2.
*/
#define	SRC_GTMATOM112	(SRC_GTM_GTM0_ATOM11_2)

/** \brief  FAC, GTM ATOM 0 Shared Service Request */
#define SRC_GTM_GTM0_ATOM11_3 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038FACu)

/** Alias (User Manual Name) for SRC_GTM_GTM0_ATOM11_3.
* To use register names with standard convension, please use SRC_GTM_GTM0_ATOM11_3.
*/
#define	SRC_GTMATOM113	(SRC_GTM_GTM0_ATOM11_3)

/** \brief  F00, GTM ATOM 0 Shared Service Request */
#define SRC_GTM_GTM0_ATOM1_0 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038F00u)

/** Alias (User Manual Name) for SRC_GTM_GTM0_ATOM1_0.
* To use register names with standard convension, please use SRC_GTM_GTM0_ATOM1_0.
*/
#define	SRC_GTMATOM10	(SRC_GTM_GTM0_ATOM1_0)

/** \brief  F04, GTM ATOM 0 Shared Service Request */
#define SRC_GTM_GTM0_ATOM1_1 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038F04u)

/** Alias (User Manual Name) for SRC_GTM_GTM0_ATOM1_1.
* To use register names with standard convension, please use SRC_GTM_GTM0_ATOM1_1.
*/
#define	SRC_GTMATOM11	(SRC_GTM_GTM0_ATOM1_1)

/** \brief  F08, GTM ATOM 0 Shared Service Request */
#define SRC_GTM_GTM0_ATOM1_2 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038F08u)

/** Alias (User Manual Name) for SRC_GTM_GTM0_ATOM1_2.
* To use register names with standard convension, please use SRC_GTM_GTM0_ATOM1_2.
*/
#define	SRC_GTMATOM12	(SRC_GTM_GTM0_ATOM1_2)

/** \brief  F0C, GTM ATOM 0 Shared Service Request */
#define SRC_GTM_GTM0_ATOM1_3 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038F0Cu)

/** Alias (User Manual Name) for SRC_GTM_GTM0_ATOM1_3.
* To use register names with standard convension, please use SRC_GTM_GTM0_ATOM1_3.
*/
#define	SRC_GTMATOM13	(SRC_GTM_GTM0_ATOM1_3)

/** \brief  F10, GTM ATOM 0 Shared Service Request */
#define SRC_GTM_GTM0_ATOM2_0 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038F10u)

/** Alias (User Manual Name) for SRC_GTM_GTM0_ATOM2_0.
* To use register names with standard convension, please use SRC_GTM_GTM0_ATOM2_0.
*/
#define	SRC_GTMATOM20	(SRC_GTM_GTM0_ATOM2_0)

/** \brief  F14, GTM ATOM 0 Shared Service Request */
#define SRC_GTM_GTM0_ATOM2_1 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038F14u)

/** Alias (User Manual Name) for SRC_GTM_GTM0_ATOM2_1.
* To use register names with standard convension, please use SRC_GTM_GTM0_ATOM2_1.
*/
#define	SRC_GTMATOM21	(SRC_GTM_GTM0_ATOM2_1)

/** \brief  F18, GTM ATOM 0 Shared Service Request */
#define SRC_GTM_GTM0_ATOM2_2 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038F18u)

/** Alias (User Manual Name) for SRC_GTM_GTM0_ATOM2_2.
* To use register names with standard convension, please use SRC_GTM_GTM0_ATOM2_2.
*/
#define	SRC_GTMATOM22	(SRC_GTM_GTM0_ATOM2_2)

/** \brief  F1C, GTM ATOM 0 Shared Service Request */
#define SRC_GTM_GTM0_ATOM2_3 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038F1Cu)

/** Alias (User Manual Name) for SRC_GTM_GTM0_ATOM2_3.
* To use register names with standard convension, please use SRC_GTM_GTM0_ATOM2_3.
*/
#define	SRC_GTMATOM23	(SRC_GTM_GTM0_ATOM2_3)

/** \brief  F20, GTM ATOM 0 Shared Service Request */
#define SRC_GTM_GTM0_ATOM3_0 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038F20u)

/** Alias (User Manual Name) for SRC_GTM_GTM0_ATOM3_0.
* To use register names with standard convension, please use SRC_GTM_GTM0_ATOM3_0.
*/
#define	SRC_GTMATOM30	(SRC_GTM_GTM0_ATOM3_0)

/** \brief  F24, GTM ATOM 0 Shared Service Request */
#define SRC_GTM_GTM0_ATOM3_1 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038F24u)

/** Alias (User Manual Name) for SRC_GTM_GTM0_ATOM3_1.
* To use register names with standard convension, please use SRC_GTM_GTM0_ATOM3_1.
*/
#define	SRC_GTMATOM31	(SRC_GTM_GTM0_ATOM3_1)

/** \brief  F28, GTM ATOM 0 Shared Service Request */
#define SRC_GTM_GTM0_ATOM3_2 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038F28u)

/** Alias (User Manual Name) for SRC_GTM_GTM0_ATOM3_2.
* To use register names with standard convension, please use SRC_GTM_GTM0_ATOM3_2.
*/
#define	SRC_GTMATOM32	(SRC_GTM_GTM0_ATOM3_2)

/** \brief  F2C, GTM ATOM 0 Shared Service Request */
#define SRC_GTM_GTM0_ATOM3_3 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038F2Cu)

/** Alias (User Manual Name) for SRC_GTM_GTM0_ATOM3_3.
* To use register names with standard convension, please use SRC_GTM_GTM0_ATOM3_3.
*/
#define	SRC_GTMATOM33	(SRC_GTM_GTM0_ATOM3_3)

