Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxSrc_reg.h
/** \brief  F30, GTM ATOM 0 Shared Service Request */
#define SRC_GTM_GTM0_ATOM4_0 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038F30u)

/** Alias (User Manual Name) for SRC_GTM_GTM0_ATOM4_0.
* To use register names with standard convension, please use SRC_GTM_GTM0_ATOM4_0.
*/
#define	SRC_GTMATOM40	(SRC_GTM_GTM0_ATOM4_0)

/** \brief  F34, GTM ATOM 0 Shared Service Request */
#define SRC_GTM_GTM0_ATOM4_1 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038F34u)

/** Alias (User Manual Name) for SRC_GTM_GTM0_ATOM4_1.
* To use register names with standard convension, please use SRC_GTM_GTM0_ATOM4_1.
*/
#define	SRC_GTMATOM41	(SRC_GTM_GTM0_ATOM4_1)

/** \brief  F38, GTM ATOM 0 Shared Service Request */
#define SRC_GTM_GTM0_ATOM4_2 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038F38u)

/** Alias (User Manual Name) for SRC_GTM_GTM0_ATOM4_2.
* To use register names with standard convension, please use SRC_GTM_GTM0_ATOM4_2.
*/
#define	SRC_GTMATOM42	(SRC_GTM_GTM0_ATOM4_2)

/** \brief  F3C, GTM ATOM 0 Shared Service Request */
#define SRC_GTM_GTM0_ATOM4_3 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038F3Cu)

/** Alias (User Manual Name) for SRC_GTM_GTM0_ATOM4_3.
* To use register names with standard convension, please use SRC_GTM_GTM0_ATOM4_3.
*/
#define	SRC_GTMATOM43	(SRC_GTM_GTM0_ATOM4_3)

/** \brief  F40, GTM ATOM 0 Shared Service Request */
#define SRC_GTM_GTM0_ATOM5_0 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038F40u)

/** Alias (User Manual Name) for SRC_GTM_GTM0_ATOM5_0.
* To use register names with standard convension, please use SRC_GTM_GTM0_ATOM5_0.
*/
#define	SRC_GTMATOM50	(SRC_GTM_GTM0_ATOM5_0)

/** \brief  F44, GTM ATOM 0 Shared Service Request */
#define SRC_GTM_GTM0_ATOM5_1 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038F44u)

/** Alias (User Manual Name) for SRC_GTM_GTM0_ATOM5_1.
* To use register names with standard convension, please use SRC_GTM_GTM0_ATOM5_1.
*/
#define	SRC_GTMATOM51	(SRC_GTM_GTM0_ATOM5_1)

/** \brief  F48, GTM ATOM 0 Shared Service Request */
#define SRC_GTM_GTM0_ATOM5_2 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038F48u)

/** Alias (User Manual Name) for SRC_GTM_GTM0_ATOM5_2.
* To use register names with standard convension, please use SRC_GTM_GTM0_ATOM5_2.
*/
#define	SRC_GTMATOM52	(SRC_GTM_GTM0_ATOM5_2)

/** \brief  F4C, GTM ATOM 0 Shared Service Request */
#define SRC_GTM_GTM0_ATOM5_3 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038F4Cu)

/** Alias (User Manual Name) for SRC_GTM_GTM0_ATOM5_3.
* To use register names with standard convension, please use SRC_GTM_GTM0_ATOM5_3.
*/
#define	SRC_GTMATOM53	(SRC_GTM_GTM0_ATOM5_3)

/** \brief  F50, GTM ATOM 0 Shared Service Request */
#define SRC_GTM_GTM0_ATOM6_0 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038F50u)

/** Alias (User Manual Name) for SRC_GTM_GTM0_ATOM6_0.
* To use register names with standard convension, please use SRC_GTM_GTM0_ATOM6_0.
*/
#define	SRC_GTMATOM60	(SRC_GTM_GTM0_ATOM6_0)

/** \brief  F54, GTM ATOM 0 Shared Service Request */
#define SRC_GTM_GTM0_ATOM6_1 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038F54u)

/** Alias (User Manual Name) for SRC_GTM_GTM0_ATOM6_1.
* To use register names with standard convension, please use SRC_GTM_GTM0_ATOM6_1.
*/
#define	SRC_GTMATOM61	(SRC_GTM_GTM0_ATOM6_1)

/** \brief  F58, GTM ATOM 0 Shared Service Request */
#define SRC_GTM_GTM0_ATOM6_2 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038F58u)

/** Alias (User Manual Name) for SRC_GTM_GTM0_ATOM6_2.
* To use register names with standard convension, please use SRC_GTM_GTM0_ATOM6_2.
*/
#define	SRC_GTMATOM62	(SRC_GTM_GTM0_ATOM6_2)

/** \brief  F5C, GTM ATOM 0 Shared Service Request */
#define SRC_GTM_GTM0_ATOM6_3 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038F5Cu)

/** Alias (User Manual Name) for SRC_GTM_GTM0_ATOM6_3.
* To use register names with standard convension, please use SRC_GTM_GTM0_ATOM6_3.
*/
#define	SRC_GTMATOM63	(SRC_GTM_GTM0_ATOM6_3)

/** \brief  F60, GTM ATOM 0 Shared Service Request */
#define SRC_GTM_GTM0_ATOM7_0 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038F60u)

/** Alias (User Manual Name) for SRC_GTM_GTM0_ATOM7_0.
* To use register names with standard convension, please use SRC_GTM_GTM0_ATOM7_0.
*/
#define	SRC_GTMATOM70	(SRC_GTM_GTM0_ATOM7_0)

/** \brief  F64, GTM ATOM 0 Shared Service Request */
#define SRC_GTM_GTM0_ATOM7_1 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038F64u)

/** Alias (User Manual Name) for SRC_GTM_GTM0_ATOM7_1.
* To use register names with standard convension, please use SRC_GTM_GTM0_ATOM7_1.
*/
#define	SRC_GTMATOM71	(SRC_GTM_GTM0_ATOM7_1)

/** \brief  F68, GTM ATOM 0 Shared Service Request */
#define SRC_GTM_GTM0_ATOM7_2 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038F68u)

/** Alias (User Manual Name) for SRC_GTM_GTM0_ATOM7_2.
* To use register names with standard convension, please use SRC_GTM_GTM0_ATOM7_2.
*/
#define	SRC_GTMATOM72	(SRC_GTM_GTM0_ATOM7_2)

/** \brief  F6C, GTM ATOM 0 Shared Service Request */
#define SRC_GTM_GTM0_ATOM7_3 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038F6Cu)

/** Alias (User Manual Name) for SRC_GTM_GTM0_ATOM7_3.
* To use register names with standard convension, please use SRC_GTM_GTM0_ATOM7_3.
*/
#define	SRC_GTMATOM73	(SRC_GTM_GTM0_ATOM7_3)

/** \brief  F70, GTM ATOM 0 Shared Service Request */
#define SRC_GTM_GTM0_ATOM8_0 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038F70u)

/** Alias (User Manual Name) for SRC_GTM_GTM0_ATOM8_0.
* To use register names with standard convension, please use SRC_GTM_GTM0_ATOM8_0.
*/
#define	SRC_GTMATOM80	(SRC_GTM_GTM0_ATOM8_0)

/** \brief  F74, GTM ATOM 0 Shared Service Request */
#define SRC_GTM_GTM0_ATOM8_1 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038F74u)

/** Alias (User Manual Name) for SRC_GTM_GTM0_ATOM8_1.
* To use register names with standard convension, please use SRC_GTM_GTM0_ATOM8_1.
*/
#define	SRC_GTMATOM81	(SRC_GTM_GTM0_ATOM8_1)

/** \brief  F78, GTM ATOM 0 Shared Service Request */
#define SRC_GTM_GTM0_ATOM8_2 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038F78u)

/** Alias (User Manual Name) for SRC_GTM_GTM0_ATOM8_2.
* To use register names with standard convension, please use SRC_GTM_GTM0_ATOM8_2.
*/
#define	SRC_GTMATOM82	(SRC_GTM_GTM0_ATOM8_2)

/** \brief  F7C, GTM ATOM 0 Shared Service Request */
#define SRC_GTM_GTM0_ATOM8_3 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038F7Cu)

/** Alias (User Manual Name) for SRC_GTM_GTM0_ATOM8_3.
* To use register names with standard convension, please use SRC_GTM_GTM0_ATOM8_3.
*/
#define	SRC_GTMATOM83	(SRC_GTM_GTM0_ATOM8_3)

/** \brief  F80, GTM ATOM 0 Shared Service Request */
#define SRC_GTM_GTM0_ATOM9_0 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038F80u)

