Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxSrc_reg.h
/** \brief  D24, GTM MCS 0 Shared Service Request */
#define SRC_GTM_GTM0_MCS3_5 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038D24u)

/** Alias (User Manual Name) for SRC_GTM_GTM0_MCS3_5.
* To use register names with standard convension, please use SRC_GTM_GTM0_MCS3_5.
*/
#define	SRC_GTMMCS35	(SRC_GTM_GTM0_MCS3_5)

/** \brief  D28, GTM MCS 0 Shared Service Request */
#define SRC_GTM_GTM0_MCS3_6 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038D28u)

/** Alias (User Manual Name) for SRC_GTM_GTM0_MCS3_6.
* To use register names with standard convension, please use SRC_GTM_GTM0_MCS3_6.
*/
#define	SRC_GTMMCS36	(SRC_GTM_GTM0_MCS3_6)

/** \brief  D2C, GTM MCS 0 Shared Service Request */
#define SRC_GTM_GTM0_MCS3_7 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038D2Cu)

/** Alias (User Manual Name) for SRC_GTM_GTM0_MCS3_7.
* To use register names with standard convension, please use SRC_GTM_GTM0_MCS3_7.
*/
#define	SRC_GTMMCS37	(SRC_GTM_GTM0_MCS3_7)

/** \brief  D30, GTM MCS 0 Shared Service Request */
#define SRC_GTM_GTM0_MCS4_0 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038D30u)

/** Alias (User Manual Name) for SRC_GTM_GTM0_MCS4_0.
* To use register names with standard convension, please use SRC_GTM_GTM0_MCS4_0.
*/
#define	SRC_GTMMCS40	(SRC_GTM_GTM0_MCS4_0)

/** \brief  D34, GTM MCS 0 Shared Service Request */
#define SRC_GTM_GTM0_MCS4_1 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038D34u)

/** Alias (User Manual Name) for SRC_GTM_GTM0_MCS4_1.
* To use register names with standard convension, please use SRC_GTM_GTM0_MCS4_1.
*/
#define	SRC_GTMMCS41	(SRC_GTM_GTM0_MCS4_1)

/** \brief  D38, GTM MCS 0 Shared Service Request */
#define SRC_GTM_GTM0_MCS4_2 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038D38u)

/** Alias (User Manual Name) for SRC_GTM_GTM0_MCS4_2.
* To use register names with standard convension, please use SRC_GTM_GTM0_MCS4_2.
*/
#define	SRC_GTMMCS42	(SRC_GTM_GTM0_MCS4_2)

/** \brief  D3C, GTM MCS 0 Shared Service Request */
#define SRC_GTM_GTM0_MCS4_3 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038D3Cu)

/** Alias (User Manual Name) for SRC_GTM_GTM0_MCS4_3.
* To use register names with standard convension, please use SRC_GTM_GTM0_MCS4_3.
*/
#define	SRC_GTMMCS43	(SRC_GTM_GTM0_MCS4_3)

/** \brief  D40, GTM MCS 0 Shared Service Request */
#define SRC_GTM_GTM0_MCS4_4 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038D40u)

/** Alias (User Manual Name) for SRC_GTM_GTM0_MCS4_4.
* To use register names with standard convension, please use SRC_GTM_GTM0_MCS4_4.
*/
#define	SRC_GTMMCS44	(SRC_GTM_GTM0_MCS4_4)

/** \brief  D44, GTM MCS 0 Shared Service Request */
#define SRC_GTM_GTM0_MCS4_5 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038D44u)

/** Alias (User Manual Name) for SRC_GTM_GTM0_MCS4_5.
* To use register names with standard convension, please use SRC_GTM_GTM0_MCS4_5.
*/
#define	SRC_GTMMCS45	(SRC_GTM_GTM0_MCS4_5)

/** \brief  D48, GTM MCS 0 Shared Service Request */
#define SRC_GTM_GTM0_MCS4_6 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038D48u)

/** Alias (User Manual Name) for SRC_GTM_GTM0_MCS4_6.
* To use register names with standard convension, please use SRC_GTM_GTM0_MCS4_6.
*/
#define	SRC_GTMMCS46	(SRC_GTM_GTM0_MCS4_6)

/** \brief  D4C, GTM MCS 0 Shared Service Request */
#define SRC_GTM_GTM0_MCS4_7 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038D4Cu)

/** Alias (User Manual Name) for SRC_GTM_GTM0_MCS4_7.
* To use register names with standard convension, please use SRC_GTM_GTM0_MCS4_7.
*/
#define	SRC_GTMMCS47	(SRC_GTM_GTM0_MCS4_7)

/** \brief  D50, GTM MCS 0 Shared Service Request */
#define SRC_GTM_GTM0_MCS5_0 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038D50u)

/** Alias (User Manual Name) for SRC_GTM_GTM0_MCS5_0.
* To use register names with standard convension, please use SRC_GTM_GTM0_MCS5_0.
*/
#define	SRC_GTMMCS50	(SRC_GTM_GTM0_MCS5_0)

/** \brief  D54, GTM MCS 0 Shared Service Request */
#define SRC_GTM_GTM0_MCS5_1 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038D54u)

/** Alias (User Manual Name) for SRC_GTM_GTM0_MCS5_1.
* To use register names with standard convension, please use SRC_GTM_GTM0_MCS5_1.
*/
#define	SRC_GTMMCS51	(SRC_GTM_GTM0_MCS5_1)

/** \brief  D58, GTM MCS 0 Shared Service Request */
#define SRC_GTM_GTM0_MCS5_2 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038D58u)

/** Alias (User Manual Name) for SRC_GTM_GTM0_MCS5_2.
* To use register names with standard convension, please use SRC_GTM_GTM0_MCS5_2.
*/
#define	SRC_GTMMCS52	(SRC_GTM_GTM0_MCS5_2)

/** \brief  D5C, GTM MCS 0 Shared Service Request */
#define SRC_GTM_GTM0_MCS5_3 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038D5Cu)

/** Alias (User Manual Name) for SRC_GTM_GTM0_MCS5_3.
* To use register names with standard convension, please use SRC_GTM_GTM0_MCS5_3.
*/
#define	SRC_GTMMCS53	(SRC_GTM_GTM0_MCS5_3)

/** \brief  D60, GTM MCS 0 Shared Service Request */
#define SRC_GTM_GTM0_MCS5_4 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038D60u)

/** Alias (User Manual Name) for SRC_GTM_GTM0_MCS5_4.
* To use register names with standard convension, please use SRC_GTM_GTM0_MCS5_4.
*/
#define	SRC_GTMMCS54	(SRC_GTM_GTM0_MCS5_4)

/** \brief  D64, GTM MCS 0 Shared Service Request */
#define SRC_GTM_GTM0_MCS5_5 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038D64u)

/** Alias (User Manual Name) for SRC_GTM_GTM0_MCS5_5.
* To use register names with standard convension, please use SRC_GTM_GTM0_MCS5_5.
*/
#define	SRC_GTMMCS55	(SRC_GTM_GTM0_MCS5_5)

/** \brief  D68, GTM MCS 0 Shared Service Request */
#define SRC_GTM_GTM0_MCS5_6 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038D68u)

/** Alias (User Manual Name) for SRC_GTM_GTM0_MCS5_6.
* To use register names with standard convension, please use SRC_GTM_GTM0_MCS5_6.
*/
#define	SRC_GTMMCS56	(SRC_GTM_GTM0_MCS5_6)

/** \brief  D6C, GTM MCS 0 Shared Service Request */
#define SRC_GTM_GTM0_MCS5_7 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038D6Cu)

/** Alias (User Manual Name) for SRC_GTM_GTM0_MCS5_7.
* To use register names with standard convension, please use SRC_GTM_GTM0_MCS5_7.
*/
#define	SRC_GTMMCS57	(SRC_GTM_GTM0_MCS5_7)

/** \brief  D70, GTM MCS 0 Shared Service Request */
#define SRC_GTM_GTM0_MCS6_0 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038D70u)

