Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxSrc_reg.h
/** Alias (User Manual Name) for SRC_GTM_GTM0_MCS6_0.
* To use register names with standard convension, please use SRC_GTM_GTM0_MCS6_0.
*/
#define	SRC_GTMMCS60	(SRC_GTM_GTM0_MCS6_0)

/** \brief  D74, GTM MCS 0 Shared Service Request */
#define SRC_GTM_GTM0_MCS6_1 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038D74u)

/** Alias (User Manual Name) for SRC_GTM_GTM0_MCS6_1.
* To use register names with standard convension, please use SRC_GTM_GTM0_MCS6_1.
*/
#define	SRC_GTMMCS61	(SRC_GTM_GTM0_MCS6_1)

/** \brief  D78, GTM MCS 0 Shared Service Request */
#define SRC_GTM_GTM0_MCS6_2 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038D78u)

/** Alias (User Manual Name) for SRC_GTM_GTM0_MCS6_2.
* To use register names with standard convension, please use SRC_GTM_GTM0_MCS6_2.
*/
#define	SRC_GTMMCS62	(SRC_GTM_GTM0_MCS6_2)

/** \brief  D7C, GTM MCS 0 Shared Service Request */
#define SRC_GTM_GTM0_MCS6_3 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038D7Cu)

/** Alias (User Manual Name) for SRC_GTM_GTM0_MCS6_3.
* To use register names with standard convension, please use SRC_GTM_GTM0_MCS6_3.
*/
#define	SRC_GTMMCS63	(SRC_GTM_GTM0_MCS6_3)

/** \brief  D80, GTM MCS 0 Shared Service Request */
#define SRC_GTM_GTM0_MCS6_4 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038D80u)

/** Alias (User Manual Name) for SRC_GTM_GTM0_MCS6_4.
* To use register names with standard convension, please use SRC_GTM_GTM0_MCS6_4.
*/
#define	SRC_GTMMCS64	(SRC_GTM_GTM0_MCS6_4)

/** \brief  D84, GTM MCS 0 Shared Service Request */
#define SRC_GTM_GTM0_MCS6_5 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038D84u)

/** Alias (User Manual Name) for SRC_GTM_GTM0_MCS6_5.
* To use register names with standard convension, please use SRC_GTM_GTM0_MCS6_5.
*/
#define	SRC_GTMMCS65	(SRC_GTM_GTM0_MCS6_5)

/** \brief  D88, GTM MCS 0 Shared Service Request */
#define SRC_GTM_GTM0_MCS6_6 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038D88u)

/** Alias (User Manual Name) for SRC_GTM_GTM0_MCS6_6.
* To use register names with standard convension, please use SRC_GTM_GTM0_MCS6_6.
*/
#define	SRC_GTMMCS66	(SRC_GTM_GTM0_MCS6_6)

/** \brief  D8C, GTM MCS 0 Shared Service Request */
#define SRC_GTM_GTM0_MCS6_7 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038D8Cu)

/** Alias (User Manual Name) for SRC_GTM_GTM0_MCS6_7.
* To use register names with standard convension, please use SRC_GTM_GTM0_MCS6_7.
*/
#define	SRC_GTMMCS67	(SRC_GTM_GTM0_MCS6_7)

/** \brief  D90, GTM MCS 0 Shared Service Request */
#define SRC_GTM_GTM0_MCS7_0 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038D90u)

/** Alias (User Manual Name) for SRC_GTM_GTM0_MCS7_0.
* To use register names with standard convension, please use SRC_GTM_GTM0_MCS7_0.
*/
#define	SRC_GTMMCS70	(SRC_GTM_GTM0_MCS7_0)

/** \brief  D94, GTM MCS 0 Shared Service Request */
#define SRC_GTM_GTM0_MCS7_1 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038D94u)

/** Alias (User Manual Name) for SRC_GTM_GTM0_MCS7_1.
* To use register names with standard convension, please use SRC_GTM_GTM0_MCS7_1.
*/
#define	SRC_GTMMCS71	(SRC_GTM_GTM0_MCS7_1)

/** \brief  D98, GTM MCS 0 Shared Service Request */
#define SRC_GTM_GTM0_MCS7_2 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038D98u)

/** Alias (User Manual Name) for SRC_GTM_GTM0_MCS7_2.
* To use register names with standard convension, please use SRC_GTM_GTM0_MCS7_2.
*/
#define	SRC_GTMMCS72	(SRC_GTM_GTM0_MCS7_2)

/** \brief  D9C, GTM MCS 0 Shared Service Request */
#define SRC_GTM_GTM0_MCS7_3 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038D9Cu)

/** Alias (User Manual Name) for SRC_GTM_GTM0_MCS7_3.
* To use register names with standard convension, please use SRC_GTM_GTM0_MCS7_3.
*/
#define	SRC_GTMMCS73	(SRC_GTM_GTM0_MCS7_3)

/** \brief  DA0, GTM MCS 0 Shared Service Request */
#define SRC_GTM_GTM0_MCS7_4 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038DA0u)

/** Alias (User Manual Name) for SRC_GTM_GTM0_MCS7_4.
* To use register names with standard convension, please use SRC_GTM_GTM0_MCS7_4.
*/
#define	SRC_GTMMCS74	(SRC_GTM_GTM0_MCS7_4)

/** \brief  DA4, GTM MCS 0 Shared Service Request */
#define SRC_GTM_GTM0_MCS7_5 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038DA4u)

/** Alias (User Manual Name) for SRC_GTM_GTM0_MCS7_5.
* To use register names with standard convension, please use SRC_GTM_GTM0_MCS7_5.
*/
#define	SRC_GTMMCS75	(SRC_GTM_GTM0_MCS7_5)

/** \brief  DA8, GTM MCS 0 Shared Service Request */
#define SRC_GTM_GTM0_MCS7_6 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038DA8u)

/** Alias (User Manual Name) for SRC_GTM_GTM0_MCS7_6.
* To use register names with standard convension, please use SRC_GTM_GTM0_MCS7_6.
*/
#define	SRC_GTMMCS76	(SRC_GTM_GTM0_MCS7_6)

/** \brief  DAC, GTM MCS 0 Shared Service Request */
#define SRC_GTM_GTM0_MCS7_7 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038DACu)

/** Alias (User Manual Name) for SRC_GTM_GTM0_MCS7_7.
* To use register names with standard convension, please use SRC_GTM_GTM0_MCS7_7.
*/
#define	SRC_GTMMCS77	(SRC_GTM_GTM0_MCS7_7)

/** \brief  DB0, GTM MCS 0 Shared Service Request */
#define SRC_GTM_GTM0_MCS8_0 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038DB0u)

/** Alias (User Manual Name) for SRC_GTM_GTM0_MCS8_0.
* To use register names with standard convension, please use SRC_GTM_GTM0_MCS8_0.
*/
#define	SRC_GTMMCS80	(SRC_GTM_GTM0_MCS8_0)

/** \brief  DB4, GTM MCS 0 Shared Service Request */
#define SRC_GTM_GTM0_MCS8_1 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038DB4u)

/** Alias (User Manual Name) for SRC_GTM_GTM0_MCS8_1.
* To use register names with standard convension, please use SRC_GTM_GTM0_MCS8_1.
*/
#define	SRC_GTMMCS81	(SRC_GTM_GTM0_MCS8_1)

/** \brief  DB8, GTM MCS 0 Shared Service Request */
#define SRC_GTM_GTM0_MCS8_2 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038DB8u)

/** Alias (User Manual Name) for SRC_GTM_GTM0_MCS8_2.
* To use register names with standard convension, please use SRC_GTM_GTM0_MCS8_2.
*/
#define	SRC_GTMMCS82	(SRC_GTM_GTM0_MCS8_2)

/** \brief  DBC, GTM MCS 0 Shared Service Request */
#define SRC_GTM_GTM0_MCS8_3 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038DBCu)

