Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxSrc_reg.h
/** Alias (User Manual Name) for SRC_GTM_GTM0_MCS8_3.
* To use register names with standard convension, please use SRC_GTM_GTM0_MCS8_3.
*/
#define	SRC_GTMMCS83	(SRC_GTM_GTM0_MCS8_3)

/** \brief  DC0, GTM MCS 0 Shared Service Request */
#define SRC_GTM_GTM0_MCS8_4 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038DC0u)

/** Alias (User Manual Name) for SRC_GTM_GTM0_MCS8_4.
* To use register names with standard convension, please use SRC_GTM_GTM0_MCS8_4.
*/
#define	SRC_GTMMCS84	(SRC_GTM_GTM0_MCS8_4)

/** \brief  DC4, GTM MCS 0 Shared Service Request */
#define SRC_GTM_GTM0_MCS8_5 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038DC4u)

/** Alias (User Manual Name) for SRC_GTM_GTM0_MCS8_5.
* To use register names with standard convension, please use SRC_GTM_GTM0_MCS8_5.
*/
#define	SRC_GTMMCS85	(SRC_GTM_GTM0_MCS8_5)

/** \brief  DC8, GTM MCS 0 Shared Service Request */
#define SRC_GTM_GTM0_MCS8_6 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038DC8u)

/** Alias (User Manual Name) for SRC_GTM_GTM0_MCS8_6.
* To use register names with standard convension, please use SRC_GTM_GTM0_MCS8_6.
*/
#define	SRC_GTMMCS86	(SRC_GTM_GTM0_MCS8_6)

/** \brief  DCC, GTM MCS 0 Shared Service Request */
#define SRC_GTM_GTM0_MCS8_7 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038DCCu)

/** Alias (User Manual Name) for SRC_GTM_GTM0_MCS8_7.
* To use register names with standard convension, please use SRC_GTM_GTM0_MCS8_7.
*/
#define	SRC_GTMMCS87	(SRC_GTM_GTM0_MCS8_7)

/** \brief  DD0, GTM MCS 0 Shared Service Request */
#define SRC_GTM_GTM0_MCS9_0 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038DD0u)

/** Alias (User Manual Name) for SRC_GTM_GTM0_MCS9_0.
* To use register names with standard convension, please use SRC_GTM_GTM0_MCS9_0.
*/
#define	SRC_GTMMCS90	(SRC_GTM_GTM0_MCS9_0)

/** \brief  DD4, GTM MCS 0 Shared Service Request */
#define SRC_GTM_GTM0_MCS9_1 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038DD4u)

/** Alias (User Manual Name) for SRC_GTM_GTM0_MCS9_1.
* To use register names with standard convension, please use SRC_GTM_GTM0_MCS9_1.
*/
#define	SRC_GTMMCS91	(SRC_GTM_GTM0_MCS9_1)

/** \brief  DD8, GTM MCS 0 Shared Service Request */
#define SRC_GTM_GTM0_MCS9_2 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038DD8u)

/** Alias (User Manual Name) for SRC_GTM_GTM0_MCS9_2.
* To use register names with standard convension, please use SRC_GTM_GTM0_MCS9_2.
*/
#define	SRC_GTMMCS92	(SRC_GTM_GTM0_MCS9_2)

/** \brief  DDC, GTM MCS 0 Shared Service Request */
#define SRC_GTM_GTM0_MCS9_3 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038DDCu)

/** Alias (User Manual Name) for SRC_GTM_GTM0_MCS9_3.
* To use register names with standard convension, please use SRC_GTM_GTM0_MCS9_3.
*/
#define	SRC_GTMMCS93	(SRC_GTM_GTM0_MCS9_3)

/** \brief  DE0, GTM MCS 0 Shared Service Request */
#define SRC_GTM_GTM0_MCS9_4 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038DE0u)

/** Alias (User Manual Name) for SRC_GTM_GTM0_MCS9_4.
* To use register names with standard convension, please use SRC_GTM_GTM0_MCS9_4.
*/
#define	SRC_GTMMCS94	(SRC_GTM_GTM0_MCS9_4)

/** \brief  DE4, GTM MCS 0 Shared Service Request */
#define SRC_GTM_GTM0_MCS9_5 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038DE4u)

/** Alias (User Manual Name) for SRC_GTM_GTM0_MCS9_5.
* To use register names with standard convension, please use SRC_GTM_GTM0_MCS9_5.
*/
#define	SRC_GTMMCS95	(SRC_GTM_GTM0_MCS9_5)

/** \brief  DE8, GTM MCS 0 Shared Service Request */
#define SRC_GTM_GTM0_MCS9_6 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038DE8u)

/** Alias (User Manual Name) for SRC_GTM_GTM0_MCS9_6.
* To use register names with standard convension, please use SRC_GTM_GTM0_MCS9_6.
*/
#define	SRC_GTMMCS96	(SRC_GTM_GTM0_MCS9_6)

/** \brief  DEC, GTM MCS 0 Shared Service Request */
#define SRC_GTM_GTM0_MCS9_7 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038DECu)

/** Alias (User Manual Name) for SRC_GTM_GTM0_MCS9_7.
* To use register names with standard convension, please use SRC_GTM_GTM0_MCS9_7.
*/
#define	SRC_GTMMCS97	(SRC_GTM_GTM0_MCS9_7)

/** \brief  FD0, GTM Multi Channel Sequencer Service Request 0 */
#define SRC_GTM_GTM0_MCSW0 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038FD0u)

/** Alias (User Manual Name) for SRC_GTM_GTM0_MCSW0.
* To use register names with standard convension, please use SRC_GTM_GTM0_MCSW0.
*/
#define	SRC_GTMMCSW0	(SRC_GTM_GTM0_MCSW0)

/** \brief  FD4, GTM Multi Channel Sequencer Service Request 0 */
#define SRC_GTM_GTM0_MCSW1 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038FD4u)

/** Alias (User Manual Name) for SRC_GTM_GTM0_MCSW1.
* To use register names with standard convension, please use SRC_GTM_GTM0_MCSW1.
*/
#define	SRC_GTMMCSW1	(SRC_GTM_GTM0_MCSW1)

/** \brief  FD8, GTM Multi Channel Sequencer Service Request 0 */
#define SRC_GTM_GTM0_MCSW2 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038FD8u)

/** Alias (User Manual Name) for SRC_GTM_GTM0_MCSW2.
* To use register names with standard convension, please use SRC_GTM_GTM0_MCSW2.
*/
#define	SRC_GTMMCSW2	(SRC_GTM_GTM0_MCSW2)

/** \brief  FDC, GTM Multi Channel Sequencer Service Request 0 */
#define SRC_GTM_GTM0_MCSW3 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038FDCu)

/** Alias (User Manual Name) for SRC_GTM_GTM0_MCSW3.
* To use register names with standard convension, please use SRC_GTM_GTM0_MCSW3.
*/
#define	SRC_GTMMCSW3	(SRC_GTM_GTM0_MCSW3)

/** \brief  FE0, GTM Multi Channel Sequencer Service Request 0 */
#define SRC_GTM_GTM0_MCSW4 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038FE0u)

/** Alias (User Manual Name) for SRC_GTM_GTM0_MCSW4.
* To use register names with standard convension, please use SRC_GTM_GTM0_MCSW4.
*/
#define	SRC_GTMMCSW4	(SRC_GTM_GTM0_MCSW4)

/** \brief  FE4, GTM Multi Channel Sequencer Service Request 0 */
#define SRC_GTM_GTM0_MCSW5 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038FE4u)

/** Alias (User Manual Name) for SRC_GTM_GTM0_MCSW5.
* To use register names with standard convension, please use SRC_GTM_GTM0_MCSW5.
*/
#define	SRC_GTMMCSW5	(SRC_GTM_GTM0_MCSW5)

/** \brief  FE8, GTM Multi Channel Sequencer Service Request 0 */
#define SRC_GTM_GTM0_MCSW6 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038FE8u)

/** Alias (User Manual Name) for SRC_GTM_GTM0_MCSW6.
* To use register names with standard convension, please use SRC_GTM_GTM0_MCSW6.
*/
#define	SRC_GTMMCSW6	(SRC_GTM_GTM0_MCSW6)

/** \brief  FEC, GTM Multi Channel Sequencer Service Request 0 */
#define SRC_GTM_GTM0_MCSW7 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038FECu)

/** Alias (User Manual Name) for SRC_GTM_GTM0_MCSW7.
* To use register names with standard convension, please use SRC_GTM_GTM0_MCSW7.
*/
#define	SRC_GTMMCSW7	(SRC_GTM_GTM0_MCSW7)

/** \brief  FF0, GTM Multi Channel Sequencer Service Request 0 */
#define SRC_GTM_GTM0_MCSW8 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038FF0u)

