Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxSrc_reg.h
/** Alias (User Manual Name) for SRC_GTM_GTM0_MCSW8.
* To use register names with standard convension, please use SRC_GTM_GTM0_MCSW8.
*/
#define	SRC_GTMMCSW8	(SRC_GTM_GTM0_MCSW8)

/** \brief  FF4, GTM Multi Channel Sequencer Service Request 0 */
#define SRC_GTM_GTM0_MCSW9 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038FF4u)

/** Alias (User Manual Name) for SRC_GTM_GTM0_MCSW9.
* To use register names with standard convension, please use SRC_GTM_GTM0_MCSW9.
*/
#define	SRC_GTMMCSW9	(SRC_GTM_GTM0_MCSW9)

/** \brief  AA0, GTM PSM 0 Shared Service Request */
#define SRC_GTM_GTM0_PSM0_0 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038AA0u)

/** Alias (User Manual Name) for SRC_GTM_GTM0_PSM0_0.
* To use register names with standard convension, please use SRC_GTM_GTM0_PSM0_0.
*/
#define	SRC_GTMPSM00	(SRC_GTM_GTM0_PSM0_0)

/** \brief  AA4, GTM PSM 0 Shared Service Request */
#define SRC_GTM_GTM0_PSM0_1 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038AA4u)

/** Alias (User Manual Name) for SRC_GTM_GTM0_PSM0_1.
* To use register names with standard convension, please use SRC_GTM_GTM0_PSM0_1.
*/
#define	SRC_GTMPSM01	(SRC_GTM_GTM0_PSM0_1)

/** \brief  AA8, GTM PSM 0 Shared Service Request */
#define SRC_GTM_GTM0_PSM0_2 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038AA8u)

/** Alias (User Manual Name) for SRC_GTM_GTM0_PSM0_2.
* To use register names with standard convension, please use SRC_GTM_GTM0_PSM0_2.
*/
#define	SRC_GTMPSM02	(SRC_GTM_GTM0_PSM0_2)

/** \brief  AAC, GTM PSM 0 Shared Service Request */
#define SRC_GTM_GTM0_PSM0_3 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038AACu)

/** Alias (User Manual Name) for SRC_GTM_GTM0_PSM0_3.
* To use register names with standard convension, please use SRC_GTM_GTM0_PSM0_3.
*/
#define	SRC_GTMPSM03	(SRC_GTM_GTM0_PSM0_3)

/** \brief  AB0, GTM PSM 0 Shared Service Request */
#define SRC_GTM_GTM0_PSM0_4 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038AB0u)

/** Alias (User Manual Name) for SRC_GTM_GTM0_PSM0_4.
* To use register names with standard convension, please use SRC_GTM_GTM0_PSM0_4.
*/
#define	SRC_GTMPSM04	(SRC_GTM_GTM0_PSM0_4)

/** \brief  AB4, GTM PSM 0 Shared Service Request */
#define SRC_GTM_GTM0_PSM0_5 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038AB4u)

/** Alias (User Manual Name) for SRC_GTM_GTM0_PSM0_5.
* To use register names with standard convension, please use SRC_GTM_GTM0_PSM0_5.
*/
#define	SRC_GTMPSM05	(SRC_GTM_GTM0_PSM0_5)

/** \brief  AB8, GTM PSM 0 Shared Service Request */
#define SRC_GTM_GTM0_PSM0_6 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038AB8u)

/** Alias (User Manual Name) for SRC_GTM_GTM0_PSM0_6.
* To use register names with standard convension, please use SRC_GTM_GTM0_PSM0_6.
*/
#define	SRC_GTMPSM06	(SRC_GTM_GTM0_PSM0_6)

/** \brief  ABC, GTM PSM 0 Shared Service Request */
#define SRC_GTM_GTM0_PSM0_7 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038ABCu)

/** Alias (User Manual Name) for SRC_GTM_GTM0_PSM0_7.
* To use register names with standard convension, please use SRC_GTM_GTM0_PSM0_7.
*/
#define	SRC_GTMPSM07	(SRC_GTM_GTM0_PSM0_7)

/** \brief  AC0, GTM PSM 0 Shared Service Request */
#define SRC_GTM_GTM0_PSM1_0 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038AC0u)

/** Alias (User Manual Name) for SRC_GTM_GTM0_PSM1_0.
* To use register names with standard convension, please use SRC_GTM_GTM0_PSM1_0.
*/
#define	SRC_GTMPSM10	(SRC_GTM_GTM0_PSM1_0)

/** \brief  AC4, GTM PSM 0 Shared Service Request */
#define SRC_GTM_GTM0_PSM1_1 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038AC4u)

/** Alias (User Manual Name) for SRC_GTM_GTM0_PSM1_1.
* To use register names with standard convension, please use SRC_GTM_GTM0_PSM1_1.
*/
#define	SRC_GTMPSM11	(SRC_GTM_GTM0_PSM1_1)

/** \brief  AC8, GTM PSM 0 Shared Service Request */
#define SRC_GTM_GTM0_PSM1_2 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038AC8u)

/** Alias (User Manual Name) for SRC_GTM_GTM0_PSM1_2.
* To use register names with standard convension, please use SRC_GTM_GTM0_PSM1_2.
*/
#define	SRC_GTMPSM12	(SRC_GTM_GTM0_PSM1_2)

/** \brief  ACC, GTM PSM 0 Shared Service Request */
#define SRC_GTM_GTM0_PSM1_3 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038ACCu)

/** Alias (User Manual Name) for SRC_GTM_GTM0_PSM1_3.
* To use register names with standard convension, please use SRC_GTM_GTM0_PSM1_3.
*/
#define	SRC_GTMPSM13	(SRC_GTM_GTM0_PSM1_3)

/** \brief  AD0, GTM PSM 0 Shared Service Request */
#define SRC_GTM_GTM0_PSM1_4 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038AD0u)

/** Alias (User Manual Name) for SRC_GTM_GTM0_PSM1_4.
* To use register names with standard convension, please use SRC_GTM_GTM0_PSM1_4.
*/
#define	SRC_GTMPSM14	(SRC_GTM_GTM0_PSM1_4)

/** \brief  AD4, GTM PSM 0 Shared Service Request */
#define SRC_GTM_GTM0_PSM1_5 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038AD4u)

/** Alias (User Manual Name) for SRC_GTM_GTM0_PSM1_5.
* To use register names with standard convension, please use SRC_GTM_GTM0_PSM1_5.
*/
#define	SRC_GTMPSM15	(SRC_GTM_GTM0_PSM1_5)

/** \brief  AD8, GTM PSM 0 Shared Service Request */
#define SRC_GTM_GTM0_PSM1_6 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038AD8u)

/** Alias (User Manual Name) for SRC_GTM_GTM0_PSM1_6.
* To use register names with standard convension, please use SRC_GTM_GTM0_PSM1_6.
*/
#define	SRC_GTMPSM16	(SRC_GTM_GTM0_PSM1_6)

/** \brief  ADC, GTM PSM 0 Shared Service Request */
#define SRC_GTM_GTM0_PSM1_7 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038ADCu)

/** Alias (User Manual Name) for SRC_GTM_GTM0_PSM1_7.
* To use register names with standard convension, please use SRC_GTM_GTM0_PSM1_7.
*/
#define	SRC_GTMPSM17	(SRC_GTM_GTM0_PSM1_7)

/** \brief  AE0, GTM PSM 0 Shared Service Request */
#define SRC_GTM_GTM0_PSM2_0 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038AE0u)

/** Alias (User Manual Name) for SRC_GTM_GTM0_PSM2_0.
* To use register names with standard convension, please use SRC_GTM_GTM0_PSM2_0.
*/
#define	SRC_GTMPSM20	(SRC_GTM_GTM0_PSM2_0)

/** \brief  AE4, GTM PSM 0 Shared Service Request */
#define SRC_GTM_GTM0_PSM2_1 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038AE4u)

