Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxSrc_reg.h
/** Alias (User Manual Name) for SRC_GTM_GTM0_PSM2_1.
* To use register names with standard convension, please use SRC_GTM_GTM0_PSM2_1.
*/
#define	SRC_GTMPSM21	(SRC_GTM_GTM0_PSM2_1)

/** \brief  AE8, GTM PSM 0 Shared Service Request */
#define SRC_GTM_GTM0_PSM2_2 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038AE8u)

/** Alias (User Manual Name) for SRC_GTM_GTM0_PSM2_2.
* To use register names with standard convension, please use SRC_GTM_GTM0_PSM2_2.
*/
#define	SRC_GTMPSM22	(SRC_GTM_GTM0_PSM2_2)

/** \brief  AEC, GTM PSM 0 Shared Service Request */
#define SRC_GTM_GTM0_PSM2_3 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038AECu)

/** Alias (User Manual Name) for SRC_GTM_GTM0_PSM2_3.
* To use register names with standard convension, please use SRC_GTM_GTM0_PSM2_3.
*/
#define	SRC_GTMPSM23	(SRC_GTM_GTM0_PSM2_3)

/** \brief  AF0, GTM PSM 0 Shared Service Request */
#define SRC_GTM_GTM0_PSM2_4 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038AF0u)

/** Alias (User Manual Name) for SRC_GTM_GTM0_PSM2_4.
* To use register names with standard convension, please use SRC_GTM_GTM0_PSM2_4.
*/
#define	SRC_GTMPSM24	(SRC_GTM_GTM0_PSM2_4)

/** \brief  AF4, GTM PSM 0 Shared Service Request */
#define SRC_GTM_GTM0_PSM2_5 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038AF4u)

/** Alias (User Manual Name) for SRC_GTM_GTM0_PSM2_5.
* To use register names with standard convension, please use SRC_GTM_GTM0_PSM2_5.
*/
#define	SRC_GTMPSM25	(SRC_GTM_GTM0_PSM2_5)

/** \brief  AF8, GTM PSM 0 Shared Service Request */
#define SRC_GTM_GTM0_PSM2_6 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038AF8u)

/** Alias (User Manual Name) for SRC_GTM_GTM0_PSM2_6.
* To use register names with standard convension, please use SRC_GTM_GTM0_PSM2_6.
*/
#define	SRC_GTMPSM26	(SRC_GTM_GTM0_PSM2_6)

/** \brief  AFC, GTM PSM 0 Shared Service Request */
#define SRC_GTM_GTM0_PSM2_7 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038AFCu)

/** Alias (User Manual Name) for SRC_GTM_GTM0_PSM2_7.
* To use register names with standard convension, please use SRC_GTM_GTM0_PSM2_7.
*/
#define	SRC_GTMPSM27	(SRC_GTM_GTM0_PSM2_7)

/** \brief  A88, GTM SPE Shared Service Request */
#define SRC_GTM_GTM0_SPEIRQ0 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038A88u)

/** Alias (User Manual Name) for SRC_GTM_GTM0_SPEIRQ0.
* To use register names with standard convension, please use SRC_GTM_GTM0_SPEIRQ0.
*/
#define	SRC_GTMSPE0IRQ	(SRC_GTM_GTM0_SPEIRQ0)

/** \brief  A8C, GTM SPE Shared Service Request */
#define SRC_GTM_GTM0_SPEIRQ1 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038A8Cu)

/** Alias (User Manual Name) for SRC_GTM_GTM0_SPEIRQ1.
* To use register names with standard convension, please use SRC_GTM_GTM0_SPEIRQ1.
*/
#define	SRC_GTMSPE1IRQ	(SRC_GTM_GTM0_SPEIRQ1)

/** \brief  A90, GTM SPE Shared Service Request */
#define SRC_GTM_GTM0_SPEIRQ2 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038A90u)

/** Alias (User Manual Name) for SRC_GTM_GTM0_SPEIRQ2.
* To use register names with standard convension, please use SRC_GTM_GTM0_SPEIRQ2.
*/
#define	SRC_GTMSPE2IRQ	(SRC_GTM_GTM0_SPEIRQ2)

/** \brief  A94, GTM SPE Shared Service Request */
#define SRC_GTM_GTM0_SPEIRQ3 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038A94u)

/** Alias (User Manual Name) for SRC_GTM_GTM0_SPEIRQ3.
* To use register names with standard convension, please use SRC_GTM_GTM0_SPEIRQ3.
*/
#define	SRC_GTMSPE3IRQ	(SRC_GTM_GTM0_SPEIRQ3)

/** \brief  A98, GTM SPE Shared Service Request */
#define SRC_GTM_GTM0_SPEIRQ4 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038A98u)

/** Alias (User Manual Name) for SRC_GTM_GTM0_SPEIRQ4.
* To use register names with standard convension, please use SRC_GTM_GTM0_SPEIRQ4.
*/
#define	SRC_GTMSPE4IRQ	(SRC_GTM_GTM0_SPEIRQ4)

/** \brief  A9C, GTM SPE Shared Service Request */
#define SRC_GTM_GTM0_SPEIRQ5 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038A9Cu)

/** Alias (User Manual Name) for SRC_GTM_GTM0_SPEIRQ5.
* To use register names with standard convension, please use SRC_GTM_GTM0_SPEIRQ5.
*/
#define	SRC_GTMSPE5IRQ	(SRC_GTM_GTM0_SPEIRQ5)

/** \brief  B90, GTM TIM 0 Shared Service Request */
#define SRC_GTM_GTM0_TIM0_0 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038B90u)

/** Alias (User Manual Name) for SRC_GTM_GTM0_TIM0_0.
* To use register names with standard convension, please use SRC_GTM_GTM0_TIM0_0.
*/
#define	SRC_GTMTIM00	(SRC_GTM_GTM0_TIM0_0)

/** \brief  B94, GTM TIM 0 Shared Service Request */
#define SRC_GTM_GTM0_TIM0_1 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038B94u)

/** Alias (User Manual Name) for SRC_GTM_GTM0_TIM0_1.
* To use register names with standard convension, please use SRC_GTM_GTM0_TIM0_1.
*/
#define	SRC_GTMTIM01	(SRC_GTM_GTM0_TIM0_1)

/** \brief  B98, GTM TIM 0 Shared Service Request */
#define SRC_GTM_GTM0_TIM0_2 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038B98u)

/** Alias (User Manual Name) for SRC_GTM_GTM0_TIM0_2.
* To use register names with standard convension, please use SRC_GTM_GTM0_TIM0_2.
*/
#define	SRC_GTMTIM02	(SRC_GTM_GTM0_TIM0_2)

/** \brief  B9C, GTM TIM 0 Shared Service Request */
#define SRC_GTM_GTM0_TIM0_3 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038B9Cu)

/** Alias (User Manual Name) for SRC_GTM_GTM0_TIM0_3.
* To use register names with standard convension, please use SRC_GTM_GTM0_TIM0_3.
*/
#define	SRC_GTMTIM03	(SRC_GTM_GTM0_TIM0_3)

/** \brief  BA0, GTM TIM 0 Shared Service Request */
#define SRC_GTM_GTM0_TIM0_4 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038BA0u)

/** Alias (User Manual Name) for SRC_GTM_GTM0_TIM0_4.
* To use register names with standard convension, please use SRC_GTM_GTM0_TIM0_4.
*/
#define	SRC_GTMTIM04	(SRC_GTM_GTM0_TIM0_4)

/** \brief  BA4, GTM TIM 0 Shared Service Request */
#define SRC_GTM_GTM0_TIM0_5 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038BA4u)

/** Alias (User Manual Name) for SRC_GTM_GTM0_TIM0_5.
* To use register names with standard convension, please use SRC_GTM_GTM0_TIM0_5.
*/
#define	SRC_GTMTIM05	(SRC_GTM_GTM0_TIM0_5)

/** \brief  BA8, GTM TIM 0 Shared Service Request */
#define SRC_GTM_GTM0_TIM0_6 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038BA8u)

/** Alias (User Manual Name) for SRC_GTM_GTM0_TIM0_6.
* To use register names with standard convension, please use SRC_GTM_GTM0_TIM0_6.
*/
#define	SRC_GTMTIM06	(SRC_GTM_GTM0_TIM0_6)

/** \brief  BAC, GTM TIM 0 Shared Service Request */
#define SRC_GTM_GTM0_TIM0_7 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038BACu)

/** Alias (User Manual Name) for SRC_GTM_GTM0_TIM0_7.
* To use register names with standard convension, please use SRC_GTM_GTM0_TIM0_7.
*/
#define	SRC_GTMTIM07	(SRC_GTM_GTM0_TIM0_7)

/** \brief  BB0, GTM TIM 0 Shared Service Request */
#define SRC_GTM_GTM0_TIM1_0 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038BB0u)

/** Alias (User Manual Name) for SRC_GTM_GTM0_TIM1_0.
* To use register names with standard convension, please use SRC_GTM_GTM0_TIM1_0.
*/
#define	SRC_GTMTIM10	(SRC_GTM_GTM0_TIM1_0)

