Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxSrc_reg.h
/** \brief  C00, GTM TIM 0 Shared Service Request */
#define SRC_GTM_GTM0_TIM3_4 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038C00u)

/** Alias (User Manual Name) for SRC_GTM_GTM0_TIM3_4.
* To use register names with standard convension, please use SRC_GTM_GTM0_TIM3_4.
*/
#define	SRC_GTMTIM34	(SRC_GTM_GTM0_TIM3_4)

/** \brief  C04, GTM TIM 0 Shared Service Request */
#define SRC_GTM_GTM0_TIM3_5 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038C04u)

/** Alias (User Manual Name) for SRC_GTM_GTM0_TIM3_5.
* To use register names with standard convension, please use SRC_GTM_GTM0_TIM3_5.
*/
#define	SRC_GTMTIM35	(SRC_GTM_GTM0_TIM3_5)

/** \brief  C08, GTM TIM 0 Shared Service Request */
#define SRC_GTM_GTM0_TIM3_6 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038C08u)

/** Alias (User Manual Name) for SRC_GTM_GTM0_TIM3_6.
* To use register names with standard convension, please use SRC_GTM_GTM0_TIM3_6.
*/
#define	SRC_GTMTIM36	(SRC_GTM_GTM0_TIM3_6)

/** \brief  C0C, GTM TIM 0 Shared Service Request */
#define SRC_GTM_GTM0_TIM3_7 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038C0Cu)

/** Alias (User Manual Name) for SRC_GTM_GTM0_TIM3_7.
* To use register names with standard convension, please use SRC_GTM_GTM0_TIM3_7.
*/
#define	SRC_GTMTIM37	(SRC_GTM_GTM0_TIM3_7)

/** \brief  C10, GTM TIM 0 Shared Service Request */
#define SRC_GTM_GTM0_TIM4_0 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038C10u)

/** Alias (User Manual Name) for SRC_GTM_GTM0_TIM4_0.
* To use register names with standard convension, please use SRC_GTM_GTM0_TIM4_0.
*/
#define	SRC_GTMTIM40	(SRC_GTM_GTM0_TIM4_0)

/** \brief  C14, GTM TIM 0 Shared Service Request */
#define SRC_GTM_GTM0_TIM4_1 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038C14u)

/** Alias (User Manual Name) for SRC_GTM_GTM0_TIM4_1.
* To use register names with standard convension, please use SRC_GTM_GTM0_TIM4_1.
*/
#define	SRC_GTMTIM41	(SRC_GTM_GTM0_TIM4_1)

/** \brief  C18, GTM TIM 0 Shared Service Request */
#define SRC_GTM_GTM0_TIM4_2 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038C18u)

/** Alias (User Manual Name) for SRC_GTM_GTM0_TIM4_2.
* To use register names with standard convension, please use SRC_GTM_GTM0_TIM4_2.
*/
#define	SRC_GTMTIM42	(SRC_GTM_GTM0_TIM4_2)

/** \brief  C1C, GTM TIM 0 Shared Service Request */
#define SRC_GTM_GTM0_TIM4_3 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038C1Cu)

/** Alias (User Manual Name) for SRC_GTM_GTM0_TIM4_3.
* To use register names with standard convension, please use SRC_GTM_GTM0_TIM4_3.
*/
#define	SRC_GTMTIM43	(SRC_GTM_GTM0_TIM4_3)

/** \brief  C20, GTM TIM 0 Shared Service Request */
#define SRC_GTM_GTM0_TIM4_4 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038C20u)

/** Alias (User Manual Name) for SRC_GTM_GTM0_TIM4_4.
* To use register names with standard convension, please use SRC_GTM_GTM0_TIM4_4.
*/
#define	SRC_GTMTIM44	(SRC_GTM_GTM0_TIM4_4)

/** \brief  C24, GTM TIM 0 Shared Service Request */
#define SRC_GTM_GTM0_TIM4_5 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038C24u)

/** Alias (User Manual Name) for SRC_GTM_GTM0_TIM4_5.
* To use register names with standard convension, please use SRC_GTM_GTM0_TIM4_5.
*/
#define	SRC_GTMTIM45	(SRC_GTM_GTM0_TIM4_5)

/** \brief  C28, GTM TIM 0 Shared Service Request */
#define SRC_GTM_GTM0_TIM4_6 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038C28u)

/** Alias (User Manual Name) for SRC_GTM_GTM0_TIM4_6.
* To use register names with standard convension, please use SRC_GTM_GTM0_TIM4_6.
*/
#define	SRC_GTMTIM46	(SRC_GTM_GTM0_TIM4_6)

/** \brief  C2C, GTM TIM 0 Shared Service Request */
#define SRC_GTM_GTM0_TIM4_7 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038C2Cu)

/** Alias (User Manual Name) for SRC_GTM_GTM0_TIM4_7.
* To use register names with standard convension, please use SRC_GTM_GTM0_TIM4_7.
*/
#define	SRC_GTMTIM47	(SRC_GTM_GTM0_TIM4_7)

/** \brief  C30, GTM TIM 0 Shared Service Request */
#define SRC_GTM_GTM0_TIM5_0 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038C30u)

/** Alias (User Manual Name) for SRC_GTM_GTM0_TIM5_0.
* To use register names with standard convension, please use SRC_GTM_GTM0_TIM5_0.
*/
#define	SRC_GTMTIM50	(SRC_GTM_GTM0_TIM5_0)

/** \brief  C34, GTM TIM 0 Shared Service Request */
#define SRC_GTM_GTM0_TIM5_1 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038C34u)

/** Alias (User Manual Name) for SRC_GTM_GTM0_TIM5_1.
* To use register names with standard convension, please use SRC_GTM_GTM0_TIM5_1.
*/
#define	SRC_GTMTIM51	(SRC_GTM_GTM0_TIM5_1)

/** \brief  C38, GTM TIM 0 Shared Service Request */
#define SRC_GTM_GTM0_TIM5_2 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038C38u)

/** Alias (User Manual Name) for SRC_GTM_GTM0_TIM5_2.
* To use register names with standard convension, please use SRC_GTM_GTM0_TIM5_2.
*/
#define	SRC_GTMTIM52	(SRC_GTM_GTM0_TIM5_2)

/** \brief  C3C, GTM TIM 0 Shared Service Request */
#define SRC_GTM_GTM0_TIM5_3 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038C3Cu)

/** Alias (User Manual Name) for SRC_GTM_GTM0_TIM5_3.
* To use register names with standard convension, please use SRC_GTM_GTM0_TIM5_3.
*/
#define	SRC_GTMTIM53	(SRC_GTM_GTM0_TIM5_3)

/** \brief  C40, GTM TIM 0 Shared Service Request */
#define SRC_GTM_GTM0_TIM5_4 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038C40u)

/** Alias (User Manual Name) for SRC_GTM_GTM0_TIM5_4.
* To use register names with standard convension, please use SRC_GTM_GTM0_TIM5_4.
*/
#define	SRC_GTMTIM54	(SRC_GTM_GTM0_TIM5_4)

/** \brief  C44, GTM TIM 0 Shared Service Request */
#define SRC_GTM_GTM0_TIM5_5 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038C44u)

/** Alias (User Manual Name) for SRC_GTM_GTM0_TIM5_5.
* To use register names with standard convension, please use SRC_GTM_GTM0_TIM5_5.
*/
#define	SRC_GTMTIM55	(SRC_GTM_GTM0_TIM5_5)

/** \brief  C48, GTM TIM 0 Shared Service Request */
#define SRC_GTM_GTM0_TIM5_6 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038C48u)

/** Alias (User Manual Name) for SRC_GTM_GTM0_TIM5_6.
* To use register names with standard convension, please use SRC_GTM_GTM0_TIM5_6.
*/
#define	SRC_GTMTIM56	(SRC_GTM_GTM0_TIM5_6)

/** \brief  C4C, GTM TIM 0 Shared Service Request */
#define SRC_GTM_GTM0_TIM5_7 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038C4Cu)

/** Alias (User Manual Name) for SRC_GTM_GTM0_TIM5_7.
* To use register names with standard convension, please use SRC_GTM_GTM0_TIM5_7.
*/
#define	SRC_GTMTIM57	(SRC_GTM_GTM0_TIM5_7)

