Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxSrc_reg.h
/** \brief  C50, GTM TIM 0 Shared Service Request */
#define SRC_GTM_GTM0_TIM6_0 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038C50u)

/** Alias (User Manual Name) for SRC_GTM_GTM0_TIM6_0.
* To use register names with standard convension, please use SRC_GTM_GTM0_TIM6_0.
*/
#define	SRC_GTMTIM60	(SRC_GTM_GTM0_TIM6_0)

/** \brief  C54, GTM TIM 0 Shared Service Request */
#define SRC_GTM_GTM0_TIM6_1 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038C54u)

/** Alias (User Manual Name) for SRC_GTM_GTM0_TIM6_1.
* To use register names with standard convension, please use SRC_GTM_GTM0_TIM6_1.
*/
#define	SRC_GTMTIM61	(SRC_GTM_GTM0_TIM6_1)

/** \brief  C58, GTM TIM 0 Shared Service Request */
#define SRC_GTM_GTM0_TIM6_2 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038C58u)

/** Alias (User Manual Name) for SRC_GTM_GTM0_TIM6_2.
* To use register names with standard convension, please use SRC_GTM_GTM0_TIM6_2.
*/
#define	SRC_GTMTIM62	(SRC_GTM_GTM0_TIM6_2)

/** \brief  C5C, GTM TIM 0 Shared Service Request */
#define SRC_GTM_GTM0_TIM6_3 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038C5Cu)

/** Alias (User Manual Name) for SRC_GTM_GTM0_TIM6_3.
* To use register names with standard convension, please use SRC_GTM_GTM0_TIM6_3.
*/
#define	SRC_GTMTIM63	(SRC_GTM_GTM0_TIM6_3)

/** \brief  C60, GTM TIM 0 Shared Service Request */
#define SRC_GTM_GTM0_TIM6_4 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038C60u)

/** Alias (User Manual Name) for SRC_GTM_GTM0_TIM6_4.
* To use register names with standard convension, please use SRC_GTM_GTM0_TIM6_4.
*/
#define	SRC_GTMTIM64	(SRC_GTM_GTM0_TIM6_4)

/** \brief  C64, GTM TIM 0 Shared Service Request */
#define SRC_GTM_GTM0_TIM6_5 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038C64u)

/** Alias (User Manual Name) for SRC_GTM_GTM0_TIM6_5.
* To use register names with standard convension, please use SRC_GTM_GTM0_TIM6_5.
*/
#define	SRC_GTMTIM65	(SRC_GTM_GTM0_TIM6_5)

/** \brief  C68, GTM TIM 0 Shared Service Request */
#define SRC_GTM_GTM0_TIM6_6 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038C68u)

/** Alias (User Manual Name) for SRC_GTM_GTM0_TIM6_6.
* To use register names with standard convension, please use SRC_GTM_GTM0_TIM6_6.
*/
#define	SRC_GTMTIM66	(SRC_GTM_GTM0_TIM6_6)

/** \brief  C6C, GTM TIM 0 Shared Service Request */
#define SRC_GTM_GTM0_TIM6_7 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038C6Cu)

/** Alias (User Manual Name) for SRC_GTM_GTM0_TIM6_7.
* To use register names with standard convension, please use SRC_GTM_GTM0_TIM6_7.
*/
#define	SRC_GTMTIM67	(SRC_GTM_GTM0_TIM6_7)

/** \brief  C70, GTM TIM 0 Shared Service Request */
#define SRC_GTM_GTM0_TIM7_0 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038C70u)

/** Alias (User Manual Name) for SRC_GTM_GTM0_TIM7_0.
* To use register names with standard convension, please use SRC_GTM_GTM0_TIM7_0.
*/
#define	SRC_GTMTIM70	(SRC_GTM_GTM0_TIM7_0)

/** \brief  C74, GTM TIM 0 Shared Service Request */
#define SRC_GTM_GTM0_TIM7_1 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038C74u)

/** Alias (User Manual Name) for SRC_GTM_GTM0_TIM7_1.
* To use register names with standard convension, please use SRC_GTM_GTM0_TIM7_1.
*/
#define	SRC_GTMTIM71	(SRC_GTM_GTM0_TIM7_1)

/** \brief  C78, GTM TIM 0 Shared Service Request */
#define SRC_GTM_GTM0_TIM7_2 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038C78u)

/** Alias (User Manual Name) for SRC_GTM_GTM0_TIM7_2.
* To use register names with standard convension, please use SRC_GTM_GTM0_TIM7_2.
*/
#define	SRC_GTMTIM72	(SRC_GTM_GTM0_TIM7_2)

/** \brief  C7C, GTM TIM 0 Shared Service Request */
#define SRC_GTM_GTM0_TIM7_3 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038C7Cu)

/** Alias (User Manual Name) for SRC_GTM_GTM0_TIM7_3.
* To use register names with standard convension, please use SRC_GTM_GTM0_TIM7_3.
*/
#define	SRC_GTMTIM73	(SRC_GTM_GTM0_TIM7_3)

/** \brief  C80, GTM TIM 0 Shared Service Request */
#define SRC_GTM_GTM0_TIM7_4 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038C80u)

/** Alias (User Manual Name) for SRC_GTM_GTM0_TIM7_4.
* To use register names with standard convension, please use SRC_GTM_GTM0_TIM7_4.
*/
#define	SRC_GTMTIM74	(SRC_GTM_GTM0_TIM7_4)

/** \brief  C84, GTM TIM 0 Shared Service Request */
#define SRC_GTM_GTM0_TIM7_5 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038C84u)

/** Alias (User Manual Name) for SRC_GTM_GTM0_TIM7_5.
* To use register names with standard convension, please use SRC_GTM_GTM0_TIM7_5.
*/
#define	SRC_GTMTIM75	(SRC_GTM_GTM0_TIM7_5)

/** \brief  C88, GTM TIM 0 Shared Service Request */
#define SRC_GTM_GTM0_TIM7_6 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038C88u)

/** Alias (User Manual Name) for SRC_GTM_GTM0_TIM7_6.
* To use register names with standard convension, please use SRC_GTM_GTM0_TIM7_6.
*/
#define	SRC_GTMTIM76	(SRC_GTM_GTM0_TIM7_6)

/** \brief  C8C, GTM TIM 0 Shared Service Request */
#define SRC_GTM_GTM0_TIM7_7 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038C8Cu)

/** Alias (User Manual Name) for SRC_GTM_GTM0_TIM7_7.
* To use register names with standard convension, please use SRC_GTM_GTM0_TIM7_7.
*/
#define	SRC_GTMTIM77	(SRC_GTM_GTM0_TIM7_7)

/** \brief  E10, GTM TOM 0 Shared Service Request */
#define SRC_GTM_GTM0_TOM0_0 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038E10u)

/** Alias (User Manual Name) for SRC_GTM_GTM0_TOM0_0.
* To use register names with standard convension, please use SRC_GTM_GTM0_TOM0_0.
*/
#define	SRC_GTMTOM00	(SRC_GTM_GTM0_TOM0_0)

/** \brief  E14, GTM TOM 0 Shared Service Request */
#define SRC_GTM_GTM0_TOM0_1 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038E14u)

/** Alias (User Manual Name) for SRC_GTM_GTM0_TOM0_1.
* To use register names with standard convension, please use SRC_GTM_GTM0_TOM0_1.
*/
#define	SRC_GTMTOM01	(SRC_GTM_GTM0_TOM0_1)

/** \brief  E18, GTM TOM 0 Shared Service Request */
#define SRC_GTM_GTM0_TOM0_2 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038E18u)

/** Alias (User Manual Name) for SRC_GTM_GTM0_TOM0_2.
* To use register names with standard convension, please use SRC_GTM_GTM0_TOM0_2.
*/
#define	SRC_GTMTOM02	(SRC_GTM_GTM0_TOM0_2)

/** \brief  E1C, GTM TOM 0 Shared Service Request */
#define SRC_GTM_GTM0_TOM0_3 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038E1Cu)

/** Alias (User Manual Name) for SRC_GTM_GTM0_TOM0_3.
* To use register names with standard convension, please use SRC_GTM_GTM0_TOM0_3.
*/
#define	SRC_GTMTOM03	(SRC_GTM_GTM0_TOM0_3)

/** \brief  E20, GTM TOM 0 Shared Service Request */
#define SRC_GTM_GTM0_TOM0_4 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038E20u)

/** Alias (User Manual Name) for SRC_GTM_GTM0_TOM0_4.
* To use register names with standard convension, please use SRC_GTM_GTM0_TOM0_4.
*/
#define	SRC_GTMTOM04	(SRC_GTM_GTM0_TOM0_4)

/** \brief  E24, GTM TOM 0 Shared Service Request */
#define SRC_GTM_GTM0_TOM0_5 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038E24u)

