Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxSrc_reg.h
/** \brief  E78, GTM TOM 0 Shared Service Request */
#define SRC_GTM_GTM0_TOM3_2 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038E78u)

/** Alias (User Manual Name) for SRC_GTM_GTM0_TOM3_2.
* To use register names with standard convension, please use SRC_GTM_GTM0_TOM3_2.
*/
#define	SRC_GTMTOM32	(SRC_GTM_GTM0_TOM3_2)

/** \brief  E7C, GTM TOM 0 Shared Service Request */
#define SRC_GTM_GTM0_TOM3_3 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038E7Cu)

/** Alias (User Manual Name) for SRC_GTM_GTM0_TOM3_3.
* To use register names with standard convension, please use SRC_GTM_GTM0_TOM3_3.
*/
#define	SRC_GTMTOM33	(SRC_GTM_GTM0_TOM3_3)

/** \brief  E80, GTM TOM 0 Shared Service Request */
#define SRC_GTM_GTM0_TOM3_4 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038E80u)

/** Alias (User Manual Name) for SRC_GTM_GTM0_TOM3_4.
* To use register names with standard convension, please use SRC_GTM_GTM0_TOM3_4.
*/
#define	SRC_GTMTOM34	(SRC_GTM_GTM0_TOM3_4)

/** \brief  E84, GTM TOM 0 Shared Service Request */
#define SRC_GTM_GTM0_TOM3_5 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038E84u)

/** Alias (User Manual Name) for SRC_GTM_GTM0_TOM3_5.
* To use register names with standard convension, please use SRC_GTM_GTM0_TOM3_5.
*/
#define	SRC_GTMTOM35	(SRC_GTM_GTM0_TOM3_5)

/** \brief  E88, GTM TOM 0 Shared Service Request */
#define SRC_GTM_GTM0_TOM3_6 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038E88u)

/** Alias (User Manual Name) for SRC_GTM_GTM0_TOM3_6.
* To use register names with standard convension, please use SRC_GTM_GTM0_TOM3_6.
*/
#define	SRC_GTMTOM36	(SRC_GTM_GTM0_TOM3_6)

/** \brief  E8C, GTM TOM 0 Shared Service Request */
#define SRC_GTM_GTM0_TOM3_7 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038E8Cu)

/** Alias (User Manual Name) for SRC_GTM_GTM0_TOM3_7.
* To use register names with standard convension, please use SRC_GTM_GTM0_TOM3_7.
*/
#define	SRC_GTMTOM37	(SRC_GTM_GTM0_TOM3_7)

/** \brief  E90, GTM TOM 0 Shared Service Request */
#define SRC_GTM_GTM0_TOM4_0 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038E90u)

/** Alias (User Manual Name) for SRC_GTM_GTM0_TOM4_0.
* To use register names with standard convension, please use SRC_GTM_GTM0_TOM4_0.
*/
#define	SRC_GTMTOM40	(SRC_GTM_GTM0_TOM4_0)

/** \brief  E94, GTM TOM 0 Shared Service Request */
#define SRC_GTM_GTM0_TOM4_1 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038E94u)

/** Alias (User Manual Name) for SRC_GTM_GTM0_TOM4_1.
* To use register names with standard convension, please use SRC_GTM_GTM0_TOM4_1.
*/
#define	SRC_GTMTOM41	(SRC_GTM_GTM0_TOM4_1)

/** \brief  E98, GTM TOM 0 Shared Service Request */
#define SRC_GTM_GTM0_TOM4_2 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038E98u)

/** Alias (User Manual Name) for SRC_GTM_GTM0_TOM4_2.
* To use register names with standard convension, please use SRC_GTM_GTM0_TOM4_2.
*/
#define	SRC_GTMTOM42	(SRC_GTM_GTM0_TOM4_2)

/** \brief  E9C, GTM TOM 0 Shared Service Request */
#define SRC_GTM_GTM0_TOM4_3 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038E9Cu)

/** Alias (User Manual Name) for SRC_GTM_GTM0_TOM4_3.
* To use register names with standard convension, please use SRC_GTM_GTM0_TOM4_3.
*/
#define	SRC_GTMTOM43	(SRC_GTM_GTM0_TOM4_3)

/** \brief  EA0, GTM TOM 0 Shared Service Request */
#define SRC_GTM_GTM0_TOM4_4 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038EA0u)

/** Alias (User Manual Name) for SRC_GTM_GTM0_TOM4_4.
* To use register names with standard convension, please use SRC_GTM_GTM0_TOM4_4.
*/
#define	SRC_GTMTOM44	(SRC_GTM_GTM0_TOM4_4)

/** \brief  EA4, GTM TOM 0 Shared Service Request */
#define SRC_GTM_GTM0_TOM4_5 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038EA4u)

/** Alias (User Manual Name) for SRC_GTM_GTM0_TOM4_5.
* To use register names with standard convension, please use SRC_GTM_GTM0_TOM4_5.
*/
#define	SRC_GTMTOM45	(SRC_GTM_GTM0_TOM4_5)

/** \brief  EA8, GTM TOM 0 Shared Service Request */
#define SRC_GTM_GTM0_TOM4_6 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038EA8u)

/** Alias (User Manual Name) for SRC_GTM_GTM0_TOM4_6.
* To use register names with standard convension, please use SRC_GTM_GTM0_TOM4_6.
*/
#define	SRC_GTMTOM46	(SRC_GTM_GTM0_TOM4_6)

/** \brief  EAC, GTM TOM 0 Shared Service Request */
#define SRC_GTM_GTM0_TOM4_7 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038EACu)

/** Alias (User Manual Name) for SRC_GTM_GTM0_TOM4_7.
* To use register names with standard convension, please use SRC_GTM_GTM0_TOM4_7.
*/
#define	SRC_GTMTOM47	(SRC_GTM_GTM0_TOM4_7)

/** \brief  EB0, GTM TOM 0 Shared Service Request */
#define SRC_GTM_GTM0_TOM5_0 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038EB0u)

/** Alias (User Manual Name) for SRC_GTM_GTM0_TOM5_0.
* To use register names with standard convension, please use SRC_GTM_GTM0_TOM5_0.
*/
#define	SRC_GTMTOM50	(SRC_GTM_GTM0_TOM5_0)

/** \brief  EB4, GTM TOM 0 Shared Service Request */
#define SRC_GTM_GTM0_TOM5_1 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038EB4u)

/** Alias (User Manual Name) for SRC_GTM_GTM0_TOM5_1.
* To use register names with standard convension, please use SRC_GTM_GTM0_TOM5_1.
*/
#define	SRC_GTMTOM51	(SRC_GTM_GTM0_TOM5_1)

/** \brief  EB8, GTM TOM 0 Shared Service Request */
#define SRC_GTM_GTM0_TOM5_2 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038EB8u)

/** Alias (User Manual Name) for SRC_GTM_GTM0_TOM5_2.
* To use register names with standard convension, please use SRC_GTM_GTM0_TOM5_2.
*/
#define	SRC_GTMTOM52	(SRC_GTM_GTM0_TOM5_2)

/** \brief  EBC, GTM TOM 0 Shared Service Request */
#define SRC_GTM_GTM0_TOM5_3 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038EBCu)

/** Alias (User Manual Name) for SRC_GTM_GTM0_TOM5_3.
* To use register names with standard convension, please use SRC_GTM_GTM0_TOM5_3.
*/
#define	SRC_GTMTOM53	(SRC_GTM_GTM0_TOM5_3)

/** \brief  EC0, GTM TOM 0 Shared Service Request */
#define SRC_GTM_GTM0_TOM5_4 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038EC0u)

/** Alias (User Manual Name) for SRC_GTM_GTM0_TOM5_4.
* To use register names with standard convension, please use SRC_GTM_GTM0_TOM5_4.
*/
#define	SRC_GTMTOM54	(SRC_GTM_GTM0_TOM5_4)

/** \brief  EC4, GTM TOM 0 Shared Service Request */
#define SRC_GTM_GTM0_TOM5_5 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038EC4u)

/** Alias (User Manual Name) for SRC_GTM_GTM0_TOM5_5.
* To use register names with standard convension, please use SRC_GTM_GTM0_TOM5_5.
*/
#define	SRC_GTMTOM55	(SRC_GTM_GTM0_TOM5_5)

/** \brief  EC8, GTM TOM 0 Shared Service Request */
#define SRC_GTM_GTM0_TOM5_6 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038EC8u)

/** Alias (User Manual Name) for SRC_GTM_GTM0_TOM5_6.
* To use register names with standard convension, please use SRC_GTM_GTM0_TOM5_6.
*/
#define	SRC_GTMTOM56	(SRC_GTM_GTM0_TOM5_6)

/** \brief  ECC, GTM TOM 0 Shared Service Request */
#define SRC_GTM_GTM0_TOM5_7 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038ECCu)

