Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxSrc_reg.h
/** Alias (User Manual Name) for SRC_GTM_GTM0_TOM5_7.
* To use register names with standard convension, please use SRC_GTM_GTM0_TOM5_7.
*/
#define	SRC_GTMTOM57	(SRC_GTM_GTM0_TOM5_7)

/** \brief  160, HSCT Service Request */
#define SRC_HSCT_HSCT0_SR /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038160u)

/** Alias (User Manual Name) for SRC_HSCT_HSCT0_SR.
* To use register names with standard convension, please use SRC_HSCT_HSCT0_SR.
*/
#define	SRC_HSCT0	(SRC_HSCT_HSCT0_SR)

/** \brief  164, HSCT Service Request */
#define SRC_HSCT_HSCT1_SR /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038164u)

/** Alias (User Manual Name) for SRC_HSCT_HSCT1_SR.
* To use register names with standard convension, please use SRC_HSCT_HSCT1_SR.
*/
#define	SRC_HSCT1	(SRC_HSCT_HSCT1_SR)

/** \brief  870, HSM Service Request */
#define SRC_HSM_HSM0_HSM0 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038870u)

/** Alias (User Manual Name) for SRC_HSM_HSM0_HSM0.
* To use register names with standard convension, please use SRC_HSM_HSM0_HSM0.
*/
#define	SRC_HSM0	(SRC_HSM_HSM0_HSM0)

/** \brief  874, HSM Service Request */
#define SRC_HSM_HSM0_HSM1 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038874u)

/** Alias (User Manual Name) for SRC_HSM_HSM0_HSM1.
* To use register names with standard convension, please use SRC_HSM_HSM0_HSM1.
*/
#define	SRC_HSM1	(SRC_HSM_HSM0_HSM1)

/** \brief  170, Channel OK Service Request m */
#define SRC_HSSL_HSSL0_CH0_COK /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038170u)

/** Alias (User Manual Name) for SRC_HSSL_HSSL0_CH0_COK.
* To use register names with standard convension, please use SRC_HSSL_HSSL0_CH0_COK.
*/
#define	SRC_HSSL0COK0	(SRC_HSSL_HSSL0_CH0_COK)

/** \brief  178, Channel Error ServiceRequest m */
#define SRC_HSSL_HSSL0_CH0_ERR /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038178u)

/** Alias (User Manual Name) for SRC_HSSL_HSSL0_CH0_ERR.
* To use register names with standard convension, please use SRC_HSSL_HSSL0_CH0_ERR.
*/
#define	SRC_HSSL0ERR0	(SRC_HSSL_HSSL0_CH0_ERR)

/** \brief  174, Channel Read Data Service Request m */
#define SRC_HSSL_HSSL0_CH0_RDI /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038174u)

/** Alias (User Manual Name) for SRC_HSSL_HSSL0_CH0_RDI.
* To use register names with standard convension, please use SRC_HSSL_HSSL0_CH0_RDI.
*/
#define	SRC_HSSL0RDI0	(SRC_HSSL_HSSL0_CH0_RDI)

/** \brief  17C, Channel Trigger Service Request m */
#define SRC_HSSL_HSSL0_CH0_TRG /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF003817Cu)

/** Alias (User Manual Name) for SRC_HSSL_HSSL0_CH0_TRG.
* To use register names with standard convension, please use SRC_HSSL_HSSL0_CH0_TRG.
*/
#define	SRC_HSSL0TRG0	(SRC_HSSL_HSSL0_CH0_TRG)

/** \brief  180, Channel OK Service Request m */
#define SRC_HSSL_HSSL0_CH1_COK /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038180u)

/** Alias (User Manual Name) for SRC_HSSL_HSSL0_CH1_COK.
* To use register names with standard convension, please use SRC_HSSL_HSSL0_CH1_COK.
*/
#define	SRC_HSSL0COK1	(SRC_HSSL_HSSL0_CH1_COK)

/** \brief  188, Channel Error ServiceRequest m */
#define SRC_HSSL_HSSL0_CH1_ERR /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038188u)

/** Alias (User Manual Name) for SRC_HSSL_HSSL0_CH1_ERR.
* To use register names with standard convension, please use SRC_HSSL_HSSL0_CH1_ERR.
*/
#define	SRC_HSSL0ERR1	(SRC_HSSL_HSSL0_CH1_ERR)

/** \brief  184, Channel Read Data Service Request m */
#define SRC_HSSL_HSSL0_CH1_RDI /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038184u)

/** Alias (User Manual Name) for SRC_HSSL_HSSL0_CH1_RDI.
* To use register names with standard convension, please use SRC_HSSL_HSSL0_CH1_RDI.
*/
#define	SRC_HSSL0RDI1	(SRC_HSSL_HSSL0_CH1_RDI)

/** \brief  18C, Channel Trigger Service Request m */
#define SRC_HSSL_HSSL0_CH1_TRG /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF003818Cu)

/** Alias (User Manual Name) for SRC_HSSL_HSSL0_CH1_TRG.
* To use register names with standard convension, please use SRC_HSSL_HSSL0_CH1_TRG.
*/
#define	SRC_HSSL0TRG1	(SRC_HSSL_HSSL0_CH1_TRG)

/** \brief  190, Channel OK Service Request m */
#define SRC_HSSL_HSSL0_CH2_COK /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038190u)

/** Alias (User Manual Name) for SRC_HSSL_HSSL0_CH2_COK.
* To use register names with standard convension, please use SRC_HSSL_HSSL0_CH2_COK.
*/
#define	SRC_HSSL0COK2	(SRC_HSSL_HSSL0_CH2_COK)

/** \brief  198, Channel Error ServiceRequest m */
#define SRC_HSSL_HSSL0_CH2_ERR /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038198u)

/** Alias (User Manual Name) for SRC_HSSL_HSSL0_CH2_ERR.
* To use register names with standard convension, please use SRC_HSSL_HSSL0_CH2_ERR.
*/
#define	SRC_HSSL0ERR2	(SRC_HSSL_HSSL0_CH2_ERR)

/** \brief  194, Channel Read Data Service Request m */
#define SRC_HSSL_HSSL0_CH2_RDI /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038194u)

/** Alias (User Manual Name) for SRC_HSSL_HSSL0_CH2_RDI.
* To use register names with standard convension, please use SRC_HSSL_HSSL0_CH2_RDI.
*/
#define	SRC_HSSL0RDI2	(SRC_HSSL_HSSL0_CH2_RDI)

/** \brief  19C, Channel Trigger Service Request m */
#define SRC_HSSL_HSSL0_CH2_TRG /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF003819Cu)

/** Alias (User Manual Name) for SRC_HSSL_HSSL0_CH2_TRG.
* To use register names with standard convension, please use SRC_HSSL_HSSL0_CH2_TRG.
*/
#define	SRC_HSSL0TRG2	(SRC_HSSL_HSSL0_CH2_TRG)

/** \brief  1A0, Channel OK Service Request m */
#define SRC_HSSL_HSSL0_CH3_COK /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF00381A0u)

/** Alias (User Manual Name) for SRC_HSSL_HSSL0_CH3_COK.
* To use register names with standard convension, please use SRC_HSSL_HSSL0_CH3_COK.
*/
#define	SRC_HSSL0COK3	(SRC_HSSL_HSSL0_CH3_COK)

/** \brief  1A8, Channel Error ServiceRequest m */
#define SRC_HSSL_HSSL0_CH3_ERR /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF00381A8u)

/** Alias (User Manual Name) for SRC_HSSL_HSSL0_CH3_ERR.
* To use register names with standard convension, please use SRC_HSSL_HSSL0_CH3_ERR.
*/
#define	SRC_HSSL0ERR3	(SRC_HSSL_HSSL0_CH3_ERR)

/** \brief  1A4, Channel Read Data Service Request m */
#define SRC_HSSL_HSSL0_CH3_RDI /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF00381A4u)

/** Alias (User Manual Name) for SRC_HSSL_HSSL0_CH3_RDI.
* To use register names with standard convension, please use SRC_HSSL_HSSL0_CH3_RDI.
*/
#define	SRC_HSSL0RDI3	(SRC_HSSL_HSSL0_CH3_RDI)

/** \brief  1AC, Channel Trigger Service Request m */
#define SRC_HSSL_HSSL0_CH3_TRG /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF00381ACu)

/** Alias (User Manual Name) for SRC_HSSL_HSSL0_CH3_TRG.
* To use register names with standard convension, please use SRC_HSSL_HSSL0_CH3_TRG.
*/
#define	SRC_HSSL0TRG3	(SRC_HSSL_HSSL0_CH3_TRG)

/** \brief  1B0, Exception Service Request */
#define SRC_HSSL_HSSL0_EXI /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF00381B0u)

/** Alias (User Manual Name) for SRC_HSSL_HSSL0_EXI.
* To use register names with standard convension, please use SRC_HSSL_HSSL0_EXI.
*/
#define	SRC_HSSL0EXI	(SRC_HSSL_HSSL0_EXI)

/** \brief  1B4, Channel OK Service Request m */
#define SRC_HSSL_HSSL1_CH0_COK /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF00381B4u)

/** Alias (User Manual Name) for SRC_HSSL_HSSL1_CH0_COK.
* To use register names with standard convension, please use SRC_HSSL_HSSL1_CH0_COK.
*/
#define	SRC_HSSL1COK0	(SRC_HSSL_HSSL1_CH0_COK)

/** \brief  1BC, Channel Error ServiceRequest m */
#define SRC_HSSL_HSSL1_CH0_ERR /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF00381BCu)

/** Alias (User Manual Name) for SRC_HSSL_HSSL1_CH0_ERR.
* To use register names with standard convension, please use SRC_HSSL_HSSL1_CH0_ERR.
*/
#define	SRC_HSSL1ERR0	(SRC_HSSL_HSSL1_CH0_ERR)

/** \brief  1B8, Channel Read Data Service Request m */
#define SRC_HSSL_HSSL1_CH0_RDI /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF00381B8u)

/** Alias (User Manual Name) for SRC_HSSL_HSSL1_CH0_RDI.
* To use register names with standard convension, please use SRC_HSSL_HSSL1_CH0_RDI.
*/
#define	SRC_HSSL1RDI0	(SRC_HSSL_HSSL1_CH0_RDI)

