Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxSrc_reg.h
/** \brief  1C0, Channel Trigger Service Request m */
#define SRC_HSSL_HSSL1_CH0_TRG /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF00381C0u)

/** Alias (User Manual Name) for SRC_HSSL_HSSL1_CH0_TRG.
* To use register names with standard convension, please use SRC_HSSL_HSSL1_CH0_TRG.
*/
#define	SRC_HSSL1TRG0	(SRC_HSSL_HSSL1_CH0_TRG)

/** \brief  1C4, Channel OK Service Request m */
#define SRC_HSSL_HSSL1_CH1_COK /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF00381C4u)

/** Alias (User Manual Name) for SRC_HSSL_HSSL1_CH1_COK.
* To use register names with standard convension, please use SRC_HSSL_HSSL1_CH1_COK.
*/
#define	SRC_HSSL1COK1	(SRC_HSSL_HSSL1_CH1_COK)

/** \brief  1CC, Channel Error ServiceRequest m */
#define SRC_HSSL_HSSL1_CH1_ERR /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF00381CCu)

/** Alias (User Manual Name) for SRC_HSSL_HSSL1_CH1_ERR.
* To use register names with standard convension, please use SRC_HSSL_HSSL1_CH1_ERR.
*/
#define	SRC_HSSL1ERR1	(SRC_HSSL_HSSL1_CH1_ERR)

/** \brief  1C8, Channel Read Data Service Request m */
#define SRC_HSSL_HSSL1_CH1_RDI /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF00381C8u)

/** Alias (User Manual Name) for SRC_HSSL_HSSL1_CH1_RDI.
* To use register names with standard convension, please use SRC_HSSL_HSSL1_CH1_RDI.
*/
#define	SRC_HSSL1RDI1	(SRC_HSSL_HSSL1_CH1_RDI)

/** \brief  1D0, Channel Trigger Service Request m */
#define SRC_HSSL_HSSL1_CH1_TRG /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF00381D0u)

/** Alias (User Manual Name) for SRC_HSSL_HSSL1_CH1_TRG.
* To use register names with standard convension, please use SRC_HSSL_HSSL1_CH1_TRG.
*/
#define	SRC_HSSL1TRG1	(SRC_HSSL_HSSL1_CH1_TRG)

/** \brief  1D4, Channel OK Service Request m */
#define SRC_HSSL_HSSL1_CH2_COK /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF00381D4u)

/** Alias (User Manual Name) for SRC_HSSL_HSSL1_CH2_COK.
* To use register names with standard convension, please use SRC_HSSL_HSSL1_CH2_COK.
*/
#define	SRC_HSSL1COK2	(SRC_HSSL_HSSL1_CH2_COK)

/** \brief  1DC, Channel Error ServiceRequest m */
#define SRC_HSSL_HSSL1_CH2_ERR /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF00381DCu)

/** Alias (User Manual Name) for SRC_HSSL_HSSL1_CH2_ERR.
* To use register names with standard convension, please use SRC_HSSL_HSSL1_CH2_ERR.
*/
#define	SRC_HSSL1ERR2	(SRC_HSSL_HSSL1_CH2_ERR)

/** \brief  1D8, Channel Read Data Service Request m */
#define SRC_HSSL_HSSL1_CH2_RDI /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF00381D8u)

/** Alias (User Manual Name) for SRC_HSSL_HSSL1_CH2_RDI.
* To use register names with standard convension, please use SRC_HSSL_HSSL1_CH2_RDI.
*/
#define	SRC_HSSL1RDI2	(SRC_HSSL_HSSL1_CH2_RDI)

/** \brief  1E0, Channel Trigger Service Request m */
#define SRC_HSSL_HSSL1_CH2_TRG /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF00381E0u)

/** Alias (User Manual Name) for SRC_HSSL_HSSL1_CH2_TRG.
* To use register names with standard convension, please use SRC_HSSL_HSSL1_CH2_TRG.
*/
#define	SRC_HSSL1TRG2	(SRC_HSSL_HSSL1_CH2_TRG)

/** \brief  1E4, Channel OK Service Request m */
#define SRC_HSSL_HSSL1_CH3_COK /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF00381E4u)

/** Alias (User Manual Name) for SRC_HSSL_HSSL1_CH3_COK.
* To use register names with standard convension, please use SRC_HSSL_HSSL1_CH3_COK.
*/
#define	SRC_HSSL1COK3	(SRC_HSSL_HSSL1_CH3_COK)

/** \brief  1EC, Channel Error ServiceRequest m */
#define SRC_HSSL_HSSL1_CH3_ERR /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF00381ECu)

/** Alias (User Manual Name) for SRC_HSSL_HSSL1_CH3_ERR.
* To use register names with standard convension, please use SRC_HSSL_HSSL1_CH3_ERR.
*/
#define	SRC_HSSL1ERR3	(SRC_HSSL_HSSL1_CH3_ERR)

/** \brief  1E8, Channel Read Data Service Request m */
#define SRC_HSSL_HSSL1_CH3_RDI /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF00381E8u)

/** Alias (User Manual Name) for SRC_HSSL_HSSL1_CH3_RDI.
* To use register names with standard convension, please use SRC_HSSL_HSSL1_CH3_RDI.
*/
#define	SRC_HSSL1RDI3	(SRC_HSSL_HSSL1_CH3_RDI)

/** \brief  1F0, Channel Trigger Service Request m */
#define SRC_HSSL_HSSL1_CH3_TRG /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF00381F0u)

/** Alias (User Manual Name) for SRC_HSSL_HSSL1_CH3_TRG.
* To use register names with standard convension, please use SRC_HSSL_HSSL1_CH3_TRG.
*/
#define	SRC_HSSL1TRG3	(SRC_HSSL_HSSL1_CH3_TRG)

/** \brief  1F4, Exception Service Request */
#define SRC_HSSL_HSSL1_EXI /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF00381F4u)

/** Alias (User Manual Name) for SRC_HSSL_HSSL1_EXI.
* To use register names with standard convension, please use SRC_HSSL_HSSL1_EXI.
*/
#define	SRC_HSSL1EXI	(SRC_HSSL_HSSL1_EXI)

/** \brief  200, I2C Data Transfer Request */
#define SRC_I2C_I2C0_DTR /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038200u)

/** Alias (User Manual Name) for SRC_I2C_I2C0_DTR.
* To use register names with standard convension, please use SRC_I2C_I2C0_DTR.
*/
#define	SRC_I2C0DTR	(SRC_I2C_I2C0_DTR)

/** \brief  204, I2C Error Service Request */
#define SRC_I2C_I2C0_ERR /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038204u)

/** Alias (User Manual Name) for SRC_I2C_I2C0_ERR.
* To use register names with standard convension, please use SRC_I2C_I2C0_ERR.
*/
#define	SRC_I2C0ERR	(SRC_I2C_I2C0_ERR)

/** \brief  208, I2C Kernel Service Request */
#define SRC_I2C_I2C0_P /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038208u)

/** Alias (User Manual Name) for SRC_I2C_I2C0_P.
* To use register names with standard convension, please use SRC_I2C_I2C0_P.
*/
#define	SRC_I2C0P	(SRC_I2C_I2C0_P)

/** \brief  210, I2C Data Transfer Request */
#define SRC_I2C_I2C1_DTR /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038210u)

/** Alias (User Manual Name) for SRC_I2C_I2C1_DTR.
* To use register names with standard convension, please use SRC_I2C_I2C1_DTR.
*/
#define	SRC_I2C1DTR	(SRC_I2C_I2C1_DTR)

/** \brief  214, I2C Error Service Request */
#define SRC_I2C_I2C1_ERR /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038214u)

/** Alias (User Manual Name) for SRC_I2C_I2C1_ERR.
* To use register names with standard convension, please use SRC_I2C_I2C1_ERR.
*/
#define	SRC_I2C1ERR	(SRC_I2C_I2C1_ERR)

