Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxSrc_reg.h
/** \brief  218, I2C Kernel Service Request */
#define SRC_I2C_I2C1_P /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038218u)

/** Alias (User Manual Name) for SRC_I2C_I2C1_P.
* To use register names with standard convension, please use SRC_I2C_I2C1_P.
*/
#define	SRC_I2C1P	(SRC_I2C_I2C1_P)

/** \brief  250, MSC Service Request 0 */
#define SRC_MSC_MSC0_SR0 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038250u)

/** Alias (User Manual Name) for SRC_MSC_MSC0_SR0.
* To use register names with standard convension, please use SRC_MSC_MSC0_SR0.
*/
#define	SRC_MSC0SR0	(SRC_MSC_MSC0_SR0)

/** \brief  254, MSC Service Request 1 */
#define SRC_MSC_MSC0_SR1 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038254u)

/** Alias (User Manual Name) for SRC_MSC_MSC0_SR1.
* To use register names with standard convension, please use SRC_MSC_MSC0_SR1.
*/
#define	SRC_MSC0SR1	(SRC_MSC_MSC0_SR1)

/** \brief  258, MSC Service Request 2 */
#define SRC_MSC_MSC0_SR2 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038258u)

/** Alias (User Manual Name) for SRC_MSC_MSC0_SR2.
* To use register names with standard convension, please use SRC_MSC_MSC0_SR2.
*/
#define	SRC_MSC0SR2	(SRC_MSC_MSC0_SR2)

/** \brief  25C, MSC Service Request 3 */
#define SRC_MSC_MSC0_SR3 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF003825Cu)

/** Alias (User Manual Name) for SRC_MSC_MSC0_SR3.
* To use register names with standard convension, please use SRC_MSC_MSC0_SR3.
*/
#define	SRC_MSC0SR3	(SRC_MSC_MSC0_SR3)

/** \brief  260, MSC Service Request 4 */
#define SRC_MSC_MSC0_SR4 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038260u)

/** Alias (User Manual Name) for SRC_MSC_MSC0_SR4.
* To use register names with standard convension, please use SRC_MSC_MSC0_SR4.
*/
#define	SRC_MSC0SR4	(SRC_MSC_MSC0_SR4)

/** \brief  264, MSC Service Request 0 */
#define SRC_MSC_MSC1_SR0 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038264u)

/** Alias (User Manual Name) for SRC_MSC_MSC1_SR0.
* To use register names with standard convension, please use SRC_MSC_MSC1_SR0.
*/
#define	SRC_MSC1SR0	(SRC_MSC_MSC1_SR0)

/** \brief  268, MSC Service Request 1 */
#define SRC_MSC_MSC1_SR1 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038268u)

/** Alias (User Manual Name) for SRC_MSC_MSC1_SR1.
* To use register names with standard convension, please use SRC_MSC_MSC1_SR1.
*/
#define	SRC_MSC1SR1	(SRC_MSC_MSC1_SR1)

/** \brief  26C, MSC Service Request 2 */
#define SRC_MSC_MSC1_SR2 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF003826Cu)

/** Alias (User Manual Name) for SRC_MSC_MSC1_SR2.
* To use register names with standard convension, please use SRC_MSC_MSC1_SR2.
*/
#define	SRC_MSC1SR2	(SRC_MSC_MSC1_SR2)

/** \brief  270, MSC Service Request 3 */
#define SRC_MSC_MSC1_SR3 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038270u)

/** Alias (User Manual Name) for SRC_MSC_MSC1_SR3.
* To use register names with standard convension, please use SRC_MSC_MSC1_SR3.
*/
#define	SRC_MSC1SR3	(SRC_MSC_MSC1_SR3)

/** \brief  274, MSC Service Request 4 */
#define SRC_MSC_MSC1_SR4 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038274u)

/** Alias (User Manual Name) for SRC_MSC_MSC1_SR4.
* To use register names with standard convension, please use SRC_MSC_MSC1_SR4.
*/
#define	SRC_MSC1SR4	(SRC_MSC_MSC1_SR4)

/** \brief  278, MSC Service Request 0 */
#define SRC_MSC_MSC2_SR0 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038278u)

/** Alias (User Manual Name) for SRC_MSC_MSC2_SR0.
* To use register names with standard convension, please use SRC_MSC_MSC2_SR0.
*/
#define	SRC_MSC2SR0	(SRC_MSC_MSC2_SR0)

/** \brief  27C, MSC Service Request 1 */
#define SRC_MSC_MSC2_SR1 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF003827Cu)

/** Alias (User Manual Name) for SRC_MSC_MSC2_SR1.
* To use register names with standard convension, please use SRC_MSC_MSC2_SR1.
*/
#define	SRC_MSC2SR1	(SRC_MSC_MSC2_SR1)

/** \brief  280, MSC Service Request 2 */
#define SRC_MSC_MSC2_SR2 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038280u)

/** Alias (User Manual Name) for SRC_MSC_MSC2_SR2.
* To use register names with standard convension, please use SRC_MSC_MSC2_SR2.
*/
#define	SRC_MSC2SR2	(SRC_MSC_MSC2_SR2)

/** \brief  284, MSC Service Request 3 */
#define SRC_MSC_MSC2_SR3 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038284u)

/** Alias (User Manual Name) for SRC_MSC_MSC2_SR3.
* To use register names with standard convension, please use SRC_MSC_MSC2_SR3.
*/
#define	SRC_MSC2SR3	(SRC_MSC_MSC2_SR3)

/** \brief  288, MSC Service Request 4 */
#define SRC_MSC_MSC2_SR4 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038288u)

/** Alias (User Manual Name) for SRC_MSC_MSC2_SR4.
* To use register names with standard convension, please use SRC_MSC_MSC2_SR4.
*/
#define	SRC_MSC2SR4	(SRC_MSC_MSC2_SR4)

/** \brief  28C, MSC Service Request 0 */
#define SRC_MSC_MSC3_SR0 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF003828Cu)

/** Alias (User Manual Name) for SRC_MSC_MSC3_SR0.
* To use register names with standard convension, please use SRC_MSC_MSC3_SR0.
*/
#define	SRC_MSC3SR0	(SRC_MSC_MSC3_SR0)

/** \brief  290, MSC Service Request 1 */
#define SRC_MSC_MSC3_SR1 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038290u)

/** Alias (User Manual Name) for SRC_MSC_MSC3_SR1.
* To use register names with standard convension, please use SRC_MSC_MSC3_SR1.
*/
#define	SRC_MSC3SR1	(SRC_MSC_MSC3_SR1)

/** \brief  294, MSC Service Request 2 */
#define SRC_MSC_MSC3_SR2 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038294u)

/** Alias (User Manual Name) for SRC_MSC_MSC3_SR2.
* To use register names with standard convension, please use SRC_MSC_MSC3_SR2.
*/
#define	SRC_MSC3SR2	(SRC_MSC_MSC3_SR2)

/** \brief  298, MSC Service Request 3 */
#define SRC_MSC_MSC3_SR3 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038298u)

/** Alias (User Manual Name) for SRC_MSC_MSC3_SR3.
* To use register names with standard convension, please use SRC_MSC_MSC3_SR3.
*/
#define	SRC_MSC3SR3	(SRC_MSC_MSC3_SR3)

/** \brief  29C, MSC Service Request 4 */
#define SRC_MSC_MSC3_SR4 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF003829Cu)

