Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxSrc_reg.h
/** Alias (User Manual Name) for SRC_QSPI_QSPI3_RX.
* To use register names with standard convension, please use SRC_QSPI_QSPI3_RX.
*/
#define	SRC_QSPI3RX	(SRC_QSPI_QSPI3_RX)

/** \brief  FC, QSPI Transmit Service Request */
#define SRC_QSPI_QSPI3_TX /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF00380FCu)

/** Alias (User Manual Name) for SRC_QSPI_QSPI3_TX.
* To use register names with standard convension, please use SRC_QSPI_QSPI3_TX.
*/
#define	SRC_QSPI3TX	(SRC_QSPI_QSPI3_TX)

/** \brief  10C, QSPI User Defined Service Request */
#define SRC_QSPI_QSPI3_U /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF003810Cu)

/** Alias (User Manual Name) for SRC_QSPI_QSPI3_U.
* To use register names with standard convension, please use SRC_QSPI_QSPI3_U.
*/
#define	SRC_QSPI3U	(SRC_QSPI_QSPI3_U)

/** \brief  118, QSPI Error Service Request */
#define SRC_QSPI_QSPI4_ERR /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038118u)

/** Alias (User Manual Name) for SRC_QSPI_QSPI4_ERR.
* To use register names with standard convension, please use SRC_QSPI_QSPI4_ERR.
*/
#define	SRC_QSPI4ERR	(SRC_QSPI_QSPI4_ERR)

/** \brief  11C, QSPI Phase Transition Service Request */
#define SRC_QSPI_QSPI4_PT /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF003811Cu)

/** Alias (User Manual Name) for SRC_QSPI_QSPI4_PT.
* To use register names with standard convension, please use SRC_QSPI_QSPI4_PT.
*/
#define	SRC_QSPI4PT	(SRC_QSPI_QSPI4_PT)

/** \brief  114, QSPI Receive Service Request */
#define SRC_QSPI_QSPI4_RX /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038114u)

/** Alias (User Manual Name) for SRC_QSPI_QSPI4_RX.
* To use register names with standard convension, please use SRC_QSPI_QSPI4_RX.
*/
#define	SRC_QSPI4RX	(SRC_QSPI_QSPI4_RX)

/** \brief  110, QSPI Transmit Service Request */
#define SRC_QSPI_QSPI4_TX /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038110u)

/** Alias (User Manual Name) for SRC_QSPI_QSPI4_TX.
* To use register names with standard convension, please use SRC_QSPI_QSPI4_TX.
*/
#define	SRC_QSPI4TX	(SRC_QSPI_QSPI4_TX)

/** \brief  120, QSPI User Defined Service Request */
#define SRC_QSPI_QSPI4_U /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038120u)

/** Alias (User Manual Name) for SRC_QSPI_QSPI4_U.
* To use register names with standard convension, please use SRC_QSPI_QSPI4_U.
*/
#define	SRC_QSPI4U	(SRC_QSPI_QSPI4_U)

/** \brief  12C, QSPI Error Service Request */
#define SRC_QSPI_QSPI5_ERR /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF003812Cu)

/** Alias (User Manual Name) for SRC_QSPI_QSPI5_ERR.
* To use register names with standard convension, please use SRC_QSPI_QSPI5_ERR.
*/
#define	SRC_QSPI5ERR	(SRC_QSPI_QSPI5_ERR)

/** \brief  130, QSPI Phase Transition Service Request */
#define SRC_QSPI_QSPI5_PT /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038130u)

/** Alias (User Manual Name) for SRC_QSPI_QSPI5_PT.
* To use register names with standard convension, please use SRC_QSPI_QSPI5_PT.
*/
#define	SRC_QSPI5PT	(SRC_QSPI_QSPI5_PT)

/** \brief  128, QSPI Receive Service Request */
#define SRC_QSPI_QSPI5_RX /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038128u)

/** Alias (User Manual Name) for SRC_QSPI_QSPI5_RX.
* To use register names with standard convension, please use SRC_QSPI_QSPI5_RX.
*/
#define	SRC_QSPI5RX	(SRC_QSPI_QSPI5_RX)

/** \brief  124, QSPI Transmit Service Request */
#define SRC_QSPI_QSPI5_TX /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038124u)

/** Alias (User Manual Name) for SRC_QSPI_QSPI5_TX.
* To use register names with standard convension, please use SRC_QSPI_QSPI5_TX.
*/
#define	SRC_QSPI5TX	(SRC_QSPI_QSPI5_TX)

/** \brief  134, QSPI User Defined Service Request */
#define SRC_QSPI_QSPI5_U /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038134u)

/** Alias (User Manual Name) for SRC_QSPI_QSPI5_U.
* To use register names with standard convension, please use SRC_QSPI_QSPI5_U.
*/
#define	SRC_QSPI5U	(SRC_QSPI_QSPI5_U)

/** \brief  970, Radar Interface  Error Service Request */
#define SRC_RIF_RIF0_ERR /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038970u)

/** Alias (User Manual Name) for SRC_RIF_RIF0_ERR.
* To use register names with standard convension, please use SRC_RIF_RIF0_ERR.
*/
#define	SRC_RIF0ERR	(SRC_RIF_RIF0_ERR)

/** \brief  974, Radar Interface  Service Request */
#define SRC_RIF_RIF0_INT /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038974u)

/** Alias (User Manual Name) for SRC_RIF_RIF0_INT.
* To use register names with standard convension, please use SRC_RIF_RIF0_INT.
*/
#define	SRC_RIF0INT	(SRC_RIF_RIF0_INT)

/** \brief  978, Radar Interface  Error Service Request */
#define SRC_RIF_RIF1_ERR /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038978u)

/** Alias (User Manual Name) for SRC_RIF_RIF1_ERR.
* To use register names with standard convension, please use SRC_RIF_RIF1_ERR.
*/
#define	SRC_RIF1ERR	(SRC_RIF_RIF1_ERR)

/** \brief  97C, Radar Interface  Service Request */
#define SRC_RIF_RIF1_INT /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF003897Cu)

/** Alias (User Manual Name) for SRC_RIF_RIF1_INT.
* To use register names with standard convension, please use SRC_RIF_RIF1_INT.
*/
#define	SRC_RIF1INT	(SRC_RIF_RIF1_INT)

/** \brief  8B0, Stand By Controller Service Request */
#define SRC_SCR /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF00388B0u)

/** \brief  880, SCU ERU Service Request */
#define SRC_SCUERU0 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038880u)

/** \brief  884, SCU ERU Service Request */
#define SRC_SCUERU1 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038884u)

/** \brief  888, SCU ERU Service Request */
#define SRC_SCUERU2 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038888u)

/** \brief  88C, SCU ERU Service Request */
#define SRC_SCUERU3 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF003888Cu)

/** \brief  220, SENT TRIG Service Request */
#define SRC_SENT_SENT0_SR /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038220u)

/** Alias (User Manual Name) for SRC_SENT_SENT0_SR.
* To use register names with standard convension, please use SRC_SENT_SENT0_SR.
*/
#define	SRC_SENT0	(SRC_SENT_SENT0_SR)

/** \brief  224, SENT TRIG Service Request */
#define SRC_SENT_SENT1_SR /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038224u)

/** Alias (User Manual Name) for SRC_SENT_SENT1_SR.
* To use register names with standard convension, please use SRC_SENT_SENT1_SR.
*/
#define	SRC_SENT1	(SRC_SENT_SENT1_SR)

/** \brief  228, SENT TRIG Service Request */
#define SRC_SENT_SENT2_SR /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038228u)

/** Alias (User Manual Name) for SRC_SENT_SENT2_SR.
* To use register names with standard convension, please use SRC_SENT_SENT2_SR.
*/
#define	SRC_SENT2	(SRC_SENT_SENT2_SR)

/** \brief  22C, SENT TRIG Service Request */
#define SRC_SENT_SENT3_SR /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF003822Cu)

/** Alias (User Manual Name) for SRC_SENT_SENT3_SR.
* To use register names with standard convension, please use SRC_SENT_SENT3_SR.
*/
#define	SRC_SENT3	(SRC_SENT_SENT3_SR)

/** \brief  230, SENT TRIG Service Request */
#define SRC_SENT_SENT4_SR /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038230u)

/** Alias (User Manual Name) for SRC_SENT_SENT4_SR.
* To use register names with standard convension, please use SRC_SENT_SENT4_SR.
*/
#define	SRC_SENT4	(SRC_SENT_SENT4_SR)

/** \brief  234, SENT TRIG Service Request */
#define SRC_SENT_SENT5_SR /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038234u)

/** Alias (User Manual Name) for SRC_SENT_SENT5_SR.
* To use register names with standard convension, please use SRC_SENT_SENT5_SR.
*/
#define	SRC_SENT5	(SRC_SENT_SENT5_SR)

/** \brief  238, SENT TRIG Service Request */
#define SRC_SENT_SENT6_SR /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038238u)

/** Alias (User Manual Name) for SRC_SENT_SENT6_SR.
* To use register names with standard convension, please use SRC_SENT_SENT6_SR.
*/
#define	SRC_SENT6	(SRC_SENT_SENT6_SR)

/** \brief  23C, SENT TRIG Service Request */
#define SRC_SENT_SENT7_SR /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF003823Cu)

/** Alias (User Manual Name) for SRC_SENT_SENT7_SR.
* To use register names with standard convension, please use SRC_SENT_SENT7_SR.
*/
#define	SRC_SENT7	(SRC_SENT_SENT7_SR)

/** \brief  240, SENT TRIG Service Request */
#define SRC_SENT_SENT8_SR /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038240u)

