Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxSrc_reg.h
/** Alias (User Manual Name) for SRC_SENT_SENT8_SR.
* To use register names with standard convension, please use SRC_SENT_SENT8_SR.
*/
#define	SRC_SENT8	(SRC_SENT_SENT8_SR)

/** \brief  244, SENT TRIG Service Request */
#define SRC_SENT_SENT9_SR /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038244u)

/** Alias (User Manual Name) for SRC_SENT_SENT9_SR.
* To use register names with standard convension, please use SRC_SENT_SENT9_SR.
*/
#define	SRC_SENT9	(SRC_SENT_SENT9_SR)

/** \brief  8C0, SMU Service Request */
#define SRC_SMU_SMU0_SR0 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF00388C0u)

/** Alias (User Manual Name) for SRC_SMU_SMU0_SR0.
* To use register names with standard convension, please use SRC_SMU_SMU0_SR0.
*/
#define	SRC_SMU0	(SRC_SMU_SMU0_SR0)

/** \brief  8C4, SMU Service Request */
#define SRC_SMU_SMU0_SR1 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF00388C4u)

/** Alias (User Manual Name) for SRC_SMU_SMU0_SR1.
* To use register names with standard convension, please use SRC_SMU_SMU0_SR1.
*/
#define	SRC_SMU1	(SRC_SMU_SMU0_SR1)

/** \brief  8C8, SMU Service Request */
#define SRC_SMU_SMU0_SR2 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF00388C8u)

/** Alias (User Manual Name) for SRC_SMU_SMU0_SR2.
* To use register names with standard convension, please use SRC_SMU_SMU0_SR2.
*/
#define	SRC_SMU2	(SRC_SMU_SMU0_SR2)

/** \brief  980, Signal Processing Unit  Error Service Request */
#define SRC_SPU_SPU0_ERR /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038980u)

/** Alias (User Manual Name) for SRC_SPU_SPU0_ERR.
* To use register names with standard convension, please use SRC_SPU_SPU0_ERR.
*/
#define	SRC_SPU0ERR	(SRC_SPU_SPU0_ERR)

/** \brief  984, Signal Processing Unit  Service Request */
#define SRC_SPU_SPU0_INT /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038984u)

/** Alias (User Manual Name) for SRC_SPU_SPU0_INT.
* To use register names with standard convension, please use SRC_SPU_SPU0_INT.
*/
#define	SRC_SPU0INT	(SRC_SPU_SPU0_INT)

/** \brief  988, Signal Processing Unit  Error Service Request */
#define SRC_SPU_SPU1_ERR /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038988u)

/** Alias (User Manual Name) for SRC_SPU_SPU1_ERR.
* To use register names with standard convension, please use SRC_SPU_SPU1_ERR.
*/
#define	SRC_SPU1ERR	(SRC_SPU_SPU1_ERR)

/** \brief  98C, Signal Processing Unit  Service Request */
#define SRC_SPU_SPU1_INT /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF003898Cu)

/** Alias (User Manual Name) for SRC_SPU_SPU1_INT.
* To use register names with standard convension, please use SRC_SPU_SPU1_INT.
*/
#define	SRC_SPU1INT	(SRC_SPU_SPU1_INT)

/** \brief  300, System Timer  Service Request 0 */
#define SRC_STM_STM0_SR0 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038300u)

/** Alias (User Manual Name) for SRC_STM_STM0_SR0.
* To use register names with standard convension, please use SRC_STM_STM0_SR0.
*/
#define	SRC_STM0SR0	(SRC_STM_STM0_SR0)

/** \brief  304, System Timer  Service Request 1 */
#define SRC_STM_STM0_SR1 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038304u)

/** Alias (User Manual Name) for SRC_STM_STM0_SR1.
* To use register names with standard convension, please use SRC_STM_STM0_SR1.
*/
#define	SRC_STM0SR1	(SRC_STM_STM0_SR1)

/** \brief  308, System Timer  Service Request 0 */
#define SRC_STM_STM1_SR0 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038308u)

/** Alias (User Manual Name) for SRC_STM_STM1_SR0.
* To use register names with standard convension, please use SRC_STM_STM1_SR0.
*/
#define	SRC_STM1SR0	(SRC_STM_STM1_SR0)

/** \brief  30C, System Timer  Service Request 1 */
#define SRC_STM_STM1_SR1 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF003830Cu)

/** Alias (User Manual Name) for SRC_STM_STM1_SR1.
* To use register names with standard convension, please use SRC_STM_STM1_SR1.
*/
#define	SRC_STM1SR1	(SRC_STM_STM1_SR1)

/** \brief  310, System Timer  Service Request 0 */
#define SRC_STM_STM2_SR0 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038310u)

/** Alias (User Manual Name) for SRC_STM_STM2_SR0.
* To use register names with standard convension, please use SRC_STM_STM2_SR0.
*/
#define	SRC_STM2SR0	(SRC_STM_STM2_SR0)

/** \brief  314, System Timer  Service Request 1 */
#define SRC_STM_STM2_SR1 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038314u)

/** Alias (User Manual Name) for SRC_STM_STM2_SR1.
* To use register names with standard convension, please use SRC_STM_STM2_SR1.
*/
#define	SRC_STM2SR1	(SRC_STM_STM2_SR1)

/** \brief  318, System Timer  Service Request 0 */
#define SRC_STM_STM3_SR0 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038318u)

/** Alias (User Manual Name) for SRC_STM_STM3_SR0.
* To use register names with standard convension, please use SRC_STM_STM3_SR0.
*/
#define	SRC_STM3SR0	(SRC_STM_STM3_SR0)

/** \brief  31C, System Timer  Service Request 1 */
#define SRC_STM_STM3_SR1 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF003831Cu)

/** Alias (User Manual Name) for SRC_STM_STM3_SR1.
* To use register names with standard convension, please use SRC_STM_STM3_SR1.
*/
#define	SRC_STM3SR1	(SRC_STM_STM3_SR1)

/** \brief  320, System Timer  Service Request 0 */
#define SRC_STM_STM4_SR0 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038320u)

/** Alias (User Manual Name) for SRC_STM_STM4_SR0.
* To use register names with standard convension, please use SRC_STM_STM4_SR0.
*/
#define	SRC_STM4SR0	(SRC_STM_STM4_SR0)

/** \brief  324, System Timer  Service Request 1 */
#define SRC_STM_STM4_SR1 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038324u)

/** Alias (User Manual Name) for SRC_STM_STM4_SR1.
* To use register names with standard convension, please use SRC_STM_STM4_SR1.
*/
#define	SRC_STM4SR1	(SRC_STM_STM4_SR1)

/** \brief  328, System Timer  Service Request 0 */
#define SRC_STM_STM5_SR0 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038328u)

/** Alias (User Manual Name) for SRC_STM_STM5_SR0.
* To use register names with standard convension, please use SRC_STM_STM5_SR0.
*/
#define	SRC_STM5SR0	(SRC_STM_STM5_SR0)

/** \brief  32C, System Timer  Service Request 1 */
#define SRC_STM_STM5_SR1 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF003832Cu)

