Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxSrc_reg.h
/** Alias (User Manual Name) for SRC_STM_STM5_SR1.
* To use register names with standard convension, please use SRC_STM_STM5_SR1.
*/
#define	SRC_STM5SR1	(SRC_STM_STM5_SR1)

/** \brief  750, VADC Common Group  Service Request 0 */
#define SRC_VADC_CG0_SR0 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038750u)

/** Alias (User Manual Name) for SRC_VADC_CG0_SR0.
* To use register names with standard convension, please use SRC_VADC_CG0_SR0.
*/
#define	SRC_VADCCG0SR0	(SRC_VADC_CG0_SR0)

/** \brief  754, VADC Common Group  Service Request 1 */
#define SRC_VADC_CG0_SR1 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038754u)

/** Alias (User Manual Name) for SRC_VADC_CG0_SR1.
* To use register names with standard convension, please use SRC_VADC_CG0_SR1.
*/
#define	SRC_VADCCG0SR1	(SRC_VADC_CG0_SR1)

/** \brief  758, VADC Common Group  Service Request 2 */
#define SRC_VADC_CG0_SR2 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038758u)

/** Alias (User Manual Name) for SRC_VADC_CG0_SR2.
* To use register names with standard convension, please use SRC_VADC_CG0_SR2.
*/
#define	SRC_VADCCG0SR2	(SRC_VADC_CG0_SR2)

/** \brief  75C, VADC Common Group  Service Request 3 */
#define SRC_VADC_CG0_SR3 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF003875Cu)

/** Alias (User Manual Name) for SRC_VADC_CG0_SR3.
* To use register names with standard convension, please use SRC_VADC_CG0_SR3.
*/
#define	SRC_VADCCG0SR3	(SRC_VADC_CG0_SR3)

/** \brief  760, VADC Common Group  Service Request 0 */
#define SRC_VADC_CG1_SR0 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038760u)

/** Alias (User Manual Name) for SRC_VADC_CG1_SR0.
* To use register names with standard convension, please use SRC_VADC_CG1_SR0.
*/
#define	SRC_VADCCG1SR0	(SRC_VADC_CG1_SR0)

/** \brief  764, VADC Common Group  Service Request 1 */
#define SRC_VADC_CG1_SR1 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038764u)

/** Alias (User Manual Name) for SRC_VADC_CG1_SR1.
* To use register names with standard convension, please use SRC_VADC_CG1_SR1.
*/
#define	SRC_VADCCG1SR1	(SRC_VADC_CG1_SR1)

/** \brief  768, VADC Common Group  Service Request 2 */
#define SRC_VADC_CG1_SR2 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038768u)

/** Alias (User Manual Name) for SRC_VADC_CG1_SR2.
* To use register names with standard convension, please use SRC_VADC_CG1_SR2.
*/
#define	SRC_VADCCG1SR2	(SRC_VADC_CG1_SR2)

/** \brief  76C, VADC Common Group  Service Request 3 */
#define SRC_VADC_CG1_SR3 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF003876Cu)

/** Alias (User Manual Name) for SRC_VADC_CG1_SR3.
* To use register names with standard convension, please use SRC_VADC_CG1_SR3.
*/
#define	SRC_VADCCG1SR3	(SRC_VADC_CG1_SR3)

/** \brief  670, VADC Group  Service Request 0 */
#define SRC_VADC_G0_SR0 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038670u)

/** Alias (User Manual Name) for SRC_VADC_G0_SR0.
* To use register names with standard convension, please use SRC_VADC_G0_SR0.
*/
#define	SRC_VADCG0SR0	(SRC_VADC_G0_SR0)

/** \brief  674, VADC Group  Service Request 1 */
#define SRC_VADC_G0_SR1 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038674u)

/** Alias (User Manual Name) for SRC_VADC_G0_SR1.
* To use register names with standard convension, please use SRC_VADC_G0_SR1.
*/
#define	SRC_VADCG0SR1	(SRC_VADC_G0_SR1)

/** \brief  678, VADC Group  Service Request 2 */
#define SRC_VADC_G0_SR2 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038678u)

/** Alias (User Manual Name) for SRC_VADC_G0_SR2.
* To use register names with standard convension, please use SRC_VADC_G0_SR2.
*/
#define	SRC_VADCG0SR2	(SRC_VADC_G0_SR2)

/** \brief  67C, VADC Group  Service Request 3 */
#define SRC_VADC_G0_SR3 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF003867Cu)

/** Alias (User Manual Name) for SRC_VADC_G0_SR3.
* To use register names with standard convension, please use SRC_VADC_G0_SR3.
*/
#define	SRC_VADCG0SR3	(SRC_VADC_G0_SR3)

/** \brief  710, VADC Group  Service Request 0 */
#define SRC_VADC_G10_SR0 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038710u)

/** Alias (User Manual Name) for SRC_VADC_G10_SR0.
* To use register names with standard convension, please use SRC_VADC_G10_SR0.
*/
#define	SRC_VADCG10SR0	(SRC_VADC_G10_SR0)

/** \brief  714, VADC Group  Service Request 1 */
#define SRC_VADC_G10_SR1 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038714u)

/** Alias (User Manual Name) for SRC_VADC_G10_SR1.
* To use register names with standard convension, please use SRC_VADC_G10_SR1.
*/
#define	SRC_VADCG10SR1	(SRC_VADC_G10_SR1)

/** \brief  718, VADC Group  Service Request 2 */
#define SRC_VADC_G10_SR2 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038718u)

/** Alias (User Manual Name) for SRC_VADC_G10_SR2.
* To use register names with standard convension, please use SRC_VADC_G10_SR2.
*/
#define	SRC_VADCG10SR2	(SRC_VADC_G10_SR2)

/** \brief  71C, VADC Group  Service Request 3 */
#define SRC_VADC_G10_SR3 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF003871Cu)

/** Alias (User Manual Name) for SRC_VADC_G10_SR3.
* To use register names with standard convension, please use SRC_VADC_G10_SR3.
*/
#define	SRC_VADCG10SR3	(SRC_VADC_G10_SR3)

/** \brief  720, VADC Group  Service Request 0 */
#define SRC_VADC_G11_SR0 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038720u)

/** Alias (User Manual Name) for SRC_VADC_G11_SR0.
* To use register names with standard convension, please use SRC_VADC_G11_SR0.
*/
#define	SRC_VADCG11SR0	(SRC_VADC_G11_SR0)

/** \brief  724, VADC Group  Service Request 1 */
#define SRC_VADC_G11_SR1 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038724u)

/** Alias (User Manual Name) for SRC_VADC_G11_SR1.
* To use register names with standard convension, please use SRC_VADC_G11_SR1.
*/
#define	SRC_VADCG11SR1	(SRC_VADC_G11_SR1)

/** \brief  728, VADC Group  Service Request 2 */
#define SRC_VADC_G11_SR2 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038728u)

/** Alias (User Manual Name) for SRC_VADC_G11_SR2.
* To use register names with standard convension, please use SRC_VADC_G11_SR2.
*/
#define	SRC_VADCG11SR2	(SRC_VADC_G11_SR2)

/** \brief  72C, VADC Group  Service Request 3 */
#define SRC_VADC_G11_SR3 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF003872Cu)

/** Alias (User Manual Name) for SRC_VADC_G11_SR3.
* To use register names with standard convension, please use SRC_VADC_G11_SR3.
*/
#define	SRC_VADCG11SR3	(SRC_VADC_G11_SR3)

/** \brief  730, VADC Group 12 Service Request 0 */
#define SRC_VADC_G12SR0 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038730u)

/** Alias (User Manual Name) for SRC_VADC_G12SR0.
* To use register names with standard convension, please use SRC_VADC_G12SR0.
*/
#define	SRC_VADCG12SR0	(SRC_VADC_G12SR0)

/** \brief  734, VADC Group 13 Service Request 0 */
#define SRC_VADC_G13SR0 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038734u)

/** Alias (User Manual Name) for SRC_VADC_G13SR0.
* To use register names with standard convension, please use SRC_VADC_G13SR0.
*/
#define	SRC_VADCG13SR0	(SRC_VADC_G13SR0)

