Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxSrc_reg.h
/** \brief  738, VADC Group 14 Service Request 0 */
#define SRC_VADC_G14SR0 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038738u)

/** Alias (User Manual Name) for SRC_VADC_G14SR0.
* To use register names with standard convension, please use SRC_VADC_G14SR0.
*/
#define	SRC_VADCG14SR0	(SRC_VADC_G14SR0)

/** \brief  73C, VADC Group 15 Service Request 0 */
#define SRC_VADC_G15SR0 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF003873Cu)

/** Alias (User Manual Name) for SRC_VADC_G15SR0.
* To use register names with standard convension, please use SRC_VADC_G15SR0.
*/
#define	SRC_VADCG15SR0	(SRC_VADC_G15SR0)

/** \brief  740, VADC Group 16 Service Request 0 */
#define SRC_VADC_G16SR0 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038740u)

/** Alias (User Manual Name) for SRC_VADC_G16SR0.
* To use register names with standard convension, please use SRC_VADC_G16SR0.
*/
#define	SRC_VADCG16SR0	(SRC_VADC_G16SR0)

/** \brief  744, VADC Group 17 Service Request 0 */
#define SRC_VADC_G17SR0 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038744u)

/** Alias (User Manual Name) for SRC_VADC_G17SR0.
* To use register names with standard convension, please use SRC_VADC_G17SR0.
*/
#define	SRC_VADCG17SR0	(SRC_VADC_G17SR0)

/** \brief  748, VADC Group 18 Service Request 0 */
#define SRC_VADC_G18SR0 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038748u)

/** Alias (User Manual Name) for SRC_VADC_G18SR0.
* To use register names with standard convension, please use SRC_VADC_G18SR0.
*/
#define	SRC_VADCG18SR0	(SRC_VADC_G18SR0)

/** \brief  74C, VADC Group 19 Service Request 0 */
#define SRC_VADC_G19SR0 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF003874Cu)

/** Alias (User Manual Name) for SRC_VADC_G19SR0.
* To use register names with standard convension, please use SRC_VADC_G19SR0.
*/
#define	SRC_VADCG19SR0	(SRC_VADC_G19SR0)

/** \brief  680, VADC Group  Service Request 0 */
#define SRC_VADC_G1_SR0 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038680u)

/** Alias (User Manual Name) for SRC_VADC_G1_SR0.
* To use register names with standard convension, please use SRC_VADC_G1_SR0.
*/
#define	SRC_VADCG1SR0	(SRC_VADC_G1_SR0)

/** \brief  684, VADC Group  Service Request 1 */
#define SRC_VADC_G1_SR1 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038684u)

/** Alias (User Manual Name) for SRC_VADC_G1_SR1.
* To use register names with standard convension, please use SRC_VADC_G1_SR1.
*/
#define	SRC_VADCG1SR1	(SRC_VADC_G1_SR1)

/** \brief  688, VADC Group  Service Request 2 */
#define SRC_VADC_G1_SR2 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038688u)

/** Alias (User Manual Name) for SRC_VADC_G1_SR2.
* To use register names with standard convension, please use SRC_VADC_G1_SR2.
*/
#define	SRC_VADCG1SR2	(SRC_VADC_G1_SR2)

/** \brief  68C, VADC Group  Service Request 3 */
#define SRC_VADC_G1_SR3 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF003868Cu)

/** Alias (User Manual Name) for SRC_VADC_G1_SR3.
* To use register names with standard convension, please use SRC_VADC_G1_SR3.
*/
#define	SRC_VADCG1SR3	(SRC_VADC_G1_SR3)

/** \brief  690, VADC Group  Service Request 0 */
#define SRC_VADC_G2_SR0 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038690u)

/** Alias (User Manual Name) for SRC_VADC_G2_SR0.
* To use register names with standard convension, please use SRC_VADC_G2_SR0.
*/
#define	SRC_VADCG2SR0	(SRC_VADC_G2_SR0)

/** \brief  694, VADC Group  Service Request 1 */
#define SRC_VADC_G2_SR1 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038694u)

/** Alias (User Manual Name) for SRC_VADC_G2_SR1.
* To use register names with standard convension, please use SRC_VADC_G2_SR1.
*/
#define	SRC_VADCG2SR1	(SRC_VADC_G2_SR1)

/** \brief  698, VADC Group  Service Request 2 */
#define SRC_VADC_G2_SR2 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038698u)

/** Alias (User Manual Name) for SRC_VADC_G2_SR2.
* To use register names with standard convension, please use SRC_VADC_G2_SR2.
*/
#define	SRC_VADCG2SR2	(SRC_VADC_G2_SR2)

/** \brief  69C, VADC Group  Service Request 3 */
#define SRC_VADC_G2_SR3 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF003869Cu)

/** Alias (User Manual Name) for SRC_VADC_G2_SR3.
* To use register names with standard convension, please use SRC_VADC_G2_SR3.
*/
#define	SRC_VADCG2SR3	(SRC_VADC_G2_SR3)

/** \brief  6A0, VADC Group  Service Request 0 */
#define SRC_VADC_G3_SR0 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF00386A0u)

/** Alias (User Manual Name) for SRC_VADC_G3_SR0.
* To use register names with standard convension, please use SRC_VADC_G3_SR0.
*/
#define	SRC_VADCG3SR0	(SRC_VADC_G3_SR0)

/** \brief  6A4, VADC Group  Service Request 1 */
#define SRC_VADC_G3_SR1 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF00386A4u)

/** Alias (User Manual Name) for SRC_VADC_G3_SR1.
* To use register names with standard convension, please use SRC_VADC_G3_SR1.
*/
#define	SRC_VADCG3SR1	(SRC_VADC_G3_SR1)

/** \brief  6A8, VADC Group  Service Request 2 */
#define SRC_VADC_G3_SR2 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF00386A8u)

/** Alias (User Manual Name) for SRC_VADC_G3_SR2.
* To use register names with standard convension, please use SRC_VADC_G3_SR2.
*/
#define	SRC_VADCG3SR2	(SRC_VADC_G3_SR2)

/** \brief  6AC, VADC Group  Service Request 3 */
#define SRC_VADC_G3_SR3 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF00386ACu)

/** Alias (User Manual Name) for SRC_VADC_G3_SR3.
* To use register names with standard convension, please use SRC_VADC_G3_SR3.
*/
#define	SRC_VADCG3SR3	(SRC_VADC_G3_SR3)

/** \brief  6B0, VADC Group  Service Request 0 */
#define SRC_VADC_G4_SR0 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF00386B0u)

/** Alias (User Manual Name) for SRC_VADC_G4_SR0.
* To use register names with standard convension, please use SRC_VADC_G4_SR0.
*/
#define	SRC_VADCG4SR0	(SRC_VADC_G4_SR0)

/** \brief  6B4, VADC Group  Service Request 1 */
#define SRC_VADC_G4_SR1 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF00386B4u)

/** Alias (User Manual Name) for SRC_VADC_G4_SR1.
* To use register names with standard convension, please use SRC_VADC_G4_SR1.
*/
#define	SRC_VADCG4SR1	(SRC_VADC_G4_SR1)

