Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxSrc_reg.h
/** \brief  6B8, VADC Group  Service Request 2 */
#define SRC_VADC_G4_SR2 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF00386B8u)

/** Alias (User Manual Name) for SRC_VADC_G4_SR2.
* To use register names with standard convension, please use SRC_VADC_G4_SR2.
*/
#define	SRC_VADCG4SR2	(SRC_VADC_G4_SR2)

/** \brief  6BC, VADC Group  Service Request 3 */
#define SRC_VADC_G4_SR3 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF00386BCu)

/** Alias (User Manual Name) for SRC_VADC_G4_SR3.
* To use register names with standard convension, please use SRC_VADC_G4_SR3.
*/
#define	SRC_VADCG4SR3	(SRC_VADC_G4_SR3)

/** \brief  6C0, VADC Group  Service Request 0 */
#define SRC_VADC_G5_SR0 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF00386C0u)

/** Alias (User Manual Name) for SRC_VADC_G5_SR0.
* To use register names with standard convension, please use SRC_VADC_G5_SR0.
*/
#define	SRC_VADCG5SR0	(SRC_VADC_G5_SR0)

/** \brief  6C4, VADC Group  Service Request 1 */
#define SRC_VADC_G5_SR1 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF00386C4u)

/** Alias (User Manual Name) for SRC_VADC_G5_SR1.
* To use register names with standard convension, please use SRC_VADC_G5_SR1.
*/
#define	SRC_VADCG5SR1	(SRC_VADC_G5_SR1)

/** \brief  6C8, VADC Group  Service Request 2 */
#define SRC_VADC_G5_SR2 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF00386C8u)

/** Alias (User Manual Name) for SRC_VADC_G5_SR2.
* To use register names with standard convension, please use SRC_VADC_G5_SR2.
*/
#define	SRC_VADCG5SR2	(SRC_VADC_G5_SR2)

/** \brief  6CC, VADC Group  Service Request 3 */
#define SRC_VADC_G5_SR3 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF00386CCu)

/** Alias (User Manual Name) for SRC_VADC_G5_SR3.
* To use register names with standard convension, please use SRC_VADC_G5_SR3.
*/
#define	SRC_VADCG5SR3	(SRC_VADC_G5_SR3)

/** \brief  6D0, VADC Group  Service Request 0 */
#define SRC_VADC_G6_SR0 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF00386D0u)

/** Alias (User Manual Name) for SRC_VADC_G6_SR0.
* To use register names with standard convension, please use SRC_VADC_G6_SR0.
*/
#define	SRC_VADCG6SR0	(SRC_VADC_G6_SR0)

/** \brief  6D4, VADC Group  Service Request 1 */
#define SRC_VADC_G6_SR1 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF00386D4u)

/** Alias (User Manual Name) for SRC_VADC_G6_SR1.
* To use register names with standard convension, please use SRC_VADC_G6_SR1.
*/
#define	SRC_VADCG6SR1	(SRC_VADC_G6_SR1)

/** \brief  6D8, VADC Group  Service Request 2 */
#define SRC_VADC_G6_SR2 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF00386D8u)

/** Alias (User Manual Name) for SRC_VADC_G6_SR2.
* To use register names with standard convension, please use SRC_VADC_G6_SR2.
*/
#define	SRC_VADCG6SR2	(SRC_VADC_G6_SR2)

/** \brief  6DC, VADC Group  Service Request 3 */
#define SRC_VADC_G6_SR3 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF00386DCu)

/** Alias (User Manual Name) for SRC_VADC_G6_SR3.
* To use register names with standard convension, please use SRC_VADC_G6_SR3.
*/
#define	SRC_VADCG6SR3	(SRC_VADC_G6_SR3)

/** \brief  6E0, VADC Group  Service Request 0 */
#define SRC_VADC_G7_SR0 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF00386E0u)

/** Alias (User Manual Name) for SRC_VADC_G7_SR0.
* To use register names with standard convension, please use SRC_VADC_G7_SR0.
*/
#define	SRC_VADCG7SR0	(SRC_VADC_G7_SR0)

/** \brief  6E4, VADC Group  Service Request 1 */
#define SRC_VADC_G7_SR1 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF00386E4u)

/** Alias (User Manual Name) for SRC_VADC_G7_SR1.
* To use register names with standard convension, please use SRC_VADC_G7_SR1.
*/
#define	SRC_VADCG7SR1	(SRC_VADC_G7_SR1)

/** \brief  6E8, VADC Group  Service Request 2 */
#define SRC_VADC_G7_SR2 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF00386E8u)

/** Alias (User Manual Name) for SRC_VADC_G7_SR2.
* To use register names with standard convension, please use SRC_VADC_G7_SR2.
*/
#define	SRC_VADCG7SR2	(SRC_VADC_G7_SR2)

/** \brief  6EC, VADC Group  Service Request 3 */
#define SRC_VADC_G7_SR3 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF00386ECu)

/** Alias (User Manual Name) for SRC_VADC_G7_SR3.
* To use register names with standard convension, please use SRC_VADC_G7_SR3.
*/
#define	SRC_VADCG7SR3	(SRC_VADC_G7_SR3)

/** \brief  6F0, VADC Group  Service Request 0 */
#define SRC_VADC_G8_SR0 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF00386F0u)

/** Alias (User Manual Name) for SRC_VADC_G8_SR0.
* To use register names with standard convension, please use SRC_VADC_G8_SR0.
*/
#define	SRC_VADCG8SR0	(SRC_VADC_G8_SR0)

/** \brief  6F4, VADC Group  Service Request 1 */
#define SRC_VADC_G8_SR1 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF00386F4u)

/** Alias (User Manual Name) for SRC_VADC_G8_SR1.
* To use register names with standard convension, please use SRC_VADC_G8_SR1.
*/
#define	SRC_VADCG8SR1	(SRC_VADC_G8_SR1)

/** \brief  6F8, VADC Group  Service Request 2 */
#define SRC_VADC_G8_SR2 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF00386F8u)

/** Alias (User Manual Name) for SRC_VADC_G8_SR2.
* To use register names with standard convension, please use SRC_VADC_G8_SR2.
*/
#define	SRC_VADCG8SR2	(SRC_VADC_G8_SR2)

/** \brief  6FC, VADC Group  Service Request 3 */
#define SRC_VADC_G8_SR3 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF00386FCu)

/** Alias (User Manual Name) for SRC_VADC_G8_SR3.
* To use register names with standard convension, please use SRC_VADC_G8_SR3.
*/
#define	SRC_VADCG8SR3	(SRC_VADC_G8_SR3)

/** \brief  700, VADC Group  Service Request 0 */
#define SRC_VADC_G9_SR0 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038700u)

/** Alias (User Manual Name) for SRC_VADC_G9_SR0.
* To use register names with standard convension, please use SRC_VADC_G9_SR0.
*/
#define	SRC_VADCG9SR0	(SRC_VADC_G9_SR0)

/** \brief  704, VADC Group  Service Request 1 */
#define SRC_VADC_G9_SR1 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038704u)

/** Alias (User Manual Name) for SRC_VADC_G9_SR1.
* To use register names with standard convension, please use SRC_VADC_G9_SR1.
*/
#define	SRC_VADCG9SR1	(SRC_VADC_G9_SR1)

/** \brief  708, VADC Group  Service Request 2 */
#define SRC_VADC_G9_SR2 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038708u)

/** Alias (User Manual Name) for SRC_VADC_G9_SR2.
* To use register names with standard convension, please use SRC_VADC_G9_SR2.
*/
#define	SRC_VADCG9SR2	(SRC_VADC_G9_SR2)

/** \brief  70C, VADC Group  Service Request 3 */
#define SRC_VADC_G9_SR3 /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF003870Cu)

/** Alias (User Manual Name) for SRC_VADC_G9_SR3.
* To use register names with standard convension, please use SRC_VADC_G9_SR3.
*/
#define	SRC_VADCG9SR3	(SRC_VADC_G9_SR3)

/** \brief  30, XBAR_SRI Service Request */
#define SRC_XBAR_XBAR0_SR /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038030u)

/** Alias (User Manual Name) for SRC_XBAR_XBAR0_SR.
* To use register names with standard convension, please use SRC_XBAR_XBAR0_SR.
*/
#define	SRC_XBAR0	(SRC_XBAR_XBAR0_SR)

/** \brief  34, XBAR_SRI Service Request */
#define SRC_XBAR_XBAR1_SR /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038034u)

/** Alias (User Manual Name) for SRC_XBAR_XBAR1_SR.
* To use register names with standard convension, please use SRC_XBAR_XBAR1_SR.
*/
#define	SRC_XBAR1	(SRC_XBAR_XBAR1_SR)

/** \brief  38, XBAR_SRI Service Request */
#define SRC_XBAR_XBAR2_SR /*lint --e(923)*/ (*(volatile Ifx_SRC_SRCR*)0xF0038038u)

/** Alias (User Manual Name) for SRC_XBAR_XBAR2_SR.
* To use register names with standard convension, please use SRC_XBAR_XBAR2_SR.
*/
#define	SRC_XBAR2	(SRC_XBAR_XBAR2_SR)
/** \}  */
/******************************************************************************/
/******************************************************************************/
#endif /* IFXSRC_REG_H */
